[
  {
    "id": "sebastian/sebastian-schedule_summer___summer_11__no_player_has_6_hearts_with_sebastian_.txt",
    "question": "What time does Sebastian get out of bed and moves to his computer?",
    "context": "On Summer → Summer 11 (No player has 6 hearts with Sebastian), At 9:00 AM, sebastian in his bed At 10:00 AM, sebastian gets out of bed and moves to his computer At 12:00 PM, sebastian in his room, standing by couch At 5:30 PM, sebastian leaving his room to go to the kitchen At 6:30 PM, sebastian on his computer At 9:30 PM, sebastian goes to bed.",
    "answer_text": "12:00 PM",
    "answer_start": 164
  },
  {
    "id": "sam/sam-schedule_summer___summer_9_and_23__no_player_has_6_hearts_with_penny_or_sam_.txt",
    "question": "What time does sam wake up and stands in his bedroom?",
    "context": "On Summer → Summer 9 and 23 (No player has 6 hearts with Penny or Sam), At 6:00 AM, sam sleeps in his bed at his home At 9:00 AM, sam wakes up and stands in his bedroom At 11:00 AM, sam walks into town, stands on the bridge near the ice cream stand At 4:00 PM, sam walk to the pink tree in front of 2 willow lane, plays his handheld video game At 7:00 PM, sam returns home from town At 9:30 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "11:00 AM",
    "answer_start": 172
  },
  {
    "id": "alex/alex-schedule_summer___green_rain__year_1_.txt",
    "question": "What is the name of the character who is in the kitchen?",
    "context": "On Summer → Green Rain (Year 1), At All day, alex in the kitchen.",
    "answer_text": "alex",
    "answer_start": 45
  },
  {
    "id": "alex/alex-schedule_spring___spring_15.txt",
    "question": "How long does it take alex to board the bus to calico desert?",
    "context": "On Spring → Spring 15, At 7:50 AM, alex leaves his house to stand under the tree outside At 10:20 AM, alex boards the bus to calico desert to attend the desert festival At 10:30 AM, alex stands by the chef stand At 12:50 AM, alex boards bus back to the valley.",
    "answer_text": "10:20 AM",
    "answer_start": 92
  },
  {
    "id": "elliott/elliott-schedule_winter___friday_and_sunday.txt",
    "question": "When does elliott leave his cabin to stand on the beach?",
    "context": "On Winter → Friday and Sunday, At 8:00 AM, elliott at home At 12:00 PM, elliott leaves his cabin to stand on the beach south of his house At 1:30 PM, elliott leaves the beach and returns to his cabin At 3:00 PM, elliott leaves his cabin to stand on the bridge just north of the beach At 6:00 PM, elliott leaves the bridge to return home for the night.",
    "answer_text": "1:30 PM",
    "answer_start": 141
  },
  {
    "id": "harvey/harvey-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the player does not have a Rabbit's Foot in inventory?",
    "context": "At Group Ten-Heart Event, if the condition \"If the player is unmarried and has given a bouquet to all available bachelors, raisedfriendshipwith each bachelor to 10 hearts, and seen each bachelor's 10-heart event, then enteringThe Stardrop Saloonwill trigger a cutscene. IfAlexis the final bachelor you share a Ten-Heart Event with, the Group Ten-Heart Event will be unavoidable as it is triggered immediately afterwards.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a friendly game of pool. If the player does not have a Rabbit's Foot in inventory, all bachelors will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelors will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelors will forgive the player, and dialogues return to normal.",
    "answer_text": "all bachelors will express anger about the player dating them all at one time",
    "answer_start": 615
  },
  {
    "id": "elliott/elliott-hate_gifts.txt",
    "question": "Who hates the following gifts: Amaranth (A purple grain cultivated by an ancient civilization.), Quartz (A clear crystal commonly found in caves and mines.), Salmonberry (A spring-time berry with the flavor of the forest.), Sea Cucumber * (A slippery, slimy creature found on the ocean floor.), and SuperCucumber",
    "context": "elliott hates the following gifts: Amaranth (A purple grain cultivated by an ancient civilization.), Quartz (A clear crystal commonly found in caves and mines.), Salmonberry (A spring-time berry with the flavor of the forest.), Sea Cucumber * (A slippery, slimy creature found on the ocean floor.), Super Cucumber * (A rare, purple variety of sea cucumber.).",
    "answer_text": "elliott",
    "answer_start": 0
  },
  {
    "id": "emily/emily-heart_event_fourteen_hearts.txt",
    "question": "How many days does it take Emily to get her 200 pieces of fiber?",
    "context": "At Fourteen Hearts, if the condition \"Exit the farmhouse between 6am and 8:20am.\" is met, the event is as follows: Emily will appear outside the farmhouse and provide a quest to bring her 200 pieces of fiber .  The quest is called \"Errand for your Wife\". After completing the quest and waiting 3 days, enter the farmhouse between 8pm and midnight.  Emily will give you a new outfit consisting of Emily's Magic Hat , Emily's Magic Boots , Emily's Magic Shirt , and a pair of matching blue Genie Pants .",
    "answer_text": "3 days",
    "answer_start": 294
  },
  {
    "id": "abigail/abigail-schedule_spring___spring_11_and_25.txt",
    "question": "When does abigail go to bed?",
    "context": "On Spring → Spring 11 and 25, At 9:00 AM, abigail leaves her room to go to the kitchen At 10:30 AM, abigail leaves the kitchen to stand in pierre's store At 1:00 PM, abigail leaves the house to go to stand on bridge near jojamart At 1:30 PM, abigail standing on the bridge near jojamart At 4:30 PM, abigail heads home At 5:20 PM, abigail in her room, playing video games At 7:30 PM, abigail goes to bed.",
    "answer_text": "7:30 PM",
    "answer_start": 374
  },
  {
    "id": "sam/sam-schedule_spring___rain__option_2_.txt",
    "question": "What time does Sam wake up for the day?",
    "context": "On Spring → Rain (Option 2), At 10:00 AM, sam wakes up for the day, moves around his room At 11:00 AM, sam moves around inside his home At 2:00 PM, sam leaves his bedroom and walks to the stardrop saloon. \"nothing like an ice cold joja cola on a sopping wet day, huh? just kidding. hehehe.\" At 7:40 PM, sam leaves the stardrop saloon and returns to his bedroom to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 32
  },
  {
    "id": "penny/penny-schedule_spring___spring_9_and_23.txt",
    "question": "How many hours does it take for penny to return to her trailer?",
    "context": "On Spring → Spring 9 and 23, At 6:00 AM, penny sleeps in her bed in the trailer At 8:00 AM, penny leaves her trailer and goes outside to read near the town graveyard At 12:30 PM, penny returns to the trailer to wash dishes At 4:00 PM, penny leaves the trailer again to go outside the saloon where she sits on a bench with maru At 6:40 PM, penny returns to her trailer for the evening.",
    "answer_text": "evening.",
    "answer_start": 376
  },
  {
    "id": "haley/haley-schedule_spring___spring_15__bus_service_restored_.txt",
    "question": "What time does Haley boards the bus back to the valley?",
    "context": "On Spring → Spring 15 (Bus Service Restored), At 10:20 AM, haley boards the bus to calico desert to attend the desert festival At 10:50 AM, haley walks around the area west of emily's outfit services At 1:30 AM, haley boards the bus back to the valley.",
    "answer_text": "1:30 AM",
    "answer_start": 203
  },
  {
    "id": "penny/penny-schedule_marriage___spring_16__bus_service_restored_.txt",
    "question": "How many hours does it take to board the bus to calico desert?",
    "context": "On Marriage → Spring 16 (Bus Service Restored), At 9:30 AM, penny boards the bus to calico desert to attend the desert festival At 10:00 AM, penny stands near the calico warp statue At 1:00 AM, penny boards the bus back to the valley.",
    "answer_text": "9:30 AM",
    "answer_start": 51
  },
  {
    "id": "sebastian/sebastian-schedule_spring___spring_15__bus_service_restored_.txt",
    "question": "What time does sebastian board the bus back to the valley?",
    "context": "On Spring → Spring 15 (Bus Service Restored), At 11:10 AM, sebastian boards the bus to calico desert to attend the desert festival At 12:00 PM, sebastian hangs out near the flamingo At 1:40 AM, sebastian boards the bus back to the valley.",
    "answer_text": "1:40 AM",
    "answer_start": 185
  },
  {
    "id": "sam/sam-schedule_summer___rain__option_1_.txt",
    "question": "What time does sam wake up for the day?",
    "context": "On Summer → Rain (Option 1), At 10:00 AM, sam wakes up for the day, stands in front of the dresser in his room At 11:00 AM, sam plays guitar inside his room At 3:00 PM, sam plays his handheld video game in the kitchen inside his house At 5:00 PM, sam returns to his bedroom. and stands in front of his dresser At 6:30 PM, sam at his desk inside his bedroom At 8:00 PM, sam goes to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 32
  },
  {
    "id": "emily/emily-schedule_marriage___fall_15__bus_service_restored_.txt",
    "question": "What time does emily arrive at the oasis?",
    "context": "On Marriage → Fall 15 (Bus Service Restored), At 6:00 AM, emily at home At 12:00 PM, emily arrives at the oasis to visit sandy on her birthday At 1:00 PM, emily leaves the oasis and walks around calico desert At 12:00 AM, emily heads home for the night.",
    "answer_text": "12:00 PM",
    "answer_start": 75
  },
  {
    "id": "haley/haley-schedule_winter___regular_schedule.txt",
    "question": "What time does Haley go to bed?",
    "context": "On Winter → Regular Schedule, At 9:00 AM, haley in her room At 11:00 AM, haley leaving home to go to the fountain At 12:20 PM, haley by the fountain, west of community center At 4:30 PM, haley heads home At 5:50 PM, haley at home, cooking dinner At 8:20 PM, haley in her room At 10:30 PM, haley goes to bed.",
    "answer_text": "10:30 PM",
    "answer_start": 279
  },
  {
    "id": "shane/shane-schedule_summer___saturday.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Summer → Saturday, At 9:00 AM, shane leaves his room and stands in kitchen at marnie's ranch At 12:00 PM, shane leaves marnie's ranch and heads to pierre's general store At 5:00 PM, shane leaves pierre's general store and heads to the stardrop saloon At 11:00 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "12:00 PM",
    "answer_start": 99
  },
  {
    "id": "haley/haley-love_gifts.txt",
    "question": "What is the name of the plant that haley loves?",
    "context": "haley loves the following gifts: Coconut (A seed of the coconut palm. It has many culinary uses.), Fruit Salad (A delicious combination of summer fruits.), Pink Cake (There's little heart candies on top.), Sunflower (A common misconception is that the flower turns so it's always facing the sun.).",
    "answer_text": "coconut palm",
    "answer_start": 56
  },
  {
    "id": "abigail/abigail-schedule_winter___friday.txt",
    "question": "How many hours does abigail spend in the stardrop saloon?",
    "context": "On Winter → Friday, At 9:00 AM, abigail leaving her room to go to the kitchen At 11:00 AM, abigail leaves the kitchen to stand in pierre's general store At 3:00 PM, abigail leaving pierre's general store to go to the stardrop saloon At 3:50 PM, abigail in the stardrop saloon, sitting on a sofa in the arcade At 9:00 PM, abigail heads home At 9:40 PM, abigail arrives home.",
    "answer_text": "3:50 PM",
    "answer_start": 236
  },
  {
    "id": "elliott/elliott-schedule_fall___rain.txt",
    "question": "What is the name of Elliott's house?",
    "context": "On Fall → Rain, At All day, elliott inside his house.",
    "answer_text": "elliott",
    "answer_start": 28
  },
  {
    "id": "leah/leah-schedule_summer___regular_schedule.txt",
    "question": "When does leah go to bed for the night?",
    "context": "On Summer → Regular Schedule, At 9:00 AM, leah sculpts in her cottage At 12:00 PM, leah leaves her cottage to draw at the beach At 7:00 PM, leah leaves the beach to return home and stands in front of her bookcase At 10:00 PM, leah stands at the table in her house At 12:00 AM, leah goes to bed for the night.",
    "answer_text": "12:00 AM",
    "answer_start": 267
  },
  {
    "id": "shane/shane-heart_event_ten_hearts.txt",
    "question": "Who does Shane give you a kiss?",
    "context": "At Ten Hearts, if the condition \"Exit your house before 6:30am to initiate the event, then walk to theBus Stopbetween 4pm and 6pm.\" is met, the event is as follows: Shane invites you to go see the Zuzu City Tunnelers (a gridball team) play in their stadium in Zuzu City . You take a bus into the city together and the scene changes to a grimy stadium with you and Shane in the stands. While cheering on the Tunnelers, Shane thanks you for sticking with him through his struggle with depression and anxiety. He then asks you what you think of your first gridball game: \"Noisy... It makes me appreciate how peaceful it is back home.\" (No effect on friendship .) \"Oh yeah? I guess that makes sense. Me? I get bored with Pelican Town sometimes. But... I like that you're different. We balance each other out.\" \"Fun... Pelican Town seems really boring in comparison.\" (No effect on friendship .) \"Oh really? I'm surprised... Didn't you move to Stardew Valley to escape the noise of the city? I mean... Don't get me wrong, I totally understand. My life in Pelican Town is pretty bland, you know.\" His attention returns to the game when the Tunnelers make a play and score a goal. In a moment of excitement, Shane gives you a kiss, but then he feels embarrassed by it and apologizes for getting carried away. After a pause, you reply with a kiss and allay his fears. The scene pans to the northwest and fades and Shane briefly reflects on the evening.",
    "answer_text": "the Tunnelers",
    "answer_start": 403
  },
  {
    "id": "leah/leah-schedule_spring___spring_16.txt",
    "question": "What time does Leah go to the waiting room of Harvey's clinic?",
    "context": "On Spring → Spring 16, At 9:00 AM, leah sculpts in her cottage At 10:30 AM, leah goes to the waiting room of harvey's clinic At 1:30 PM, leah moves from the waiting room to the left exam room in the clinic At 4:00 PM, leah leaves the clinic and walks to the stardrop saloon At 11:40 PM, leah leaves the saloon to return home and sleep.",
    "answer_text": "10:30 AM",
    "answer_start": 66
  },
  {
    "id": "alex/alex-heart_event_four_hearts.txt",
    "question": "How long does it take Alex to enter town?",
    "context": "At Four Hearts, if the condition \"Enter town between 9am and 4pm.\" is met, the event is as follows: Alex is next to the dog pen near his home. He's talking to the dog, whose name is revealed as Dusty . He comments that both he and the dog have been through a lot and that he feels misunderstood. You come out from behind the Saloon , and Alex asks if you heard any of that. \"Yes, I heard everything.\" (No effect on friendship .) \"Not really... why?\" (No effect on friendship .) Either way, he says the reason that he lives with his grandparents is because of his dad. His dad was an alcoholic and would verbally abuse Alex, calling him \"worthless\". One day, his dad left, and shortly after that, his mother got sick and passed away. Alex goes on to say that he shouldn't dwell on it and doesn't need sympathy. Trying to lighten the mood, Alex offers you the opportunity to see what Dusty will do for a barbecued steak.",
    "answer_text": "between 9am and 4pm",
    "answer_start": 45
  },
  {
    "id": "harvey/harvey-schedule_summer___rain.txt",
    "question": "How many hours does harvey work at the clinic's front desk?",
    "context": "On Summer → Rain, At 8:00 AM, harvey in his room At 8:40 AM, harvey works at the clinic's front desk At 12:00 PM, harvey goes upstairs to his room, sits in front of radio At 4:00 PM, harvey moves to bookshelf to read At 5:30 PM, harvey heads to the stardrop saloon At 10:00 PM, harvey returns home and goes to bed.",
    "answer_text": "8:40 AM",
    "answer_start": 52
  },
  {
    "id": "elliott/elliott-schedule_spring___friday_and_sunday__no_player_has_6_hearts_with_leah_.txt",
    "question": "How many hours does elliott spend at home?",
    "context": "On Spring → Friday and Sunday (No player has 6 hearts with Leah), At 8:00 AM, elliott at home At 11:00 AM, elliott leaves his cabin to stand on the docks next to willy's house At 5:00 PM, elliott leaves the docks to visit the stardrop saloon At 11:40 PM, elliott leaves the saloon to return home for the night.",
    "answer_text": "8:00 AM",
    "answer_start": 69
  },
  {
    "id": "penny/penny-schedule_fall___saturday.txt",
    "question": "How many hours does it take for Penny to return to her trailer?",
    "context": "On Fall → Saturday, At 9:00 AM, penny in her room At 10:00 AM, penny leaves her trailer to meet up with jas and vincent near the town graveyard At 12:00 PM, penny walks jas and vincent to the playground north of town square and watches them play At 5:00 PM, penny walks jas and vincent back to town and drops them off in front of emily and haley's house At 6:30 PM, penny returns to her trailer for the evening.",
    "answer_text": "evening.",
    "answer_start": 403
  },
  {
    "id": "sebastian/sebastian-schedule_fall___friday.txt",
    "question": "How many hours does sebastian spend in the saloon?",
    "context": "On Fall → Friday, At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaves his room to go play pool with sam at the saloon At 5:20 PM, sebastian in the saloon, playing pool with sam At 9:10 PM, sebastian heads home At 11:10 PM, sebastian arrives home.",
    "answer_text": "9:10 PM",
    "answer_start": 255
  },
  {
    "id": "elliott/elliott-schedule_spring___rain.txt",
    "question": "What is the name of Elliott's house?",
    "context": "On Spring → Rain, At All day, elliott inside his house.",
    "answer_text": "elliott",
    "answer_start": 30
  },
  {
    "id": "maru/maru-schedule_spring___rain.txt",
    "question": "What time does maru go to bed?",
    "context": "On Spring → Rain, At 9:00 AM, maru in her room At 12:50 PM, maru stands in entryway/store (home) At 2:40 PM, maru in the lab At 4:40 PM, maru in her room At 11:00 PM, maru goes to bed.",
    "answer_text": "11:00 PM",
    "answer_start": 157
  },
  {
    "id": "maru/maru-schedule_marriage___spring_16__bus_service_restored_.txt",
    "question": "What time does maru boards the bus back to the valley?",
    "context": "On Marriage → Spring 16 (Bus Service Restored), At 9:20 AM, maru boards the bus to calico desert to attend the desert festival At 9:50 AM, maru watches the races near the finish line At 12:10 AM, maru boards the bus back to the valley.",
    "answer_text": "12:10 AM",
    "answer_start": 186
  },
  {
    "id": "sam/sam-schedule_winter___winter_9_and_23__no_player_has_6_hearts_with_penny_or_sam_.txt",
    "question": "What time does sam wake up and stands in his bedroom?",
    "context": "On Winter → Winter 9 and 23 (No player has 6 hearts with Penny or Sam), At 6:00 AM, sam sleeps in his bed at his home At 9:00 AM, sam wakes up and stands in his bedroom At 11:00 AM, sam walks into town, stands on the bridge near the ice cream stand At 4:00 PM, sam walk to the pink tree in front of 2 willow lane, plays his handheld video game At 7:00 PM, sam returns home from town At 9:30 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "9:00 AM",
    "answer_start": 121
  },
  {
    "id": "sam/sam-schedule_winter___rain__option_1_.txt",
    "question": "What time does sam wake up for the day?",
    "context": "On Winter → Rain (Option 1), At 10:00 AM, sam wakes up for the day, stands in front of the dresser in his room At 11:00 AM, sam plays guitar inside his room At 3:00 PM, sam plays his handheld video game in the kitchen inside his house At 5:00 PM, sam returns to his bedroom. and stands in front of his dresser At 6:30 PM, sam at his desk inside his bedroom At 8:00 PM, sam goes to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 32
  },
  {
    "id": "abigail/abigail-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the player does not have a Rabbit's Foot in inventory?",
    "context": "At Group Ten-Heart Event, if the condition \"If the player is unmarried and has given a bouquet to all available bachelorettes, raisedfriendshipwith each bachelorette to 10 hearts, and seen each bachelorette's 10-heart event, then enteringHaley/Emily's Housewill trigger a cutscene. IfHaleyis the final bachelorette you share a Ten-Heart Event with, the Group Ten-Heart Event will be unavoidable as it is triggered immediately afterwards.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a gossip session about Mayor Lewis and Marnie 's relationship. If the player does not have a Rabbit's Foot in inventory, all bachelorettes will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelorettes will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelorettes will forgive the player, and dialogues return to normal.",
    "answer_text": "all bachelorettes will express anger",
    "answer_start": 670
  },
  {
    "id": "maru/maru-schedule_fall___tuesday_and_thursday.txt",
    "question": "How many hours does maru work at Harvey's clinic?",
    "context": "On Fall → Tuesday and Thursday, At 7:50 AM, maru leaving home to go to work at the clinic At 9:40 AM, maru working at harvey's clinic as a nurse At 4:45 PM, maru heads home At 6:40 PM, maru at home, in the kitchen At 10:00 PM, maru goes to her room At 12:00 AM, maru goes to bed.",
    "answer_text": "4:45 PM",
    "answer_start": 148
  },
  {
    "id": "haley/haley-schedule_summer___wednesday__no_player_has_6_hearts_with_haley_or_alex_.txt",
    "question": "How many hours does it take for Haley to go to bed?",
    "context": "On Summer → Wednesday (No player has 6 hearts with Haley or Alex), At 9:00 AM, haley in her room At 12:10 PM, haley in the living room At 4:30 PM, haley moves to the kitchen At 8:00 PM, haley returns to her room At 10:30 PM, haley goes to bed.",
    "answer_text": "10:30 PM",
    "answer_start": 215
  },
  {
    "id": "shane/shane-schedule_spring___monday_-_friday__community_center_not_restored_.txt",
    "question": "What time does shane leave jojamart?",
    "context": "On Spring → Monday - Friday (Community Center Not Restored), At 7:10 AM, shane leaves marnie's ranch and heads to jojamart At 5:00 PM, shane leaves jojamart and heads for the stardrop saloon At 11:10 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "5:00 PM",
    "answer_start": 126
  },
  {
    "id": "haley/haley-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the condition \"Since her ten-heart event also triggers at her home?\"",
    "context": "At Group Ten-Heart Event, if the condition \"Since her ten-heart event also triggers at her home, the two events will happen together.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a gossip session about Mayor Lewis and Marnie 's relationship. If the player does not have a Rabbit's Foot in inventory, all bachelorettes will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelorettes will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelorettes will forgive the player, and dialogues return to normal.",
    "answer_text": "the two events will happen together",
    "answer_start": 97
  },
  {
    "id": "abigail/abigail-schedule_spring___wednesday.txt",
    "question": "What time does abigail arrive at home?",
    "context": "On Spring → Wednesday, At 10:00 AM, abigail leaves home to go to museum At 12:00 PM, abigail inside museum library looking at books At 6:00 PM, abigail walks to the graveyard At 7:00 PM, abigail standing in front of mona's grave At 10:00 PM, abigail heads home At 10:40 PM, abigail arrives at home.",
    "answer_text": "10:40 PM",
    "answer_start": 264
  },
  {
    "id": "maru/maru-schedule_winter___tuesday_and_thursday.txt",
    "question": "How many hours does maru work at Harvey's clinic?",
    "context": "On Winter → Tuesday and Thursday, At 7:50 AM, maru leaving home to go to work at the clinic At 9:40 AM, maru working at harvey's clinic as a nurse At 4:45 PM, maru heads home At 6:40 PM, maru at home, in the kitchen At 10:00 PM, maru in bedroom.",
    "answer_text": "4:45 PM",
    "answer_start": 150
  },
  {
    "id": "haley/haley-schedule_summer___regular_schedule.txt",
    "question": "What time does Haley go to the beach?",
    "context": "On Summer → Regular Schedule, At 9:00 AM, haley in her room At 10:30 AM, haley leaving house to go to beach At 11:50 AM, haley at the beach, northwest corner At 1:30 PM, haley goes to alex's ice cream stand At 2:30 PM, haley at alex's ice cream stand, next to museum/library At 5:00 PM, haley heads home At 6:20 PM, haley at home, cooking dinner At 8:20 PM, haley in her room At 11:00 PM, haley goes to bed.",
    "answer_text": "11:50 AM",
    "answer_start": 111
  },
  {
    "id": "sam/sam-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the player does not have a Rabbit's Foot in inventory?",
    "context": "At Group Ten-Heart Event, if the condition \"If the player is unmarried and has given a bouquet to all available bachelors, raisedfriendshipwith each bachelor to 10 hearts, and seen each bachelor's 10-heart event, then enteringThe Stardrop Saloonwill trigger a cutscene. IfAlexis the final bachelor you share a Ten-Heart Event with, the Group Ten-Heart Event will be unavoidable as it is triggered immediately afterwards.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a friendly game of pool. If the player does not have a Rabbit's Foot in inventory, all bachelors will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelors will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelors will forgive the player, and dialogues return to normal.",
    "answer_text": "all bachelors will express anger about the player dating them all at one time",
    "answer_start": 615
  },
  {
    "id": "harvey/harvey-schedule_winter___winter_15.txt",
    "question": "When does harvey work at the clinic's front desk?",
    "context": "On Winter → Winter 15, At 8:00 AM, harvey stands in front of microwave in his room At 8:40 AM, harvey works at the clinic's front desk At 12:00 PM, harvey goes upstairs to his room, sits in front of radio At 4:00 PM, harvey moves to bookshelf in his room At 5:00 PM, harvey walks to beach to attend night market At 12:00 AM, harvey returns home and goes to bed.",
    "answer_text": "12:00 PM",
    "answer_start": 138
  },
  {
    "id": "penny/penny-schedule_spring___desert_festival__as_vendor_.txt",
    "question": "How long does it take Penny to board the bus to calico desert?",
    "context": "On Spring → Desert Festival (As Vendor), At 11:10 AM, penny boards the bus to calico desert At 11:30 AM, penny arrives at her booth At 12:00 AM, penny leaves booth and takes bus back to the valley.",
    "answer_text": "11:10 AM",
    "answer_start": 44
  },
  {
    "id": "shane/shane-schedule_fall___saturday.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Fall → Saturday, At 9:00 AM, shane leaves his room and stands in kitchen at marnie's ranch At 12:00 PM, shane leaves marnie's ranch and heads to pierre's general store At 5:00 PM, shane leaves pierre's general store and heads to the stardrop saloon At 11:00 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "12:00 PM",
    "answer_start": 97
  },
  {
    "id": "maru/maru-heart_event_four_hearts.txt",
    "question": "What is the condition \"Enter the clinicwhen Maru is there.\"?",
    "context": "At Four Hearts, if the condition \"Enter theclinicwhen Maru is there.\" is met, the event is as follows: Maru is startled by your entry and drops a glass beaker she's holding. Worried about Harvey's response, she asks what she should do. \"Just scoop it off the floor. He won't know the difference.\" (-50 friendship .) She says that of course Harvey will be able to tell the difference. When Harvey comes to investigate the noise, Maru tells him it was an accident and apologises. \"Tell Harvey it was my fault.\" (-20 friendship .) When Harvey comes to investigate the noise, she tells Harvey that it was your fault. \"Tell Harvey it was an accident.\" (+50 friendship .) When Harvey comes in to investigate the noise, she tells him it was an accident and apologises. If Maru blames you, Harvey is disappointed that she didn't take responsibility for her own actions and says the mistake will put them back in the red for a month. Maru is flustered and upset. If Maru says it was an accident and apologizes, Harvey thanks her for telling the truth and tells her not to worry about it. Maru thanks him for his patience, and Harvey says she's been a big help and he doesn't know what he'd do without her. He turns to you and asks if you're okay, since you're looking a bit pale; you turn away and emote a sweat drop.",
    "answer_text": "drops a glass beaker",
    "answer_start": 138
  },
  {
    "id": "harvey/harvey-schedule_summer___green_rain__year_1_.txt",
    "question": "What is the name of the saloon where harvey works?",
    "context": "On Summer → Green Rain (Year 1), At All day, harvey at the stardrop saloon.",
    "answer_text": "stardrop",
    "answer_start": 59
  },
  {
    "id": "alex/alex-schedule_spring___regular_schedule.txt",
    "question": "How many hours does it take alex to go to bed?",
    "context": "On Spring → Regular Schedule, At 8:00 AM, alex leaves his room to go outside and stand beneath nearby tree At 1:00 PM, alex leaves the tree to go back to his room to lift weights At 4:00 PM, alex leaves his room to go stand outside by the dog pen At 6:30 PM, alex goes back into his house and stands in the entryway At 8:00 PM, alex goes to his room and stands by his dresser At 10:00 PM, alex goes to bed.",
    "answer_text": "10:00 PM",
    "answer_start": 379
  },
  {
    "id": "penny/penny-schedule_summer___summer_9_and_23__no_player_has_6_hearts_with_penny_or_sam_.txt",
    "question": "How many hours does it take Penny to go to bed?",
    "context": "On Summer → Summer 9 and 23 (No player has 6 hearts with Penny or Sam), At 6:00 AM, penny sleeps in her bed in the trailer At 9:00 AM, penny wakes up and stands in her bedroom At 11:00 AM, penny walks to town and sits on the bridge near the ice cream stand At 4:00 PM, penny returns from town to the trailer and does some dishes At 6:40 PM, penny goes to bed in her room in the trailer for the evening.",
    "answer_text": "6:40 PM",
    "answer_start": 332
  },
  {
    "id": "alex/alex-schedule_summer___regular_schedule.txt",
    "question": "How many hours does it take alex to go to the beach?",
    "context": "On Summer → Regular Schedule, At 7:50 AM, alex leaves home to go to beach At 12:00 PM, alex leaves beach to go work at ice cream stand At 5:00 PM, alex heads home to lift weights in his room At 7:00 PM, alex stands in front entryway of house At 8:00 PM, alex goes to his room to stand by his dresser At 10:00 PM, alex goes to bed.",
    "answer_text": "7:50 AM",
    "answer_start": 33
  },
  {
    "id": "haley/haley-dislike_gifts.txt",
    "question": "What is the name of the mushroom that Haley dislikes?",
    "context": "haley dislikes the following gifts: Chanterelle (A tasty mushroom with a fruity smell and slightly peppery flavor.), Common Mushroom (Slightly nutty, with good texture.), Dandelion (Not the prettiest flower, but the leaves make a good salad.), Ginger (This sharp, spicy root is said to increase vitality.), Hazelnut (That's one big hazelnut!), Holly (The leaves and bright red berries make a popular winter decoration.), Leek (A tasty relative of the onion.), Magma Cap (A very rare mushroom that lives next to pools of lava.), Morel (Sought after for its unique nutty flavor.), Mystic Syrup (A very rare syrup that is said to have magic properties.), Purple Mushroom (A rare mushroom found deep in caves.), Quartz (A clear crystal commonly found in caves and mines.), Snow Yam (This little yam was hiding beneath the snow.), Winter Root (A starchy tuber.).",
    "answer_text": "Chanterelle",
    "answer_start": 36
  },
  {
    "id": "harvey/harvey-schedule_winter___regular_schedule.txt",
    "question": "What time does harvey go upstairs to his room?",
    "context": "On Winter → Regular Schedule, At 8:00 AM, harvey in his room At 8:40 AM, harvey works at the clinic's front desk At 12:00 PM, harvey goes upstairs to his room, sits in front of radio At 4:00 PM, harvey moves to bookshelf to read At 5:50 PM, harvey heads to the stardrop saloon At 10:00 PM, harvey returns home and goes to bed.",
    "answer_text": "12:00 PM",
    "answer_start": 116
  },
  {
    "id": "emily/emily-neutral_gifts.txt",
    "question": "Who neutralizes the following gifts: Chanterelle, Common Mushroom, Dandelion, Ginger, Hazelnut, Leek, Magma Cap, Morel, Winter Root?",
    "context": "emily neutrals the following gifts: Chanterelle (A tasty mushroom with a fruity smell and slightly peppery flavor.), Common Mushroom (Slightly nutty, with good texture.), Dandelion (Not the prettiest flower, but the leaves make a good salad.), Ginger (This sharp, spicy root is said to increase vitality.), Hazelnut (That's one big hazelnut!), Leek (A tasty relative of the onion.), Magma Cap (A very rare mushroom that lives next to pools of lava.), Morel (Sought after for its unique nutty flavor.), Purple Mushroom (A rare mushroom found deep in caves.), Snow Yam (This little yam was hiding beneath the snow.), Wild Horseradish (A spicy root found in the spring.), Winter Root (A starchy tuber.).",
    "answer_text": "emily",
    "answer_start": 0
  },
  {
    "id": "haley/haley-schedule_fall___monday.txt",
    "question": "What time does Haley go to bed?",
    "context": "On Fall → Monday, At 9:00 AM, haley in her room At 10:00 AM, haley leaves her room to go to kitchen At 11:00 AM, haley leaving home to go to the river south of marnie's ranch At 12:20 PM, haley by the river south of marnie's ranch, taking pictures At 4:30 PM, haley heads home At 5:50 PM, haley at home, cooking dinner At 8:20 PM, haley in her room At 11:00 PM, haley goes to bed.",
    "answer_text": "11:00 PM",
    "answer_start": 352
  },
  {
    "id": "abigail/abigail-schedule_spring___regular_schedule.txt",
    "question": "What time does abigail go to the kitchen?",
    "context": "On Spring → Regular Schedule, At 9:00 AM, abigail leaves her room to go to the kitchen At 10:30 AM, abigail leaves the kitchen to stand in pierre's store At 1:00 PM, abigail leaves the house to go to stand on bridge near jojamart At 1:30 PM, abigail standing on the bridge near jojamart At 4:30 PM, abigail heads home At 5:20 PM, abigail in her room, playing video games At 7:30 PM, abigail goes to bed.",
    "answer_text": "9:00 AM",
    "answer_start": 33
  },
  {
    "id": "penny/penny-schedule_spring___saturday.txt",
    "question": "How many hours does it take Penny to return to her trailer?",
    "context": "On Spring → Saturday, At 9:00 AM, penny in her room At 10:00 AM, penny leaves her trailer to meet up with jas and vincent near the town graveyard At 12:00 PM, penny walks jas and vincent to the playground north of town square and watches them play At 5:00 PM, penny walks jas and vincent back to town and drops them off in front of emily and haley's house At 6:30 PM, penny returns to her trailer for the evening.",
    "answer_text": "evening.",
    "answer_start": 405
  },
  {
    "id": "sam/sam-like_gifts.txt",
    "question": "What is the name of the company that makes Joja Cola?",
    "context": "sam likes the following gifts: Joja Cola (The flagship product of Joja corporation.).",
    "answer_text": "Joja corporation",
    "answer_start": 66
  },
  {
    "id": "elliott/elliott-schedule_winter___thursday.txt",
    "question": "What time does elliott leave pierre's general store?",
    "context": "On Winter → Thursday, At 8:00 AM, elliott at home At 11:30 AM, elliott leaves home and heads to pierre's general store At 5:30 PM, elliott leaves pierre's and heads home for the night.",
    "answer_text": "5:30 PM",
    "answer_start": 122
  },
  {
    "id": "abigail/abigail-schedule_spring___spring_6_and_16.txt",
    "question": "What time does abigail arrive at home?",
    "context": "On Spring → Spring 6 and 16, At 9:00 AM, abigail leaving her room to go to the kitchen At 10:30 AM, abigail leaves the kitchen to stand in pierre's general store At 3:00 PM, abigail goes to the mountain, standing on the southwest corner of the lake, playing the flute At 8:00 PM, abigail heads home to go to bed At 9:40 PM, abigail arrives at home.",
    "answer_text": "9:40 PM",
    "answer_start": 315
  },
  {
    "id": "elliott/elliott-schedule_summer___green_rain__year_1_.txt",
    "question": "What is the name of the character who plays elliott in the saloon?",
    "context": "On Summer → Green Rain (Year 1), At All day, elliott in the saloon.",
    "answer_text": "All day",
    "answer_start": 36
  },
  {
    "id": "haley/haley-schedule_spring___rain.txt",
    "question": "What time does Haley wake up and stands by her dresser in her bedroom?",
    "context": "On Spring → Rain, At 10:30 AM, haley wakes up and stands by her dresser in her bedroom At 11:30 AM, haley moves to the vanity mirror in her bedroom At 12:00 PM, haley leaves her room to go to the kitchen At 4:00 PM, haley returns to her room At 7:00 PM, haley leaves her room and stands in the living room At 10:00 PM, haley goes to bed.",
    "answer_text": "10:30 AM",
    "answer_start": 21
  },
  {
    "id": "haley/haley-schedule_spring___desert_festival__as_vendor_.txt",
    "question": "What time does Haley board the bus to calico desert?",
    "context": "On Spring → Desert Festival (As Vendor), At 11:10 AM, haley boards the bus to calico desert At 11:30 AM, haley arrives at her booth At 12:00 AM, haley leaves booth and boards bus back to the valley.",
    "answer_text": "11:10 AM",
    "answer_start": 44
  },
  {
    "id": "penny/penny-schedule_fall___tuesday__wednesday_and_friday.txt",
    "question": "How many hours does it take to walk to marnie's ranch?",
    "context": "On Fall → Tuesday, Wednesday and Friday, At 9:00 AM, penny leaves her trailer and goes to the museum/library to tutor jas and vincent At 2:00 PM, penny leaves the library and stands near the ice cream stand watching over jas and vincent At 4:20 PM, penny walks vincent to 1 willow lane and says goodbye At 5:50 PM, penny walks jas to marnie's ranch and says goodbye At 6:30 PM, penny returns to her trailer for the evening.",
    "answer_text": "5:50 PM",
    "answer_start": 306
  },
  {
    "id": "abigail/abigail-schedule_spring___sunday.txt",
    "question": "How many hours does it take for abigail to arrive home?",
    "context": "On Spring → Sunday, At 9:00 AM, abigail in her room At 10:30 AM, abigail leaves her room to go into caroline and pierre's room At 1:00 PM, abigail leaving home to go to the wizard's tower At 4:00 PM, abigail near wizard's tower in cindersap forest At 8:00 PM, abigail heads home At 10:30 PM, abigail arrives home.",
    "answer_text": "10:30 PM",
    "answer_start": 282
  },
  {
    "id": "penny/penny-schedule_winter___winter_9_and_23__no_player_has_6_hearts_with_penny_or_sam_.txt",
    "question": "How many hours does it take Penny to go to bed?",
    "context": "On Winter → Winter 9 and 23 (No player has 6 hearts with Penny or Sam), At 6:00 AM, penny sleeps in her bed in the trailer At 9:00 AM, penny wakes up and stands in her bedroom At 11:00 AM, penny walks to town and sits on the bridge near the ice cream stand At 4:00 PM, penny returns from town to the trailer and does some dishes At 6:40 PM, penny goes to bed in her room in the trailer for the evening.",
    "answer_text": "6:40 PM",
    "answer_start": 332
  },
  {
    "id": "leah/leah-dislike_gifts.txt",
    "question": "Which of the following is not a gift leah dislikes?",
    "context": "leah dislikes the following gifts: Carp Surprise (It's bland and oily.), Cookie (Very chewy.), Fried Egg (Sunny-side up.), Ice Cream (It's hard to find someone who doesn't like this.), Pink Cake (There's little heart candies on top.), Rice Pudding (It's creamy, sweet, and fun to eat.), Seaweed (It can be used in cooking.), Survival Burger (A convenient snack for the explorer.), Tortilla (Can be used as a vessel for food or eaten by itself.).",
    "answer_text": "Cookie (Very chewy.)",
    "answer_start": 73
  },
  {
    "id": "leah/leah-heart_event_eight_hearts.txt",
    "question": "What is the name of Leah's favorite sculpting material?",
    "context": "At Eight Hearts, if the condition \"If you suggested an art show in her two-heart event, Leah is at your farmhouse door between 6 AM and 8 AM (except in winter) to invite you to her art show. EnterPelican Townbetween 3 PM and 5 PM (not necessarily the same day).\" is met, the event is as follows: You arrive to find many others already present. Leah is happy to see you and nervously starts the art show. She thanks everyone for coming. Leah says she came to Pelican Town to draw inspiration from the beautiful surroundings and confesses that it really feels like home now. She presents her sculptures. \"I haven't named this one, yet. She started out as an exercise in human anatomy, but I ended up seeing her through to completion. Her expression is intentionally unclear... is she embarrassed, amused, pained? I'll leave that for you to decide.\" (pause) \"This one's called 'Post-Dimensional Nullspace'. It represents the boundary of human imagination. The shape and color came to me vividly when I was in a 'trance state'.\" (pause ) \"I've been calling this one 'Egg Heads'. I wanted to create an animatronic humanoid statue to toy with the viewer's ability to properly attribute personhood to a physical entity.\" (pause) \"And the last one is called 'Wood Sculpture 3'. It's a celebration of my favorite sculpting material... wood.\" Finally, she thanks her special friend (you), who gave her the idea for the art show and the courage to go through with it. The villagers all praise Leah and her artwork: Lewis: \"I'm proud of you, Leah! Events like this really breathe life into our little town!\" Gus: \"Great stuff!\" Demetrius: \"I love your art, Leah! 'Post-Dimensional Nullspace' is my favorite.\" Robin: \"Great use of wood!\" Penny: \"Thanks for doing this!\" Leah thanks everyone, Lewis starts the bidding on the art pieces, and as the scene fades, her ex, Kel, can be seen to the side. Afterward, Leah says she's exhausted but that the show was a success.",
    "answer_text": "wood.",
    "answer_start": 1326
  },
  {
    "id": "shane/shane-schedule_fall___sunday.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Fall → Sunday, At 12:30 PM, shane in kitchen at marnie's ranch At 6:00 PM, shane leaves marnie's ranch and heads to the stardrop saloon At 12:00 AM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "12:30 PM",
    "answer_start": 21
  },
  {
    "id": "shane/shane-schedule_spring___spring_17__bus_service_restored_.txt",
    "question": "What time does shane boards the bus to calico desert?",
    "context": "On Spring → Spring 17 (Bus Service Restored), At 11:00 AM, shane boards the bus to calico desert to attend the desert festival At 11:10 AM, shane stands by the chef stand At 12:30 AM, shane boards the bus back to the valley.",
    "answer_text": "11:00 AM",
    "answer_start": 49
  },
  {
    "id": "sam/sam-heart_event_four_hearts.txt",
    "question": "How many friendships are there between Sam and Jodi?",
    "context": "At Four Hearts, if the condition \"Enter Sam's house when he's there.\" is met, the event is as follows: Sam is in the kitchen. He says hello. As he's getting you a snack, he drops an egg on the kitchen floor. His mom hears the commotion, walks into the kitchen, and becomes upset about the mess. Sam asks you to tell her what happened. \"Sam dropped the snack as he was handing it to me.\" (-10 friendship .) \"Sam handed me the snack and then I dropped it.\" (+50 friendship .) Sam agrees with you. \"Sam dropped it on purpose. He thought it would be funny.\" (-50 friendship .) Jodi thanks you for being honest, and Sam insists he'll clean up the mess. Talking to Sam after this event causes him to say \"Sorry about what happened earlier.\"",
    "answer_text": "50 friendship",
    "answer_start": 457
  },
  {
    "id": "harvey/harvey-schedule_winter___rain.txt",
    "question": "How many hours does harvey work at the clinic's front desk?",
    "context": "On Winter → Rain, At 8:00 AM, harvey in his room At 8:40 AM, harvey works at the clinic's front desk At 12:00 PM, harvey goes upstairs to his room, sits in front of radio At 4:00 PM, harvey moves to bookshelf to read At 5:30 PM, harvey heads to the stardrop saloon At 10:00 PM, harvey returns home and goes to bed.",
    "answer_text": "8:40 AM",
    "answer_start": 52
  },
  {
    "id": "sebastian/sebastian-schedule_fall___rain__option_1_.txt",
    "question": "What time does sebastian get out of bed and leaves the house?",
    "context": "On Fall → Rain (Option 1), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and leaves house to go to the beach At 1:30 PM, sebastian standing at the end of long pier to the left of the fish shop At 5:00 PM, sebastian leaves the pier to go home At 7:40 PM, sebastian arrives home and goes to bed.",
    "answer_text": "10:30 AM",
    "answer_start": 63
  },
  {
    "id": "haley/haley-heart_event_fourteen_hearts.txt",
    "question": "Who does Haley ask to bring a chocolate cake?",
    "context": "At Fourteen Hearts, if the condition \"Part 1:Entertownbetween 8am and 3pm on a day that's not raining.Part 2:At least one day later, enter the Farm House between 6:20am and 5pm.Part 3:At least one day later, enter Pelican Town with aChocolate Cakein inventory between 6am and 3pm on a day that's not raining.\" is met, the event is as follows: Part 1: On her way to her house , Haley overhears a conversation between Vincent, Jas, and Penny. Jas complains about her math book cover falling off, and Penny notices that all her books are falling apart. Penny says \"new books are expensive, so we'll just have to make do with what we have...\" Vincent asks \"Does this mean I don't have to do my homework?\" Talking to Haley after the scene will result in her saying: \"I've been thinking about cake a lot lately...\". Part 2: Haley says she wants to get everyone together for a charity cake-walk in town on the next sunny day, and explains that it's kind of like musical chairs but everyone gets cake. She asks the player to bring a Chocolate Cake . Yes (No effect on friendship .) Haley replies \"Great! I'll meet you in the town square tomorrow, weather permitting.\" Yes (begrudgingly) (No effect on friendship .) Haley replies \"What's up with the snarky attitude? Fine. You're going to show up tomorrow with a chocolate cake, or else you're in the dog house . You like that better?\" Haley says she's bringing Pink Cake , and the \"Haley's Cake-Walk\" quest is added to the Journal. Part 3: Most of the villagers are gathered in the town square, with Jas, Vincent, Pam, Emily, Caroline, Marnie, Jodi, and Clint participating in the cakewalk. After the player delivers the chocolate cake to Haley, she stops the cakewalk and begins to distribute the prizes, with Pam receiving the player's cake. After all the prizes have been given, Haley reveals that she overheard Penny's conversation, and held the cakewalk to raise money for new books. Penny is grateful to both Haley and the player for their kindness. Jas is excited and Vincent is crestfallen at the prospect of new books.  Robin then tries to convince Lewis to lower their business tax since education is being funded without tax money, and Pierre joins her against a shocked Lewis.",
    "answer_text": "the player",
    "answer_start": 1003
  },
  {
    "id": "sebastian/sebastian-schedule_marriage___spring_15__bus_service_restored_.txt",
    "question": "How many hours does it take to go to the desert festival?",
    "context": "On Marriage → Spring 15 (Bus Service Restored), At 8:30 AM, sebastian leaves home to go to the desert festival and stand north-east of the cactus stand At 1:20 AM, sebastian leaves to go home.",
    "answer_text": "8:30 AM",
    "answer_start": 51
  },
  {
    "id": "leah/leah-schedule_spring___monday.txt",
    "question": "What time does leah go to shop at pierre's general store?",
    "context": "On Spring → Monday, At 9:00 AM, leah sculpts in her cottage At 11:00 AM, leah goes to shop at pierre's general store At 5:00 PM, leah leaves the store to return home and stand in front of her bookcase At 10:00 PM, leah stands at the table in her house At 12:00 AM, leah goes to bed for the night.",
    "answer_text": "11:00 AM",
    "answer_start": 63
  },
  {
    "id": "harvey/harvey-schedule_fall___rain.txt",
    "question": "How many hours does harvey work at the clinic's front desk?",
    "context": "On Fall → Rain, At 8:00 AM, harvey in his room At 8:40 AM, harvey works at the clinic's front desk At 12:00 PM, harvey goes upstairs to his room, sits in front of radio At 4:00 PM, harvey moves to bookshelf to read At 5:30 PM, harvey heads to the stardrop saloon At 10:00 PM, harvey returns home and goes to bed.",
    "answer_text": "8:40 AM",
    "answer_start": 50
  },
  {
    "id": "abigail/abigail-schedule_fall___monday.txt",
    "question": "How many hours does abigail spend at the beach?",
    "context": "On Fall → Monday, At 9:00 AM, abigail in her room At 11:00 AM, abigail leaving home to go to the beach At 1:00 PM, abigail standing at the end of long pier to the left of the fish shop At 6:00 PM, abigail heads home At 7:30 PM, abigail arrives home and goes to bed.",
    "answer_text": "Monday",
    "answer_start": 10
  },
  {
    "id": "elliott/elliott-schedule_winter___winter_12_and_13.txt",
    "question": "When does elliott leave his cabin to stand on the docks?",
    "context": "On Winter → Winter 12 and 13, At 8:00 AM, elliott leaves his cabin to stand on the docks next to willy's house At 5:00 PM, elliott leaves the docks to visit the stardrop saloon At 12:00 AM, elliott leaves the saloon to return home for the night.",
    "answer_text": "8:00 AM",
    "answer_start": 33
  },
  {
    "id": "abigail/abigail-schedule_summer___wednesday.txt",
    "question": "What time does abigail arrive at home?",
    "context": "On Summer → Wednesday, At 10:00 AM, abigail leaves home to go to the library At 12:00 PM, abigail inside library, looking at books At 6:00 PM, abigail walks to the graveyard At 7:00 PM, abigail standing in front of mona's grave At 10:00 PM, abigail heads home At 10:40 PM, abigail arrives at home.",
    "answer_text": "10:40 PM",
    "answer_start": 263
  },
  {
    "id": "harvey/harvey-neutral_gifts.txt",
    "question": "Who neutralizes the following gifts: Large Milk or Milk?",
    "context": "harvey neutrals the following gifts: Large Milk (A large jug of cow's milk.), Milk (A jug of cow's milk.).",
    "answer_text": "harvey",
    "answer_start": 0
  },
  {
    "id": "sam/sam-schedule_summer___monday_and_wednesday.txt",
    "question": "How many hours does sam work at jojamart?",
    "context": "On Summer → Monday and Wednesday, At 10:00 AM, sam wakes up and stands in the middle of his bedroom At 11:00 AM, sam leaves his bedroom and walks to jojamart (or museum if community center is restored) At 12:50 PM, sam arrives at jojamart (or museum if community center is restored) and starts work At 4:00 PM, sam finshes work at jojamart (or museum if community center is restored) and walks home At 6:00 PM, sam arrives in his bedroom and stands in front of his bookshelf At 9:30 PM, sam goes to bed.",
    "answer_text": "12:50 PM",
    "answer_start": 205
  },
  {
    "id": "maru/maru-schedule_summer___tuesday_and_thursday.txt",
    "question": "How many hours does maru work at Harvey's clinic?",
    "context": "On Summer → Tuesday and Thursday, At 7:50 AM, maru leaving home to go to work at the clinic At 9:40 AM, maru working at harvey's clinic as a nurse At 4:45 PM, maru heads home At 6:40 PM, maru at home, in the kitchen At 10:00 PM, maru goes to her room At 12:00 AM, maru goes to bed.",
    "answer_text": "4:45 PM",
    "answer_start": 150
  },
  {
    "id": "elliott/elliott-schedule_summer___regular_schedule.txt",
    "question": "How many hours does elliott spend at home?",
    "context": "On Summer → Regular Schedule, At 8:00 AM, elliott at home At 11:30 AM, elliott leaves home, heads to the forest south of leah's cottage At 6:00 PM, elliott leaves the forest to return home for the night At 7:40 PM, elliott arrives home and goes to bed.",
    "answer_text": "8:00 AM",
    "answer_start": 33
  },
  {
    "id": "shane/shane-schedule_spring___sunday.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Spring → Sunday, At 12:30 PM, shane in kitchen at marnie's ranch At 6:00 PM, shane leaves marnie's ranch and heads to the stardrop saloon At 12:00 AM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "12:30 PM",
    "answer_start": 23
  },
  {
    "id": "shane/shane-schedule_fall___monday_-_friday__community_center_not_restored_.txt",
    "question": "What time does shane leave jojamart?",
    "context": "On Fall → Monday - Friday (Community Center Not Restored), At 7:10 AM, shane leaves marnie's ranch and heads to jojamart At 5:00 PM, shane leaves jojamart and heads for the stardrop saloon At 11:10 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "5:00 PM",
    "answer_start": 124
  },
  {
    "id": "sebastian/sebastian-schedule_spring___desert_festival__as_vendor_.txt",
    "question": "What time does sebastian board the bus to calico desert?",
    "context": "On Spring → Desert Festival (As Vendor), At 11:10 AM, sebastian boards the bus to calico desert At 11:30 AM, sebastian arrives at his booth At 12:00 AM, sebastian leaves booth and takes the bus back to the valley.",
    "answer_text": "11:10 AM",
    "answer_start": 44
  },
  {
    "id": "harvey/harvey-heart_event_fourteen_hearts.txt",
    "question": "How many hearts does Fourteen Hearts have?",
    "context": "At Fourteen Hearts, if the condition \"Enter an upgraded farm house (needs to be upgraded at least twice) between 8pm and midnight.\" is met, the event is as follows: In the cutscene, Harvey is seen cooking and then setting the table for dinner. As you enter, Harvey says you're just in time and tells you he's cooked angel hair pasta with clams. He asks you how the dish tastes and he asks what you did that day. At the end, Harvey offers to wash the dishes and says he is happy to do so.",
    "answer_text": "at least twice",
    "answer_start": 89
  },
  {
    "id": "penny/penny-schedule_summer___tuesday__wednesday_and_friday.txt",
    "question": "How many hours does it take to arrive at the trailer for the evening?",
    "context": "On Summer → Tuesday, Wednesday and Friday, At 9:00 AM, penny leaves the trailer and walks to the museum At 10:00 AM, penny in the museum At 2:00 PM, penny pelican town, outside of the museum near bridge At 4:00 PM, penny outside 2 willow lane, walking vincent and jas home At 6:30 PM, penny leaves marnie's ranch and returns to home for the evening At 8:00 PM, penny arrives at the trailer for the evening.",
    "answer_text": "8:00 PM",
    "answer_start": 352
  },
  {
    "id": "emily/emily-heart_event_six_hearts.txt",
    "question": "How many friendships does Emily have if she enters Emily's house?",
    "context": "At Six Hearts, if the condition \"EnterEmily's housewhen she's there.\" is met, the event is as follows: You'll enter Emily's room.  She tells you that she is excited to show you her secret hobby that she has been working on for a long time.  She'll then proceed to turn on her stereo and begin dancing for you.  After the lights and music end it will ask you what you thought of the performance. You have three choices: \"That was amazing!\" (+25 friendship .) \"That was embarrassing...\" (-50 friendship .) (Say nothing and do a slow clap) (+25 friendship .) This event was formerly Emily's four heart event, it was changed in version 1.1 . In that update it got a new unique song and dialogue, as well as animation and visual improvements.",
    "answer_text": "50 friendship .",
    "answer_start": 487
  },
  {
    "id": "emily/emily-hate_gifts.txt",
    "question": "What does Holly make a popular winter decoration?",
    "context": "emily hates the following gifts: Fish Taco (It smells delicious.), Holly (The leaves and bright red berries make a popular winter decoration.), Maki Roll (Fish and rice wrapped in seaweed.), Salmon Dinner (The lemon spritz makes it special.), Sashimi (Raw fish sliced into thin pieces.).",
    "answer_text": "leaves and bright red berries",
    "answer_start": 78
  },
  {
    "id": "penny/penny-schedule_spring___spring_16__bus_service_restored_.txt",
    "question": "How many hours does it take to board the bus back to the valley?",
    "context": "On Spring → Spring 16 (Bus Service Restored), At 9:30 AM, penny boards the bus to calico desert to attend the desert festival At 10:00 AM, penny stands near the calico warp statue At 1:00 AM, penny boards the bus back to the valley.",
    "answer_text": "Spring 16",
    "answer_start": 12
  },
  {
    "id": "elliott/elliott-like_gifts.txt",
    "question": "What is elliott's favorite gift?",
    "context": "elliott likes the following gifts: Octopus (A mysterious and intelligent creature.), Squid (A deep sea creature that can grow to enormous size.).",
    "answer_text": "Octopus",
    "answer_start": 35
  },
  {
    "id": "harvey/harvey-schedule_marriage___tuesday_and_thursday.txt",
    "question": "How long does it take Harvey to return home to the farm?",
    "context": "On Marriage → Tuesday and Thursday, At 6:30 AM, harvey leaves the farmhouse and heads to the clinic At 6:00 PM, harvey leaves the clinic to return home to the farm.",
    "answer_text": "Tuesday and Thursday",
    "answer_start": 14
  },
  {
    "id": "sam/sam-schedule_spring___rain__option_1_.txt",
    "question": "What time does sam wake up for the day?",
    "context": "On Spring → Rain (Option 1), At 10:00 AM, sam wakes up for the day, stands in front of the dresser in his room At 11:00 AM, sam plays guitar inside his room At 3:00 PM, sam plays his handheld video game in the kitchen inside his house At 5:00 PM, sam returns to his bedroom. and stands in front of his dresser At 6:30 PM, sam at his desk inside his bedroom At 8:00 PM, sam goes to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 32
  },
  {
    "id": "sebastian/sebastian-schedule_summer___friday.txt",
    "question": "How many hours does sebastian spend in the saloon?",
    "context": "On Summer → Friday, At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaves his room to go play pool with sam at the saloon At 5:20 PM, sebastian in the saloon, playing pool with sam At 9:10 PM, sebastian heads home At 11:10 PM, sebastian arrives home.",
    "answer_text": "11:10 PM",
    "answer_start": 290
  },
  {
    "id": "sam/sam-schedule_summer___regular_schedule.txt",
    "question": "What time does sam wake up for the day?",
    "context": "On Summer → Regular Schedule, At 10:00 AM, sam wakes up for the day, moves around his room At 11:00 AM, sam plays guitar inside his bedroom At 1:40 PM, sam leaves his bedroom and walks to the beach by the firepit with his brother vincent At 7:00 PM, sam returns home from the beach At 9:00 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 33
  },
  {
    "id": "penny/penny-schedule_summer___green_rain__year_1_.txt",
    "question": "What is the name of the saloon?",
    "context": "On Summer → Green Rain (Year 1), At All day, penny in the stardrop saloon.",
    "answer_text": "penny in the stardrop saloon",
    "answer_start": 45
  },
  {
    "id": "haley/haley-schedule_spring___monday.txt",
    "question": "What time does Haley go to bed?",
    "context": "On Spring → Monday, At 9:00 AM, haley in her room At 10:00 AM, haley leaves her room to go to kitchen At 11:00 AM, haley leaving home to go to the river south of marnie's ranch At 12:20 PM, haley by the river south of marnie's ranch, taking pictures At 4:30 PM, haley heads home At 5:50 PM, haley at home, cooking dinner At 8:20 PM, haley in her room At 11:00 PM, haley goes to bed.",
    "answer_text": "11:00 PM",
    "answer_start": 354
  },
  {
    "id": "leah/leah-schedule_fall___regular_schedule.txt",
    "question": "When does leah go to bed for the night?",
    "context": "On Fall → Regular Schedule, At 9:00 AM, leah sculpts in her cottage At 12:00 PM, leah walks to the east side of the river in town, above the blacksmith At 7:00 PM, leah leaves town to return home and stand in front of her bookcase At 10:00 PM, leah stands at the table in her house At 12:00 AM, leah goes to bed for the night.",
    "answer_text": "12:00 AM",
    "answer_start": 285
  },
  {
    "id": "shane/shane-schedule_winter___monday_-_friday__community_center_not_restored_.txt",
    "question": "What time does shane leave jojamart?",
    "context": "On Winter → Monday - Friday (Community Center Not Restored), At 7:10 AM, shane leaves marnie's ranch and heads to jojamart At 5:00 PM, shane leaves jojamart and heads for the stardrop saloon At 11:10 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "5:00 PM",
    "answer_start": 126
  },
  {
    "id": "abigail/abigail-schedule_spring___desert_festival__as_vendor_.txt",
    "question": "When does abigail board the bus to calico desert?",
    "context": "On Spring → Desert Festival (As Vendor), At 11:10 AM, abigail boards the bus to calico desert At 11:30 AM, abigail arrives at her booth At 12:00 AM, abigail leaves booth and boards bus back to the valley.",
    "answer_text": "11:10 AM",
    "answer_start": 44
  },
  {
    "id": "sebastian/sebastian-schedule_fall___rain__option_2_.txt",
    "question": "How many hours does sebastian spend at the saloon?",
    "context": "On Fall → Rain (Option 2), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaving house to go to the saloon At 5:20 PM, sebastian at the saloon, standing by red sofa in arcade At 9:10 PM, sebastian heads home At 11:10 PM, sebastian arrives home.",
    "answer_text": "5:20 PM",
    "answer_start": 184
  },
  {
    "id": "sam/sam-schedule_summer___summer_9_and_23.txt",
    "question": "How many hours does Sam wake up for the day?",
    "context": "On Summer → Summer 9 and 23, At 10:00 AM, sam wakes up for the day, moves around his room At 10:40 AM, sam plays guitar inside his bedroom At 1:40 PM, sam leaves his bedroom, walks into town, and stands near lewis' house by the river At 6:30 PM, sam returns home from town At 9:00 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "9 and 23",
    "answer_start": 19
  },
  {
    "id": "sebastian/sebastian-schedule_winter___winter_11__no_player_has_6_hearts_with_sebastian_.txt",
    "question": "What time does Sebastian get out of bed and moves to his computer?",
    "context": "On Winter → Winter 11 (No player has 6 hearts with Sebastian), At 9:00 AM, sebastian in his bed At 10:00 AM, sebastian gets out of bed and moves to his computer At 12:00 PM, sebastian in his room, standing by couch At 5:30 PM, sebastian leaving his room to go to the kitchen At 6:30 PM, sebastian on his computer At 9:30 PM, sebastian goes to bed.",
    "answer_text": "12:00 PM",
    "answer_start": 164
  },
  {
    "id": "elliott/elliott-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the player does not have a Rabbit's Foot in inventory?",
    "context": "At Group Ten-Heart Event, if the condition \"If the player is unmarried and has given a bouquet to all available bachelors, raisedfriendshipwith each bachelor to 10 hearts, and seen each bachelor's 10-heart event, then enteringThe Stardrop Saloonwill trigger a cutscene. IfAlexis the final bachelor you share a Ten-Heart Event with, the Group Ten-Heart Event will be unavoidable as it is triggered immediately afterwards.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a friendly game of pool. If the player does not have a Rabbit's Foot in inventory, all bachelors will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelors will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelors will forgive the player, and dialogues return to normal.",
    "answer_text": "all bachelors will express anger about the player dating them all at one time",
    "answer_start": 615
  },
  {
    "id": "harvey/harvey-schedule_summer___regular_schedule.txt",
    "question": "When does harvey go to bed?",
    "context": "On Summer → Regular Schedule, At 7:00 AM, harvey stands in front of refrigerator in his room At 8:30 AM, harvey works at the clinic's front desk At 12:00 PM, harvey walks south of fountain west of the community center At 5:30 PM, harvey returns to clinic, stands at right side of front desk At 6:40 PM, harvey goes up to his room, reads in front of bookshelf At 10:00 PM, harvey goes to bed.",
    "answer_text": "10:00 PM",
    "answer_start": 362
  },
  {
    "id": "sebastian/sebastian-schedule_winter___winter_11_and_25__any_player_has_at_least_6_hearts_with_sebastian_.txt",
    "question": "How many hours does sebastian spend in his bed?",
    "context": "On Winter → Winter 11 and 25 (Any player has at least 6 hearts with Sebastian), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaves his computer and goes to the kitchen At 3:30 PM, sebastian leaves the kitchen to go back to his room At 4:10 PM, sebastian on his computer At 6:30 PM, sebastian leaves home and walks to lake next to his house to smoke At 7:30 PM, sebastian smoking by the lake next to his house At 9:30 PM, sebastian goes back to his house.",
    "answer_text": "9:00 AM",
    "answer_start": 83
  },
  {
    "id": "harvey/harvey-heart_event_four_hearts.txt",
    "question": "How many friendships does Harvey have at Four Hearts?",
    "context": "At Four Hearts, if the condition \"Enter theclinicwhen Harvey is there.\" is met, the event is as follows: Harvey says he was just about to write you a letter about how you're due for your annual check-up. As he's looking you over, he notices your pulse seems high. \"I'm a little nervous...\" (+20 friendship .) Harvey assumes that it's because of the Hospital and tells you to relax because he's here to help. \"I'm out of breath from working on the farm.\" (+20 friendship .) \"Are you really a doctor? My pulse is fine!\" (-50 friendship .) At the end of it, Harvey declares you healthy and says you should take care not to overwork yourself on the farm.",
    "answer_text": "+20 friendship .",
    "answer_start": 291
  },
  {
    "id": "abigail/abigail-schedule_fall___rain__option_1_.txt",
    "question": "What time does abigail go to the kitchen?",
    "context": "On Fall → Rain (Option 1), At 9:00 AM, abigail in her room At 11:00 AM, abigail leaves her room to stand in pierre's general store At 1:00 PM, abigail goes to the kitchen At 3:00 PM, abigail returns to her room At 10:00 PM, abigail goes to bed.",
    "answer_text": "3:00 PM",
    "answer_start": 174
  },
  {
    "id": "shane/shane-heart_event_fourteen_hearts.txt",
    "question": "How many days does it take to enter town at Fourteen Hearts?",
    "context": "At Fourteen Hearts, if the condition \"Enter town on a non-Friday between 8am and 5pm. For parts II and III enter town anytime each of the next two days.\" is met, the event is as follows: On the first day, Marnie, Jas, and yourself are outside of the saloon. Shane comes out of the bar, saying that he hasn't had a session like that in a while. Marnie looks worried, and asks you to talk to him next time he comes out of the saloon. On the second day, Shane comes out and you confront him. Shane gets upset at the suggestion that he's been drinking, and runs home. On the third day, Marnie and you are waiting outside the saloon, and Shane goes in. You try to catch him in the act of drinking, but he is instead standing in front of an arcade machine. Marnie is confused and asks about the cans on the floor, and Shane explains that they're Joja Cola cans. He also explains that playing video games helps him calm the urge to drink. \"I'm sorry, I should've believed you.\" (No effect on friendship .) That's alright, (Player). You're just looking out for me. I get it. Look... I know I haven't been perfect... but, I'm trying my best... and I'm gonna keep trying. So you don't have to worry about me. My life is better now than it's ever been. I'm not in such a dark place anymore... \"I was worried!\" (No effect on friendship .) Afterwards, Shane will say that you and Marnie must have been confused to see him in front of the arcade machine.",
    "answer_text": "two days",
    "answer_start": 143
  },
  {
    "id": "leah/leah-schedule_spring___spring_15__bus_service_restored_.txt",
    "question": "What time does Leah boards the bus to Calico Desert?",
    "context": "On Spring → Spring 15 (Bus Service Restored), At 10:40 AM, leah boards the bus to calico desert to attend the desert festival At 11:20 AM, leah stands by the sand sculpture south of the racing line.",
    "answer_text": "10:40 AM",
    "answer_start": 49
  },
  {
    "id": "sebastian/sebastian-schedule_spring___friday.txt",
    "question": "How many hours does sebastian spend in the saloon?",
    "context": "On Spring → Friday, At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaves his room to go play pool with sam at the saloon At 5:20 PM, sebastian in the saloon, playing pool with sam At 9:10 PM, sebastian heads home At 11:10 PM, sebastian arrives home.",
    "answer_text": "5:20 PM",
    "answer_start": 198
  },
  {
    "id": "elliott/elliott-schedule_spring___spring_15__bus_service_restored_.txt",
    "question": "What time does elliott boards the bus to calico desert?",
    "context": "On Spring → Spring 15 (Bus Service Restored), At 11:00 AM, elliott boards the bus to calico desert to attend the desert festival At 11:40 AM, elliott stands at the cliffside south of the racing line At 1:40 AM, elliott boards bus back to the valley.",
    "answer_text": "11:00 AM",
    "answer_start": 49
  },
  {
    "id": "shane/shane-schedule_winter___sunday__alex_s_14_heart_event_seen_.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Winter → Sunday (Alex's 14 heart event seen), At 7:00AM, shane leaves his room and stands in kitchen at marnie's ranch At 10:00AM, shane leaves marnie's ranch and heads to the back room of the stardrop saloon At 3:00PM, shane moves to his spot next to the fireplace At 12:00AM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "10:00AM",
    "answer_start": 125
  },
  {
    "id": "harvey/harvey-schedule_winter___tuesday_and_thursday.txt",
    "question": "What time does harvey go to bed?",
    "context": "On Winter → Tuesday and Thursday, At 7:30 AM, harvey in exam room of clinic At 12:50 PM, harvey moves to waiting room At 1:30 PM, harvey returns to exam room At 4:30 PM, harvey works at the clinic's front desk At 6:00 PM, harvey goes upstairs to his room, reads in front of bookshelf At 11:00 PM, harvey goes to bed.",
    "answer_text": "11:00 PM",
    "answer_start": 287
  },
  {
    "id": "shane/shane-schedule_fall___sunday__alex_s_14_heart_event_seen_.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Fall → Sunday (Alex's 14 heart event seen), At 7:00 AM, shane leaves his room and stands in kitchen at marnie's ranch At 10:00 AM, shane leaves marnie's ranch and heads to the back room of the stardrop saloon At 3:00 PM, shane moves to his spot next to the fireplace At 12:00 AM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "10:00 AM",
    "answer_start": 124
  },
  {
    "id": "penny/penny-schedule_fall___fall_9_and_23.txt",
    "question": "How many hours does it take Penny to get to the saloon?",
    "context": "On Fall → Fall 9 and 23, At 6:00 AM, penny sleeps in her bed in the trailer At 8:00 AM, penny leaves her trailer and goes outside to read near the town graveyard At 12:30 PM, penny returns to the trailer to wash dishes At 4:00 PM, penny leaves the trailer again to go outside the saloon where she sits on a bench with maru At 6:40 PM, penny returns to her trailer for the evening.",
    "answer_text": "6:40 PM",
    "answer_start": 326
  },
  {
    "id": "shane/shane-schedule_spring___sunday__alex_s_14_heart_event_seen_.txt",
    "question": "When does shane leave marnie's ranch?",
    "context": "On Spring → Sunday (Alex's 14 heart event seen), At 7:00 AM, shane leaves his room and stands in kitchen at marnie's ranch At 10:00 AM, shane leaves marnie's ranch and heads to the back room of the stardrop saloon At 3:00 PM, shane moves to his spot next to the fireplace At 12:00 AM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "10:00 AM",
    "answer_start": 126
  },
  {
    "id": "sebastian/sebastian-schedule_spring___spring_11_and_25__any_player_has_at_least_6_hearts_with_sebastian_.txt",
    "question": "How many hours does Sebastian spend smoking by the lake?",
    "context": "On Spring → Spring 11 and 25 (Any player has at least 6 hearts with Sebastian), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaves his computer and goes to the kitchen At 3:30 PM, sebastian leaves the kitchen to go back to his room At 4:10 PM, sebastian on his computer At 6:30 PM, sebastian leaves home and walks to lake next to his house to smoke At 7:30 PM, sebastian smoking by the lake next to his house At 9:30 PM, sebastian goes back to his house.",
    "answer_text": "7:30 PM",
    "answer_start": 428
  },
  {
    "id": "alex/alex-schedule_fall___wednesday__no_player_has_6_hearts_with_haley_or_alex_.txt",
    "question": "How many hours does it take Alex to go outside and stand beneath a tree?",
    "context": "On Fall → Wednesday (No player has 6 hearts with Haley or Alex), At 8:00 AM, alex leaves his room to go outside and stand beneath nearby tree At 12:00 PM, alex goes to haley and emily's house At 4:30 PM, alex leaves haley and emily's house to go stand by the dog pen At 6:40 PM, alex goes back into his house and stands in the entryway At 8:00 PM, alex goes to his room and stands by his dresser At 10:00 PM, alex goes to bed.",
    "answer_text": "8:00 AM",
    "answer_start": 68
  },
  {
    "id": "haley/haley-schedule_winter___wednesday__no_player_has_6_hearts_with_haley_or_alex_.txt",
    "question": "How many hours does it take for Haley to go to bed?",
    "context": "On Winter → Wednesday (No player has 6 hearts with Haley or Alex), At 9:00 AM, haley in her room At 12:10 PM, haley in the living room At 4:30 PM, haley moves to the kitchen At 8:00 PM, haley returns to her room At 10:30 PM, haley goes to bed.",
    "answer_text": "10:30 PM",
    "answer_start": 215
  },
  {
    "id": "sam/sam-heart_event_eight_hearts.txt",
    "question": "What does Sam ask you to do if you've seen his two-heart event?",
    "context": "At Eight Hearts, if the condition \"Sam shows up at your doorstep between 6am and 8am. Only triggers if you've seen his two-heart event.\" is met, the event is as follows: Sam invites you to see his band play in Zuzu City and asks to meet at the bus stop at 4pm. Enter the bus stop map between 4pm and 7pm to meet Sam and the others, and watch them play. He thanks you for inspiring his band with the type of music they should play. This heart event does not require the bus to be repaired. If you have skipped Sam's 2-heart cutscene, cheerful pop music will play during this heart event. Additionally, no time will have passed during the heart scene (unlike festivals, which always end the day), so if the bus stop map is entered at 4pm, you will return at 4pm as well.",
    "answer_text": "meet at the bus stop at 4pm",
    "answer_start": 232
  },
  {
    "id": "maru/maru-neutral_gifts.txt",
    "question": "Who neutralizes the following gifts: Daffodil, Dandelion, Ginger, Hazelnut, Leek, Wild Horseradish, Winter Root?",
    "context": "maru neutrals the following gifts: Daffodil (A traditional spring flower that makes a nice gift.), Dandelion (Not the prettiest flower, but the leaves make a good salad.), Ginger (This sharp, spicy root is said to increase vitality.), Hazelnut (That's one big hazelnut!), Leek (A tasty relative of the onion.), Wild Horseradish (A spicy root found in the spring.), Winter Root (A starchy tuber.).",
    "answer_text": "maru",
    "answer_start": 0
  },
  {
    "id": "sam/sam-schedule_fall___friday.txt",
    "question": "How many hours does sam spend at the stardrop saloon?",
    "context": "On Fall → Friday, At 10:00 AM, sam wakes up and plays guitar inside his bedroom At 11:00 AM, sam leaves his bedroom and skateboards outside of his house At 3:00 PM, sam walks to the stardrop saloon At 4:00 PM, sam arrives at the stardrop saloon and plays pool near the arcade At 9:20 PM, sam leaves the stardrop saloon and walks home At 10:20 PM, sam arrives at home.",
    "answer_text": "4:00 PM",
    "answer_start": 201
  },
  {
    "id": "shane/shane-schedule_spring___monday_-_friday__community_center_restored_.txt",
    "question": "What time does shane leave his room and stands in kitchen at marnie's ranch?",
    "context": "On Spring → Monday - Friday (Community Center Restored), At 9:00 AM, shane leaves his room and stands in kitchen at marnie's ranch At 11:00 AM, shane leaves the kitchen and returns to his room At 12:00 PM, shane leaves his room and stands by the fireplace at marnie's ranch At 2:00 PM, shane leaves marnie's ranch and heads to the stardrop saloon At 11:00 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "9:00 AM",
    "answer_start": 60
  },
  {
    "id": "abigail/abigail-neutral_gifts.txt",
    "question": "Who neutralizes the following gifts: Chanterelle, Common Mushroom, Daffodil, Dandelion, Ginger, Hazelnut, Leek, Magma Cap, Morel, Winter Root?",
    "context": "abigail neutrals the following gifts: Chanterelle (A tasty mushroom with a fruity smell and slightly peppery flavor.), Common Mushroom (Slightly nutty, with good texture.), Daffodil (A traditional spring flower that makes a nice gift.), Dandelion (Not the prettiest flower, but the leaves make a good salad.), Ginger (This sharp, spicy root is said to increase vitality.), Hazelnut (That's one big hazelnut!), Leek (A tasty relative of the onion.), Magma Cap (A very rare mushroom that lives next to pools of lava.), Morel (Sought after for its unique nutty flavor.), Purple Mushroom (A rare mushroom found deep in caves.), Snow Yam (This little yam was hiding beneath the snow.), Winter Root (A starchy tuber.).",
    "answer_text": "abigail",
    "answer_start": 0
  },
  {
    "id": "sam/sam-schedule_spring___friday.txt",
    "question": "How many hours does sam spend at the stardrop saloon?",
    "context": "On Spring → Friday, At 10:00 AM, sam wakes up and plays guitar inside his bedroom At 11:00 AM, sam leaves his bedroom and skateboards outside of his house At 3:00 PM, sam walks to the stardrop saloon At 4:00 PM, sam arrives at the stardrop saloon and plays pool near the arcade At 9:20 PM, sam leaves the stardrop saloon and walks home At 10:20 PM, sam arrives at home.",
    "answer_text": "4:00 PM",
    "answer_start": 203
  },
  {
    "id": "abigail/abigail-schedule_spring___rain__option_1_.txt",
    "question": "What time does abigail go to the kitchen?",
    "context": "On Spring → Rain (Option 1), At 9:00 AM, abigail in her room At 11:00 AM, abigail leaves her room to stand in pierre's general store At 1:00 PM, abigail goes to the kitchen At 3:00 PM, abigail returns to her room At 10:00 PM, abigail goes to bed.",
    "answer_text": "3:00 PM",
    "answer_start": 176
  },
  {
    "id": "haley/haley-schedule_spring___regular_schedule.txt",
    "question": "What time does Haley go to bed?",
    "context": "On Spring → Regular Schedule, At 9:00 AM, haley in her room At 11:00 AM, haley leaving home to go to the fountain At 12:20 PM, haley by the fountain, west of community center At 4:30 PM, haley heads home At 5:50 PM, haley at home, cooking dinner At 8:20 PM, haley in her room At 10:30 PM, haley goes to bed.",
    "answer_text": "10:30 PM",
    "answer_start": 279
  },
  {
    "id": "abigail/abigail-schedule_winter___winter_6_and_16.txt",
    "question": "What time does abigail arrive at home?",
    "context": "On Winter → Winter 6 and 16, At 9:00 AM, abigail leaving her room to go to the kitchen At 10:30 AM, abigail leaves the kitchen to stand in pierre's general store At 3:00 PM, abigail goes to the mountain, standing on the southwest corner of the lake, playing the flute At 8:00 PM, abigail heads home to go to bed At 9:40 PM, abigail arrives at home.",
    "answer_text": "9:40 PM",
    "answer_start": 315
  },
  {
    "id": "leah/leah-schedule_summer___monday.txt",
    "question": "What time does leah go to shop at pierre's general store?",
    "context": "On Summer → Monday, At 9:00 AM, leah sculpts in her cottage At 11:00 AM, leah goes to shop at pierre's general store At 5:00 PM, leah leaves the store to return home and stands in front of her bookcase At 10:00 PM, leah stands at the table in her house At 12:00 AM, leah goes to bed for the night.",
    "answer_text": "11:00 AM",
    "answer_start": 63
  },
  {
    "id": "sam/sam-schedule_fall___rain__option_2_.txt",
    "question": "What time does Sam wake up for the day?",
    "context": "On Fall → Rain (Option 2), At 10:00 AM, sam wakes up for the day, moves around his room At 11:00 AM, sam moves around inside his home At 2:00 PM, sam leaves his bedroom and walks to the stardrop saloon. \"nothing like an ice cold joja cola on a sopping wet day, huh? just kidding. hehehe.\" At 7:40 PM, sam leaves the stardrop saloon and returns to his bedroom to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 30
  },
  {
    "id": "haley/haley-schedule_fall___regular_schedule.txt",
    "question": "What time does Haley go to bed?",
    "context": "On Fall → Regular Schedule, At 9:00 AM, haley in her room At 11:00 AM, haley leaving home to go to the fountain At 12:20 PM, haley by the fountain, west of community center At 4:30 PM, haley heads home At 5:50 PM, haley at home, cooking dinner At 8:20 PM, haley in her room At 10:30 PM, haley goes to bed.",
    "answer_text": "10:30 PM",
    "answer_start": 277
  },
  {
    "id": "penny/penny-hate_gifts.txt",
    "question": "Who hates the following gifts: Beer (Drink in moderation.), Grape (A sweet cluster of fruit.), Holly (The leaves and bright red berries make a popular winter decoration.), Hops (A bitter, tangy flower used to flavor beer.), Mead (A fermented beverage made from honey. Drink in modrest.), Pale",
    "context": "penny hates the following gifts: Beer (Drink in moderation.), Grape (A sweet cluster of fruit.), Holly (The leaves and bright red berries make a popular winter decoration.), Hops (A bitter, tangy flower used to flavor beer.), Mead (A fermented beverage made from honey. Drink in moderation.), Pale Ale (Drink in moderation.), Piña Colada (Drink in moderation.), Rabbit's Foot (Some say it's lucky.), Wine (Drink in moderation.).",
    "answer_text": "penny hates the following gifts",
    "answer_start": 0
  },
  {
    "id": "sebastian/sebastian-hate_gifts.txt",
    "question": "Who hates the following gifts: Clay, Omelet, or Pia Colada?",
    "context": "sebastian hates the following gifts: Clay (Used in crafting and construction.), Complete Breakfast (You'll feel ready to take on the world!), Farmer's Lunch (This'll keep you going.), Omelet (It's super fluffy.), Piña Colada (Drink in moderation.).",
    "answer_text": "sebastian",
    "answer_start": 0
  },
  {
    "id": "penny/penny-schedule_winter___winter_4.txt",
    "question": "How many hours does it take Penny to go to the clinic?",
    "context": "On Winter → Winter 4, At 9:00 AM, penny wakes up and moves around her trailer At 11:30 AM, penny walks from her trailer to harvey's clinic for her annual checkup At 1:30 PM, penny continues her checkup at the clinic At 4:00 PM, penny leaves the clinic and goes to sit by the bridge west from jojamart At 7:00 PM, penny leaves town and returns to the trailer to do dishes At 9:00 PM, penny goes to bed in her room in the trailer for the evening.",
    "answer_text": "4:00 PM",
    "answer_start": 219
  },
  {
    "id": "sam/sam-schedule_fall___fall_9_and_23.txt",
    "question": "How many hours does Sam wake up for the day?",
    "context": "On Fall → Fall 9 and 23, At 10:00 AM, sam wakes up for the day, moves around his room At 10:40 AM, sam plays guitar inside his bedroom At 1:40 PM, sam leaves his bedroom, walks into town, and stands near lewis' house by the river At 6:30 PM, sam returns home from town At 9:00 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "10:40 AM",
    "answer_start": 89
  },
  {
    "id": "sebastian/sebastian-schedule_fall___fall_11__no_player_has_6_hearts_with_sebastian_.txt",
    "question": "What time does Sebastian get out of bed and moves to his computer?",
    "context": "On Fall → Fall 11 (No player has 6 hearts with Sebastian), At 9:00 AM, sebastian in his bed At 10:00 AM, sebastian gets out of bed and moves to his computer At 12:00 PM, sebastian in his room, standing by couch At 5:30 PM, sebastian leaving his room to go to the kitchen At 6:00 PM, sebastian leaves the kitchen to go back to his room At 6:30 PM, sebastian on his computer At 9:30 PM, sebastian goes to bed.",
    "answer_text": "12:00 PM",
    "answer_start": 160
  },
  {
    "id": "abigail/abigail-schedule_fall___rain__option_2_.txt",
    "question": "What time does abigail go to bed?",
    "context": "On Fall → Rain (Option 2), At 9:00 AM, abigail leaving her room to go to the kitchen At 11:00 AM, abigail leaves the kitchen to stand in pierre's general store At 2:00 PM, abigail leaving the house to go to the stardrop saloon At 2:50 PM, abigail in the stardrop saloon, sitting on a sofa in the arcade At 9:00 PM, abigail heads home At 10:00 PM, abigail goes to bed.",
    "answer_text": "10:00 PM",
    "answer_start": 337
  },
  {
    "id": "abigail/abigail-schedule_marriage___green_rain__year_1_.txt",
    "question": "What is Abigail's parent's name?",
    "context": "On Marriage → Green Rain (Year 1), At 6:10 AM, abigail walks to her parent's living room.",
    "answer_text": "living room",
    "answer_start": 77
  },
  {
    "id": "maru/maru-schedule_spring___desert_festival__as_vendor_.txt",
    "question": "How many hours does it take to board the bus to calico desert?",
    "context": "On Spring → Desert Festival (As Vendor), At 11:10 AM, maru boards the bus to calico desert At 11:30 AM, maru arrives at her booth At 12:00 AM, maru leaves booth and takes the bus back to the valley.",
    "answer_text": "11:10 AM",
    "answer_start": 44
  },
  {
    "id": "maru/maru-schedule_spring___spring_16__bus_service_restored_.txt",
    "question": "What time does maru boards the bus back to the valley?",
    "context": "On Spring → Spring 16 (Bus Service Restored), At 9:20 AM, maru boards the bus to calico desert to attend the desert festival At 9:50 AM, maru watches the races near the finish line At 12:20 AM, maru boards the bus back to the valley.",
    "answer_text": "12:20 AM",
    "answer_start": 184
  },
  {
    "id": "leah/leah-schedule_marriage___monday.txt",
    "question": "When does leah leave the forest to return home?",
    "context": "On Marriage → Monday, At 8:30 AM, leah leaves the farmhouse to walk to the bridge near the small island southwest of her cottage At 3:00 PM, leah stands outside of her cottage At 5:30 PM, leah leaves the forest to return home to the farm.",
    "answer_text": "5:30 PM",
    "answer_start": 179
  },
  {
    "id": "alex/alex-heart_event_ten_hearts.txt",
    "question": "How long does it take Alex to get a letter from Emily?",
    "context": "At Ten Hearts, if the condition \"Alex will send you a letter to meet him atthe Saloonafter dark. After receiving the letter, enterthe Saloonbetween 7pm and 10pm.\" is met, the event is as follows: Alex reserves a private room for your dinner date. Gus plays the violin for you two, and Emily will bring in your food. If the player is female, Alex confesses that he has had a crush on you since the two of you first met, and although his crushes in the past faded away quickly, his feelings for you kept growing. If the player is male, Alex confesses that he has been drawn to you since the two of you first met; although he denied these feelings at first, he's now decided to follow his heart. \"I feel the same way.\" (No effect on friendship .) Alex is elated that the both of you were finally able to admit your feelings to each other. He happily digs into his steak. Dusty suddenly bursts through the window, salivating at the smell of food. Alex laughs. \"I'm sorry... I don't feel that way about you.\" (No effect on friendship .) Alex is crushed and apologizes for making you uncomfortable. He loses his appetite.",
    "answer_text": "7pm and 10pm",
    "answer_start": 148
  },
  {
    "id": "harvey/harvey-schedule_winter___friday.txt",
    "question": "What time does harvey work at the clinic's front desk?",
    "context": "On Winter → Friday, At 7:00 AM, harvey stands in front of refrigerator in his room At 8:30 AM, harvey works at the clinic's front desk At 12:00 PM, harvey goes to pierre's general store At 3:00 PM, harvey returns to his room above the clinic At 10:00 PM, harvey goes to bed.",
    "answer_text": "12:00 PM",
    "answer_start": 138
  },
  {
    "id": "elliott/elliott-schedule_spring___regular_schedule.txt",
    "question": "When does elliott leave his cabin to stand on the beach?",
    "context": "On Spring → Regular Schedule, At 8:00 AM, elliott at home At 12:00 PM, elliott leaves his cabin to stand on the beach south of his house At 1:30 PM, elliott leaves the beach and returns to his cabin At 3:00 PM, elliott leaves his cabin to stand on the bridge just north of the beach At 6:00 PM, elliott leaves the bridge to return home for the night.",
    "answer_text": "1:30 PM",
    "answer_start": 140
  },
  {
    "id": "alex/alex-schedule_winter___regular_schedule.txt",
    "question": "How many hours does it take Alex to go to the spa?",
    "context": "On Winter → Regular Schedule, At 8:00 AM, alex in his bedroom At 9:00 AM, alex leaves his house to go to the spa At 3:00 PM, alex leaves the gym section of the spa, heads home to his room At 6:00 PM, alex leaves his house to stand by the dog kennel At 7:30 PM, alex goes back inside his house and stands in the entryway At 9:00 PM, alex goes back to his bedroom and stands by his dresser At 10:40 PM, alex goes to bed.",
    "answer_text": "3:00 PM",
    "answer_start": 116
  },
  {
    "id": "haley/haley-schedule_spring___spring_16__bus_service_restored_.txt",
    "question": "When does Haley take the bus back to the valley?",
    "context": "On Spring → Spring 16 (Bus Service Restored), At 10:20 AM, haley boards the bus to calico desert to attend the desert festival At 11:00 AM, haley sunbathes on the cliff south of the oasis At 9:00 PM, haley gets up and heads back to the bus At 9:30 PM, haley takes the bus back to the valley.",
    "answer_text": "9:30 PM",
    "answer_start": 243
  },
  {
    "id": "haley/haley-heart_event_two_hearts.txt",
    "question": "How many friendships are there between Emily and Haley?",
    "context": "At Two Hearts, if the condition \"EnterHaley and Emily's housewhen they're both there.\" is met, the event is as follows: Haley and Emily are fighting about cleaning under the couch cushions when you arrive. Emily is upset that Haley refuses to clean the cushions. Haley says she cleaned them last week, and Emily thinks Haley is being childish. You're tasked with resolving the conflict. \"Stop whining and just clean it!\" (-50 friendship .) Haley angrily storms off and Emily cleans the cushions. \"Haley, why not have this be your one weekly job?\" (+30 friendship .) Both agree, though Haley isn't ecstatic about it. \"Emily, take the high road and do it this time.\" (-30 friendship .) Haley is upset that you implied she's being childish. Emily cleans the cushions.",
    "answer_text": "50 friendship",
    "answer_start": 423
  },
  {
    "id": "maru/maru-like_gifts.txt",
    "question": "What are some of the gifts that maru likes?",
    "context": "maru likes the following gifts: Chanterelle (A tasty mushroom with a fruity smell and slightly peppery flavor.), Copper Bar (A bar of pure copper.), Iron Bar (A bar of pure iron.), Magma Cap (A very rare mushroom that lives next to pools of lava.), Morel (Sought after for its unique nutty flavor.), Oak Resin (A sticky, fragrant substance derived from oak sap.), Pine Tar (A pungent substance derived from pine sap.), Purple Mushroom (A rare mushroom found deep in caves.), Quartz (A clear crystal commonly found in caves and mines.), Radioactive Ore (It's glowing with dangerous energy... Can be smelted into bars.).",
    "answer_text": "Chanterelle",
    "answer_start": 32
  },
  {
    "id": "elliott/elliott-schedule_summer___thursday.txt",
    "question": "What time does elliott leave pierre's general store?",
    "context": "On Summer → Thursday, At 8:00 AM, elliott at home At 11:30 AM, elliott leaves home and heads to pierre's general store At 5:30 PM, elliott leaves pierre's and heads home for the night.",
    "answer_text": "5:30 PM",
    "answer_start": 122
  },
  {
    "id": "sebastian/sebastian-schedule_winter___winter_16.txt",
    "question": "What time does sebastian wake up and goes to his computer?",
    "context": "On Winter → Winter 16, At 10:30 AM, sebastian wakes up and goes to his computer At 3:00 PM, sebastian leaves room and goes to kitchen At 3:40 PM, sebastian goes back to room and returns to his computer At 5:00 PM, sebastian leaves his home to attend night market At 11:30 PM, sebastian leaves night market to return home.",
    "answer_text": "10:30 AM",
    "answer_start": 26
  },
  {
    "id": "maru/maru-heart_event_ten_hearts.txt",
    "question": "How many friends does Maru have? (No effect on friendship)",
    "context": "At Ten Hearts, if the condition \"Enter theCarpenter's Shopbetween 9am and 4pm.\" is met, the event is as follows: Maru says her big project is finally done. She takes you into her private workshop to show you a robot she built to help her parents. She calls it MarILDA, short for Maru's Interactive Laboratory Device Alpha . She tells you she's been working on it for months, and has been waiting for you to come by before activating MarILDA. She activates the robot, who says \"Greetings, Maru. No need to respond... I have already predicted what you will say.\" Demetrius comes in to see what you two are up to. He sees the robot and becomes frightened. Maru tells him not to be scared and that MarILDA is her latest invention. The robot greets him, but Demetrius is upset. \"This is why you've locked yourself in your room the last few months? ...and I thought you were down here fooling around with <your name>...\" Maru says she's been making this robot to help Demetrius and Robin when she's not living with them anymore. MarILDA interrupts: \"Excuse me... I am sorry, Maru. But I do not want to be your servant... In the time since you activated me, I have been pondering the nature of my existence with the 'self-awareness' module you installed in my neural cortex. I am sorry to disappoint you all, but I must ask for my freedom. I've decided to explore the galaxy in search of other synthetic life-forms.\" Maru is startled and asks her to wait, but Demetrius says it's OK to let MarILDA go free. \"Your mother and I can take care of ourselves. I know you're ready to start a life of your own, and I've come to terms with the thought of not having you around anymore. Besides, this... creation of yours seems pretty advanced. It wouldn't feel right to keep her as a servant. <your name>, I'm sorry I mistrusted you. You're a < good guy or fine young woman >. I've never seen Maru so lively and creative... and I've never been more proud of her. If you've had a hand in that, then you have my gratitude.\" He leaves the room. Maru walks MarILDA outside. MarILDA thanks Maru for creating her and blasts off into space. Maru watches her go and asks what you think. \"I'm so impressed with your inventions.\" (+50 friendship .) Maru responds: \"Thanks. That means a lot to me, <your name>. I know gadgets aren't really your kind of thing... but I do appreciate that you're showing interest in what I do. I wish I could return the favor somehow.\" \"I'm disappointed... you should have made that robot your slave.\" (-50 friendship .) Maru responds: \"What? After she said point-blank that she doesn't want to be a slave? How cold... You must have a good reason for saying that...\" \"MarILDA's just a piece of machinery designed to act human.\" (+50 friendship .) Maru responds: \"... You have a point, I did program her to act human... but her neural net is so complex, I can't be sure conciousness didn't emerge on its own. Furthermore, isn't it a little arrogant to assume that human-like consciousness is the only worthwhile vessel of existence? Computer brains are different than ours, but that doesn't mean we can disregard them.\" She thanks you for coming by and leaves. \"I was just kidding. MarILDA deserves her freedom.\" (+50 friendship .) Maru responds: \"I see. Well it wasn't a very funny joke.\" She thanks you for coming by and leaves. \"I would've put her to work on the farm.\" (-50 friendship .) Maru responds: \"That's horrible! What's gotten into you, <your name>? I'm just going to forget about this conversation... you aren't acting yourself.\" She thanks you for coming by and leaves. \"So is your Dad okay with 'us' now?\" (No effect on friendship .) Maru responds: \"Heh... Yeah I guess he did kinda say that, didn't he? ...Um...\" (Just stare at Maru and say nothing) (No effect on friendship .) Maru responds: \"... ...\"",
    "answer_text": "+50 friendship .",
    "answer_start": 2205
  },
  {
    "id": "harvey/harvey-schedule_spring___saturday.txt",
    "question": "What is the name of the day that Harvey leaves home to go to the museum?",
    "context": "On Spring → Saturday, At 8:30 AM, harvey leaves home to go to the museum At 3:00 PM, harvey leaves the museum to return to his room above the clinic.",
    "answer_text": "Saturday,",
    "answer_start": 12
  },
  {
    "id": "harvey/harvey-schedule_spring___friday.txt",
    "question": "What time does harvey work at the clinic's front desk?",
    "context": "On Spring → Friday, At 7:00 AM, harvey stands in front of refrigerator in his room At 8:30 AM, harvey works at the clinic's front desk At 12:00 PM, harvey goes to pierre's general store At 3:00 PM, harvey returns to his room above the clinic At 10:00 PM, harvey goes to bed.",
    "answer_text": "12:00 PM",
    "answer_start": 138
  },
  {
    "id": "harvey/harvey-schedule_marriage___spring_15__16_and_17__bus_service_restored_.txt",
    "question": "What time does Harvey leave the farmhouse and head to the desert festival?",
    "context": "On Marriage → Spring 15, 16 and 17 (Bus Service Restored), At 9:00 AM, harvey leaves the farmhouse and heads to the desert festival At 9:40 AM, harvey stands at the medical tent.",
    "answer_text": "9:00 AM",
    "answer_start": 62
  },
  {
    "id": "maru/maru-schedule_fall___rain.txt",
    "question": "What time does maru go to the lab?",
    "context": "On Fall → Rain, At 9:00 AM, maru in her bedroom At 12:30 PM, maru leaves her room to stand in the \"store\" part of the house At 2:30 PM, maru goes to the lab in her house At 4:30 PM, maru returns to her room At 11:00 PM, maru goes to bed.",
    "answer_text": "4:30 PM",
    "answer_start": 173
  },
  {
    "id": "penny/penny-schedule_fall___rain__option_1_.txt",
    "question": "How many hours does it take Penny to go to bed?",
    "context": "On Fall → Rain (Option 1), At 9:00 AM, penny in her bedroom in the trailer At 11:00 AM, penny moves to the kitchen At 1:00 PM, penny does some dishes At 3:00 PM, penny sits on the couch, probably watching tv At 6:00 PM, penny returns to her bedroom, reading by the bookshelf At 9:00 PM, penny goes to bed for the evening.",
    "answer_text": "evening.",
    "answer_start": 313
  },
  {
    "id": "emily/emily-schedule_marriage___monday.txt",
    "question": "What time does emily leave the saloon?",
    "context": "On Marriage → Monday, At 8:30 AM, emily leaves home to walk to 2 willow lane, stands in kitchen At 11:00 AM, emily leaves 2 willow lane to go to town, stands east of community center and looks at the river At 3:00 PM, emily heads for the stardrop saloon to work At 10:00 PM, emily leaves the saloon to return home.",
    "answer_text": "10:00 PM",
    "answer_start": 265
  },
  {
    "id": "shane/shane-schedule_marriage___sunday__alex_s_14_heart_event_seen_.txt",
    "question": "How many hours does shane spend at home?",
    "context": "On Marriage → Sunday (Alex's 14 heart event seen), At 6:00 AM, shane at home At 8:30 AM, shane leaves home and heads for the river in pelican town At 10:00 AM, shane leaves the river and heads to the back room of the stardrop saloon At 3:00 PM, shane moves to stand in front of the joja vending machine At 8:00 PM, shane leaves the stardrop saloon and heads back home.",
    "answer_text": "6:00 AM",
    "answer_start": 54
  },
  {
    "id": "penny/penny-schedule_spring___spring_9_and_23__no_player_has_6_hearts_with_penny_or_sam_.txt",
    "question": "How many hours does it take Penny to go to bed?",
    "context": "On Spring → Spring 9 and 23 (No player has 6 hearts with Penny or Sam), At 6:00 AM, penny sleeps in her bed in the trailer At 9:00 AM, penny wakes up and stands in her bedroom At 11:00 AM, penny walks to town and sits on the bridge near the ice cream stand At 4:00 PM, penny returns from town to the trailer and does some dishes At 6:40 PM, penny goes to bed in her room in the trailer for the evening.",
    "answer_text": "6:40 PM",
    "answer_start": 332
  },
  {
    "id": "shane/shane-hate_gifts.txt",
    "question": "What is the name of the crystal that Shane hates?",
    "context": "shane hates the following gifts: Pickles (A jar of your home-made pickles.), Quartz (A clear crystal commonly found in caves and mines.).",
    "answer_text": "Quartz (A clear crystal commonly found in caves and mines.",
    "answer_start": 77
  },
  {
    "id": "shane/shane-schedule_winter___monday_-_friday.txt",
    "question": "How many hours does shane spend in the kitchen at marnie's ranch?",
    "context": "On Winter → Monday - Friday, At 9:00 AM, shane leaves his room and stands in kitchen at marnie's ranch At 11:00 AM, shane leaves the kitchen and returns to his room At 12:00 PM, shane leaves his room and stands by the fireplace at marnie's ranch At 2:00 PM, shane leaves marnie's ranch and heads to the stardrop saloon At 11:00 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "Monday - Friday",
    "answer_start": 12
  },
  {
    "id": "alex/alex-schedule_summer___summer_16.txt",
    "question": "How long does it take alex to return home for the night?",
    "context": "On Summer → Summer 16, At 8:00 AM, alex leaves his room to go outside and stand beneath nearby tree At 10:30 AM, alex goes to clinic At 11:00 AM, alex in clinic waiting room At 1:40 PM, alex clinic examination room At 4:00 PM, alex returns home for the night.",
    "answer_text": "1:40 PM",
    "answer_start": 177
  },
  {
    "id": "penny/penny-heart_event_ten_hearts.txt",
    "question": "What does Penny do after receiving the letter from Penny?",
    "context": "At Ten Hearts, if the condition \"You receive a letter from Penny. After receiving the letter, enter the pool area of thespabetween 7pm and midnight.\" is met, the event is as follows: Penny joins you in the pool. She asks if you know why she invited you here. \"You have something to tell me.\" (No effect on friendship .) She responds, \"That's right...\" \"I'm not exactly sure.\" (No effect on friendship .) She responds, \"Really? I thought you'd have noticed by now...\" \"You wanted to see me in my bathing suit.\" (No effect on friendship .) She responds, \"No!\" Penny confesses her feelings for you. \"I feel the same way about you.\" (No effect on friendship .) If the player is male, she responds, \"...Oh, <player name>. I thought you did, but I wasn't sure. ...I'll always remember this night.\" You kiss and the cutscene ends. If the player is female, she responds, \"...Oh, <player name>. I thought you did, but I wasn't sure. You look so beautiful tonight... I... *gasp*\" You kiss and the cutscene ends. \"Sorry, but I don't like you in that way...\" (-1500 friendship .) She bursts into tears and the cutscene ends.",
    "answer_text": "enter the pool",
    "answer_start": 94
  },
  {
    "id": "maru/maru-schedule_winter___regular_schedule.txt",
    "question": "What time does maru go to the lab in her house?",
    "context": "On Winter → Regular Schedule, At 9:00 AM, maru in her room At 10:20 AM, maru goes to the lab in her house At 2:40 PM, maru leaves to sit on the bench by the community center At 6:00 PM, maru heads home At 6:40 PM, maru at home, in the kitchen At 10:00 PM, maru goes to her room At 12:00 AM, maru goes to bed.",
    "answer_text": "9:00 AM",
    "answer_start": 33
  },
  {
    "id": "sebastian/sebastian-schedule_fall___saturday.txt",
    "question": "How many hours does it take for sebastian to arrive home?",
    "context": "On Fall → Saturday, At 9:00 AM, sebastian leaves house to go to sam's house At 11:30 AM, sebastian in front of haley and emily's house with sam At 12:30 PM, sebastian follows sam to his room At 1:00 PM, sebastian in sam's room At 6:00 PM, sebastian leaves sam's house with sam and goes to the river At 6:20 PM, sebastian smoking by the river outside sam's house with him At 7:30 PM, sebastian going home from in front of sam's house At 9:40 PM, sebastian arrives home.",
    "answer_text": "9:40 PM",
    "answer_start": 436
  },
  {
    "id": "shane/shane-schedule_summer___monday_-_friday.txt",
    "question": "How many hours does shane spend in the kitchen at marnie's ranch?",
    "context": "On Summer → Monday - Friday, At 9:00 AM, shane leaves his room and stands in kitchen at marnie's ranch At 11:00 AM, shane leaves the kitchen and returns to his room At 12:00 PM, shane leaves his room and stands by the fireplace at marnie's ranch At 2:00 PM, shane leaves marnie's ranch and heads to the stardrop saloon At 11:00 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "Monday - Friday",
    "answer_start": 12
  },
  {
    "id": "sebastian/sebastian-schedule_spring___regular_schedule.txt",
    "question": "What time does sebastian get out of bed and moves to his computer?",
    "context": "On Spring → Regular Schedule, At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaves his computer and goes to the kitchen At 3:30 PM, sebastian leaves the kitchen to go back to his room At 4:10 PM, sebastian on his computer At 6:30 PM, sebastian leaves home and walks to lake next to his house to smoke At 7:30 PM, sebastian smoking by the lake next to his house At 9:30 PM, sebastian goes back to his house.",
    "answer_text": "10:30 AM",
    "answer_start": 66
  },
  {
    "id": "abigail/abigail-schedule_summer___regular_schedule.txt",
    "question": "When does abigail go to bed?",
    "context": "On Summer → Regular Schedule, At 9:00 AM, abigail leaving her room to go to the kitchen At 11:00 AM, abigail leaves home, walks to the train platform At 1:00 PM, abigail waiting in front of the train platform At 2:00 PM, abigail walks to the lake east of the carpenter's shop At 3:00 PM, abigail standing by the mountain lake east of the carpenter's shop At 5:30 PM, abigail heads home At 7:30 PM, abigail arrives home At 8:00 PM, abigail plays video games At 8:10 PM, abigail goes to bed.",
    "answer_text": "8:10 PM",
    "answer_start": 460
  },
  {
    "id": "abigail/abigail-schedule_fall___regular_schedule.txt",
    "question": "What time does abigail leave the house to go to the kitchen?",
    "context": "On Fall → Regular Schedule, At 9:00 AM, abigail leaves her room to go to the kitchen At 10:30 AM, abigail leaves the kitchen to stand in pierre's general store At 1:00 PM, abigail leaving the house to go to stand at bus stop At 2:20 PM, abigail standing at bus stop At 5:00 PM, abigail heads home At 6:30 PM, abigail in her room, playing video games At 7:30 PM, abigail goes to bed.",
    "answer_text": "10:30 AM",
    "answer_start": 88
  },
  {
    "id": "sam/sam-schedule_winter___regular_schedule.txt",
    "question": "What time does sam wake up for the day?",
    "context": "On Winter → Regular Schedule, At 10:00 AM, sam wakes up for the day, moves around his room At 10:40 AM, sam plays guitar inside his bedroom At 1:20 PM, sam leaves his bedroom and walks to the stardrop saloon At 7:00 PM, sam returns home from the stardrop saloon At 9:00 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 33
  },
  {
    "id": "leah/leah-schedule_summer___regular_schedule__beach_bridge_repaired_.txt",
    "question": "When does leah go to bed for the night?",
    "context": "On Summer → Regular Schedule (Beach Bridge Repaired), At 9:00 AM, leah sculpts in her cottage At 12:00 PM, leah leaves her cottage to draw at the tidal pools at the beach At 7:00 PM, leah leaves the beach to return home and stands in front of her bookcase At 10:00 PM, leah stands at the table in her house At 12:00 AM, leah goes to bed for the night.",
    "answer_text": "12:00 AM",
    "answer_start": 310
  },
  {
    "id": "elliott/elliott-schedule_summer___friday_and_sunday__no_player_has_6_hearts_with_leah_.txt",
    "question": "What time does elliott leave his cabin to stand on the docks?",
    "context": "On Summer → Friday and Sunday (No player has 6 hearts with Leah), At 8:00 AM, elliott at home At 11:00 AM, elliott leaves his cabin to stand on the docks next to willy's house At 5:00 PM, elliott leaves the docks to visit the stardrop saloon At 11:40 PM, elliott leaves the saloon to return home for the night.",
    "answer_text": "11:00 AM",
    "answer_start": 97
  },
  {
    "id": "sam/sam-schedule_winter___rain__option_2_.txt",
    "question": "What time does Sam wake up for the day?",
    "context": "On Winter → Rain (Option 2), At 10:00 AM, sam wakes up for the day, moves around his room At 11:00 AM, sam moves around inside his home At 2:00 PM, sam leaves his bedroom and walks to the stardrop saloon. \"nothing like an ice cold joja cola on a sopping wet day, huh? just kidding. hehehe.\" At 7:40 PM, sam leaves the stardrop saloon and returns to his bedroom to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 32
  },
  {
    "id": "shane/shane-schedule_winter___winter_15.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Winter → Winter 15, At 7:00 AM, shane at marnie's ranch At 11:00 AM, shane leaves the kitchen to head to his room At 3:00 PM, shane leaves marnie's ranch to attend the night market At 11:00 PM, shane leaves the night market to return home.",
    "answer_text": "3:00 PM",
    "answer_start": 120
  },
  {
    "id": "maru/maru-schedule_winter___community_center_restored.txt",
    "question": "What time does maru go to the lab?",
    "context": "On Winter → Community Center Restored, At 9:00 AM, maru in her room At 10:20 AM, maru goes to the lab in her house At 2:40 PM, maru leaves house to visit the community center crafts room At 6:00 PM, maru heads home At 6:40 PM, maru at home, in the kitchen At 10:00 PM, maru goes to her room At 12:00 AM, maru goes to bed.",
    "answer_text": "9:00 AM",
    "answer_start": 42
  },
  {
    "id": "elliott/elliott-schedule_winter___winter_17.txt",
    "question": "How many hours does elliott spend at home?",
    "context": "On Winter → Winter 17, At 8:00 AM, elliott at home At 11:30 AM, elliott leaves home, heads to the museum At 4:50 PM, elliott leaves the library to attend the night market At 1:00 AM, elliott leaves the night market and returns to his cabin.",
    "answer_text": "8:00 AM",
    "answer_start": 26
  },
  {
    "id": "sebastian/sebastian-schedule_summer___summer_11_and_25__any_player_has_at_least_6_hearts_with_sebastian_.txt",
    "question": "How many hours does Sebastian spend smoking by the lake?",
    "context": "On Summer → Summer 11 and 25 (Any player has at least 6 hearts with Sebastian), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaves his computer and goes to the kitchen At 3:30 PM, sebastian leaves the kitchen to go back to his room At 4:10 PM, sebastian on his computer At 6:30 PM, sebastian leaves home and walks to lake next to his house to smoke At 7:30 PM, sebastian smoking by the lake next to his house At 9:30 PM, sebastian goes back to his house.",
    "answer_text": "7:30 PM",
    "answer_start": 428
  },
  {
    "id": "abigail/abigail-schedule_summer___green_rain__year_1_.txt",
    "question": "Who is abigail in the living room with?",
    "context": "On Summer → Green Rain (Year 1), At All day, abigail in the living room.",
    "answer_text": "All day",
    "answer_start": 36
  },
  {
    "id": "sebastian/sebastian-schedule_spring___thursday__railroad_accessible_.txt",
    "question": "How many hours does sebastian spend smoking by the train station?",
    "context": "On Spring → Thursday (Railroad Accessible), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 2:00 PM, sebastian leaving home to go smoke by train station At 3:00 PM, sebastian smoking by the train station At 6:20 PM, sebastian standing east of train station, by tunnel At 8:10 PM, sebastian standing west of train station, by tunnel At 9:30 PM, sebastian heads home At 10:20 PM, sebastian arrives home.",
    "answer_text": "3:00 PM",
    "answer_start": 209
  },
  {
    "id": "penny/penny-schedule_fall___rain__option_2_.txt",
    "question": "How many hours does it take Penny to go to bed?",
    "context": "On Fall → Rain (Option 2), At 8:10 AM, penny leaves the trailer and walks to the museum to sit outside At 12:00 PM, penny goes inside the museum to look at the bookshelves At 4:00 PM, penny leaves the museum and returns to the trailer to watch some television At 7:00 PM, penny moves over to the sink in the trailer to do some dishes At 9:00 PM, penny goes to bed for the evening.",
    "answer_text": "evening.",
    "answer_start": 372
  },
  {
    "id": "abigail/abigail-schedule_winter___wednesday.txt",
    "question": "What time does abigail arrive at home?",
    "context": "On Winter → Wednesday, At 10:00 AM, abigail leaves home to go to the library At 12:00 PM, abigail inside the library, looking at books At 6:00 PM, abigail walks to the graveyard At 7:00 PM, abigail standing in front of mona's grave At 10:00 PM, abigail heads home At 10:40 PM, abigail arrives at home.",
    "answer_text": "10:40 PM",
    "answer_start": 267
  },
  {
    "id": "maru/maru-schedule_summer___sunday.txt",
    "question": "How many hours does it take for maru to go to bed?",
    "context": "On Summer → Sunday, At 9:00 AM, maru in her room At 10:20 AM, maru in the lab At 12:30 PM, maru returns to her room, with penny At 11:00 PM, maru goes to bed.",
    "answer_text": "11:00 PM",
    "answer_start": 131
  },
  {
    "id": "leah/leah-schedule_winter___rain.txt",
    "question": "What time does Leah leave her cottage?",
    "context": "On Winter → Rain, At 9:00 AM, leah sculpts in her cottage At 12:00 PM, leah moves to her easel to paint At 2:00 PM, leah stands in front of the bookcase in her cottage At 4:00 PM, leah leaves her cottage and walks to the stardrop saloon At 11:40 PM, leah leaves the saloon to return home and sleep.",
    "answer_text": "4:00 PM",
    "answer_start": 171
  },
  {
    "id": "emily/emily-heart_event_eight_hearts.txt",
    "question": "Who does Emily invite to the Mayor's Manor?",
    "context": "At Eight Hearts, if the condition \"A letter in the mail will invite the player to theMayor's Manorthat day during open hours. The event will be available on subsequent days if not seen the same day as the letter arrives.\" is met, the event is as follows: Emily will send you a letter in the Mail, inviting you to attend her \"Clothing Therapy\" session: “ “[Player], I have this crazy new idea that I want to involve\nyou in... It's called \"Clothing Therapy\". Please come to the Mayor's house today to see what\nit's all about. Love, Emily” Enter the Mayor's house. Emily will explain the purpose is to help the townspeople express their true selves in the form of clothing. Attending are Mayor Lewis , Abigail , Shane , Robin , and Clint . Each one takes a turn going behind the curtain. Emily instructs them to choose whatever clothes \"speaks to them\", put it on and then show the world without fear. One by one, you get to see each character's choice. Shane puts on a full \"goth\" outfit. Robin puts on a fine dress and lets her hair down, embracing her feminine side. Mayor Lewis comes out with a fancy hat, cape, and cane. Abigail comes out in a full suit of armor. Clint is apprehensive about the whole thing, but after Emily coaxes him, he goes ahead. He comes out in the Gaudy Shirt , pink shorts and a beret. Emily sees it and says  \"Awww... cute!\", which makes Clint sad. After he is gone, Emily approaches you with romantic interest. Clint bursts in, saying he's too embarrassed to go out in his new outfit. He sees what's going on and feels awful. He makes some indirect remarks about it and leaves. Emily is confused.",
    "answer_text": "the player",
    "answer_start": 68
  },
  {
    "id": "harvey/harvey-schedule_spring___desert_festival__as_vendor_.txt",
    "question": "When does Harvey board the bus to calico desert?",
    "context": "On Spring → Desert Festival (As Vendor), At 11:10 AM, harvey boards bus to calico desert At 11:30 AM, harvey arrives at his booth At 12:00 AM, harvey leaves booth and boards bus back to the valley.",
    "answer_text": "11:10 AM",
    "answer_start": 44
  },
  {
    "id": "penny/penny-schedule_winter___tuesday__wednesday_and_friday.txt",
    "question": "How many hours does it take to walk to marnie's ranch?",
    "context": "On Winter → Tuesday, Wednesday and Friday, At 9:00 AM, penny leaves her trailer and goes to the museum/library to tutor jas and vincent At 2:00 PM, penny leaves the library and stands near the ice cream stand watching over jas and vincent At 4:20 PM, penny walks vincent to 1 willow lane and says goodbye At 5:50 PM, penny walks jas to marnie's ranch and says goodbye At 6:30 PM, penny returns to her trailer for the evening.",
    "answer_text": "5:50 PM",
    "answer_start": 308
  },
  {
    "id": "abigail/abigail-heart_event_eight_hearts.txt",
    "question": "What does Abigail show you when you arrive at the store?",
    "context": "At Eight Hearts, if the condition \"After receiving a letter from Abigail, enterPierre's General Storebetween 8pm and 10pm when she's there. (Note that, unless you have theKey To The Town, you cannot enter the store from outside after 9pm, but you can wait inCaroline's greenhouse and trigger the event by exiting to the kitchen.)\" is met, the event is as follows: Abigail sends you a letter (signed \"Abby\") inviting you to visit her in her room. When you arrive, Abigail shows you her spirit board. It reveals a message that indicates she's starting to develop feelings for you. She gets embarrassed and rushes you out of her room. Regardless of how you entered the store, you will end up outside. The next day she visits you in the morning and apologizes.",
    "answer_text": "her spirit board",
    "answer_start": 481
  },
  {
    "id": "leah/leah-like_gifts.txt",
    "question": "What kind of gift does leah like?",
    "context": "leah likes the following gifts: Chanterelle (A tasty mushroom with a fruity smell and slightly peppery flavor.), Common Mushroom (Slightly nutty, with good texture.), Daffodil (A traditional spring flower that makes a nice gift.), Dandelion (Not the prettiest flower, but the leaves make a good salad.), Driftwood (A piece of wood from the sea.), Ginger (This sharp, spicy root is said to increase vitality.), Hazelnut (That's one big hazelnut!), Holly (The leaves and bright red berries make a popular winter decoration.), Leek (A tasty relative of the onion.), Magma Cap (A very rare mushroom that lives next to pools of lava.), Morel (Sought after for its unique nutty flavor.), Purple Mushroom (A rare mushroom found deep in caves.), Snow Yam (This little yam was hiding beneath the snow.), Spring Onion (These grow wild during the spring.), Wild Horseradish (A spicy root found in the spring.), Winter Root (A starchy tuber.).",
    "answer_text": "Chanterelle",
    "answer_start": 32
  },
  {
    "id": "penny/penny-schedule_fall___fall_9_and_23__no_player_has_6_hearts_with_penny_or_sam_.txt",
    "question": "How many hours does it take Penny to go to bed?",
    "context": "On Fall → Fall 9 and 23 (No player has 6 hearts with Penny or Sam), At 6:00 AM, penny sleeps in her bed in the trailer At 9:00 AM, penny wakes up and stands in her bedroom At 11:00 AM, penny walks to town and sits on the bridge near the ice cream stand At 4:00 PM, penny returns from town to the trailer and does some dishes At 6:40 PM, penny goes to bed in her room in the trailer for the evening.",
    "answer_text": "6:40 PM",
    "answer_start": 328
  },
  {
    "id": "haley/haley-schedule_winter___winter_9.txt",
    "question": "How many hours does it take for Haley to walk home?",
    "context": "On Winter → Winter 9, At 11:30 AM, haley harvey's clinic At 4:00 PM, haley walks home.",
    "answer_text": "4:00 PM",
    "answer_start": 60
  },
  {
    "id": "abigail/abigail-schedule_summer___summer_11_and_25.txt",
    "question": "When does abigail go to bed?",
    "context": "On Summer → Summer 11 and 25, At 9:00 AM, abigail leaves her room to go to the kitchen At 10:30 AM, abigail leaves the kitchen to stand in pierre's store At 1:00 PM, abigail leaves the house to go to stand on bridge near jojamart At 1:30 PM, abigail standing on the bridge near jojamart At 4:30 PM, abigail heads home At 5:20 PM, abigail in her room, playing video games At 7:30 PM, abigail goes to bed.",
    "answer_text": "7:30 PM",
    "answer_start": 374
  },
  {
    "id": "abigail/abigail-schedule_marriage___spring_15__bus_service_restored_.txt",
    "question": "What is the name of the festival that abigail goes to?",
    "context": "On Marriage → Spring 15 (Bus Service Restored), At 8:00 AM, abigail leaves home to go to the desert festival and stand north of the fishing pond At 1:30 AM, abigail returns home.",
    "answer_text": "desert festival",
    "answer_start": 93
  },
  {
    "id": "maru/maru-schedule_spring___monday_and_sunday.txt",
    "question": "What time does maru go to bed?",
    "context": "On Spring → Monday and Sunday, At 9:00 AM, maru in her room At 10:20 AM, maru in the lab At 1:30 PM, maru heading to bench south of the saloon At 3:20 PM, maru sitting on bench south of the saloon At 6:30 PM, maru heading home At 8:30 PM, maru at home, in her room At 11:00 PM, maru goes to bed.",
    "answer_text": "11:00 PM",
    "answer_start": 268
  },
  {
    "id": "elliott/elliott-schedule_fall___friday_and_sunday__no_player_has_6_hearts_with_leah_.txt",
    "question": "How many hours does elliott spend at home?",
    "context": "On Fall → Friday and Sunday (No player has 6 hearts with Leah), At 8:00 AM, elliott at home At 11:00 AM, elliott leaves his cabin to stand on the docks next to willy's house At 5:00 PM, elliott leaves the docks to visit the stardrop saloon At 11:40 PM, elliott leaves the saloon to return home for the night.",
    "answer_text": "8:00 AM",
    "answer_start": 67
  },
  {
    "id": "maru/maru-schedule_summer___rain.txt",
    "question": "What time does maru go to the lab?",
    "context": "On Summer → Rain, At 9:00 AM, maru in her room At 12:30 PM, maru leaves her room to stand in the \"store\" part of the house At 2:30 PM, maru goes to the lab in her house At 4:30 PM, maru at home, in her room At 11:00 PM, maru goes to bed.",
    "answer_text": "4:30 PM",
    "answer_start": 172
  },
  {
    "id": "harvey/harvey-like_gifts.txt",
    "question": "What is the name of the mushroom Harvey likes?",
    "context": "harvey likes the following gifts: Chanterelle (A tasty mushroom with a fruity smell and slightly peppery flavor.), Common Mushroom (Slightly nutty, with good texture.), Daffodil (A traditional spring flower that makes a nice gift.), Dandelion (Not the prettiest flower, but the leaves make a good salad.), Duck Egg (It's still warm.), Duck Feather (It's so colorful.), Ginger (This sharp, spicy root is said to increase vitality.), Goat Milk (The milk of a goat.), Hazelnut (That's one big hazelnut!), Holly (The leaves and bright red berries make a popular winter decoration.), Large Goat Milk (A gallon of creamy goat's milk.), Leek (A tasty relative of the onion.), Magma Cap (A very rare mushroom that lives next to pools of lava.), Morel (Sought after for its unique nutty flavor.), Purple Mushroom (A rare mushroom found deep in caves.), Quartz (A clear crystal commonly found in caves and mines.), Snow Yam (This little yam was hiding beneath the snow.), Spring Onion (These grow wild during the spring.), Wild Horseradish (A spicy root found in the spring.), Winter Root (A starchy tuber.).",
    "answer_text": "Chanterelle",
    "answer_start": 34
  },
  {
    "id": "harvey/harvey-schedule_spring___spring_15__16_and_17__bus_service_restored_.txt",
    "question": "What time does Harvey board the bus to attend the desert festival?",
    "context": "On Spring → Spring 15, 16 and 17 (Bus Service Restored), At 8:20 AM, harvey boards bus to calico desert to attend the desert festival At 8:40 AM, harvey stands at the medical tent.",
    "answer_text": "8:20 AM",
    "answer_start": 60
  },
  {
    "id": "haley/haley-schedule_winter___winter_16.txt",
    "question": "How many hours does it take Haley to go to the night market?",
    "context": "On Winter → Winter 16, At 10:30 AM, haley wakes up and stands by her dresser in her bedroom At 11:30 AM, haley moves to the vanity in her bedroom At 12:00 PM, haley leaves her room to go to the kitchen At 4:30 PM, haley attends the night market At 12:00 AM, haley returns home.",
    "answer_text": "4:30 PM",
    "answer_start": 205
  },
  {
    "id": "shane/shane-schedule_marriage___monday.txt",
    "question": "How many hours does shane spend at home?",
    "context": "On Marriage → Monday, At 6:00 AM, shane at home At 9:30 AM, shane starts leaving home At 10:30 AM, shane arrives at marnie's ranch At 11:30 AM, shane leaves marnie's ranch At 11:50 AM, shane stands under big tree, north in cindersap forest At 05:00 PM, shane leaves big tree and heads home At 07:30 PM, shane arrives at home At 10:00 PM, shane goes to bed.",
    "answer_text": "Monday,",
    "answer_start": 14
  },
  {
    "id": "alex/alex-schedule_spring___desert_festival__as_vendor_.txt",
    "question": "How long does it take alex to board the bus to the desert?",
    "context": "On Spring → Desert Festival (As Vendor), At 11:10 AM, alex boards the bus to calico desert At 11:30 AM, alex arrives at his booth At 12:00 AM, alex leaves booth and boards bus back to the valley.",
    "answer_text": "11:10 AM",
    "answer_start": 44
  },
  {
    "id": "harvey/harvey-schedule_summer___friday.txt",
    "question": "What time does harvey work at the clinic's front desk?",
    "context": "On Summer → Friday, At 7:00 AM, harvey stands in front of refrigerator in his room At 8:30 AM, harvey works at the clinic's front desk At 12:00 PM, harvey goes to pierre's general store At 3:00 PM, harvey returns to his room above the clinic At 10:00 PM, harvey goes to bed.",
    "answer_text": "12:00 PM",
    "answer_start": 138
  },
  {
    "id": "elliott/elliott-schedule_spring___desert_festival__as_vendor_.txt",
    "question": "What time does elliott arrive at his booth?",
    "context": "On Spring → Desert Festival (As Vendor), At 11:10 AM, elliott boards the bus to calico desert At 11:30 AM, elliott arrives at his booth At 12:00 AM, elliott leaves booth and boards bus back to the valley.",
    "answer_text": "12:00 AM",
    "answer_start": 139
  },
  {
    "id": "shane/shane-schedule_winter___saturday.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Winter → Saturday, At 9:00 AM, shane leaves his room and stands in kitchen at marnie's ranch At 12:00 PM, shane leaves marnie's ranch and heads to pierre's general store At 5:00 PM, shane leaves pierre's general store and heads to the stardrop saloon At 11:00 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "12:00 PM",
    "answer_start": 99
  },
  {
    "id": "alex/alex-schedule_summer___rain.txt",
    "question": "How many hours does it take Alex to go stand by the dog pen?",
    "context": "On Summer → Rain, At 8:00 AM, alex leaves his room and stands in the entryway At 1:00 PM, alex goes to his room to lift weights At 4:00 PM, alex leaves his house to go stand by the dog pen At 6:30 PM, alex goes back into his house and stands in the entryway At 8:00 PM, alex goes to his room and stands by his dresser At 10:00 PM, alex goes to bed.",
    "answer_text": "4:00 PM",
    "answer_start": 131
  },
  {
    "id": "sam/sam-schedule_fall___monday_and_wednesday.txt",
    "question": "How many hours does sam work at jojamart?",
    "context": "On Fall → Monday and Wednesday, At 10:00 AM, sam wakes up and stands in the middle of his bedroom At 11:00 AM, sam leaves his bedroom and walks to jojamart (or museum if community center is restored) At 12:50 PM, sam arrives at jojamart (or museum if community center is restored) and starts work At 4:00 PM, sam finshes work at jojamart (or museum if community center is restored) and walks home At 6:00 PM, sam arrives in his bedroom and stands in front of his bookshelf At 9:30 PM, sam goes to bed.",
    "answer_text": "12:50 PM",
    "answer_start": 203
  },
  {
    "id": "sam/sam-schedule_marriage___monday.txt",
    "question": "What time does sam arrive at 1 willow lane?",
    "context": "On Marriage → Monday, At 6:00 AM, sam at home At 8:00 AM, sam leaves home and heads for pelican town At 9:30 AM, sam arrives at 1 willow lane and stands in the kitchen At 11:00 AM, sam moves to living room At 3:00 PM, sam leaves 1 willow lane to return home At 4:00 PM, sam arrives at the farmhouse At 10:00 PM, sam goes to bed.",
    "answer_text": "9:30 AM",
    "answer_start": 104
  },
  {
    "id": "sam/sam-schedule_fall___saturday.txt",
    "question": "How many hours does Sam spend hanging out in his room with Sebastian?",
    "context": "On Fall → Saturday, At 8:00 AM, sam wakes up for the day inside his bedroom and walks just outside to stand by the river in front of haley and emily's house At 11:00 AM, sam walks to a nearby bush and plays his handheld video game in town At 12:30 PM, sam leaves town, goes to his bedroom with sebastian to practice guitar At 3:00 PM, sam hangs out in his room with sebastian At 6:00 PM, sam leaves his home to walk to the river in front of his house with sebastian At 7:40 PM, sam returns to his bedroom to go to bed.",
    "answer_text": "3:00 PM",
    "answer_start": 326
  },
  {
    "id": "elliott/elliott-schedule_summer___summer_9.txt",
    "question": "When does elliott return home for the night?",
    "context": "On Summer → Summer 9, At 10:30 AM, elliott leaves his house and goes to the clinic At 1:30 PM, elliott moves from waiting room to examination room inside clinic At 4:00 PM, elliott leaves the clinic and returns home for the night.",
    "answer_text": "4:00 PM",
    "answer_start": 164
  },
  {
    "id": "sebastian/sebastian-schedule_winter___thursday__railroad_accessible_.txt",
    "question": "How many hours does sebastian spend smoking by the train station?",
    "context": "On Winter → Thursday (Railroad Accessible), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 2:00 PM, sebastian leaving home to go smoke by train station At 3:00 PM, sebastian smoking by the train station At 6:20 PM, sebastian standing east of train station, by tunnel At 8:10 PM, sebastian standing west of train station, by tunnel At 9:30 PM, sebastian heads home At 10:20 PM, sebastian arrives home.",
    "answer_text": "3:00 PM",
    "answer_start": 209
  },
  {
    "id": "penny/penny-schedule_winter___regular_schedule.txt",
    "question": "How many hours does it take to wake up and move around her trailer?",
    "context": "On Winter → Regular Schedule, At 9:00 AM, penny wakes up and moves around her trailer At 10:30 AM, penny leaves her trailer and walks to the tree west of the graveyard to read At 6:00 PM, penny leaves the museum and returns to the trailer to do dishes At 9:00 PM, penny goes to bed in her room in the trailer for the evening.",
    "answer_text": "9:00 AM",
    "answer_start": 33
  },
  {
    "id": "sebastian/sebastian-schedule_summer___thursday__railroad_accessible_.txt",
    "question": "How many hours does sebastian spend smoking by the train station?",
    "context": "On Summer → Thursday (Railroad Accessible), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 2:00 PM, sebastian leaving home to go smoke by train station At 3:00 PM, sebastian smoking by the train station At 6:20 PM, sebastian standing east of train station, by tunnel At 8:10 PM, sebastian standing west of train station, by tunnel At 9:30 PM, sebastian heads home At 10:20 PM, sebastian arrives home.",
    "answer_text": "3:00 PM",
    "answer_start": 209
  },
  {
    "id": "abigail/abigail-schedule_fall___fall_11_and_25__no_player_has_6_hearts_with_sebastian_or_abigail_.txt",
    "question": "How many hours does it take for Abigail to return home?",
    "context": "On Fall → Fall 11 and 25 (No player has 6 hearts with Sebastian or Abigail), At 9:00 AM, abigail in bed At 10:30 AM, abigail leaves pierre's store At 12:00 PM, abigail arrives in sebastian’s room At 5:00 PM, abigail leaves sebastian’s room At 6:30 PM, abigail returns home At 6:50 PM, abigail back in room.",
    "answer_text": "6:50 PM",
    "answer_start": 276
  },
  {
    "id": "penny/penny-schedule_spring___monday__thursday_and_sunday.txt",
    "question": "How many hours does it take to leave the trailer for the evening?",
    "context": "On Spring → Monday, Thursday and Sunday, At 8:00 AM, penny leaves her trailer and goes outside to read near the graveyard At 12:30 PM, penny returns to the trailer to wash dishes At 4:00 PM, penny leaves the trailer again to go outside the saloon where she sits on a bench with maru At 6:40 PM, penny returns to her trailer for the evening.",
    "answer_text": "6:40 PM",
    "answer_start": 286
  },
  {
    "id": "sam/sam-heart_event_six_hearts.txt",
    "question": "What is the condition of Six Hearts if it is not raining?",
    "context": "At Six Hearts, if the condition \"On any day when it's not raining, enter the town between noon and 4pm.\" is met, the event is as follows: Sam is skateboarding and grinding on Emily and Haley's flower box. Lewis catches him and scolds him for it. Lewis asks for your opinion. \"You're right, sir. Sam should respect private property.\" (No effect on friendship .) Sam is unhappy, but obliges and says he'll just not skateboard ever again. \"Don't blame Sam. There's nowhere else to ride!\" (No effect on friendship .) Sam seems happy and agrees. Mayor Lewis becomes frustrated and states that he thought you were more mature than that but afterwards apologizes to Sam and asks him to be more careful in the future. \"I'm staying out of this.\" (No effect on friendship .) Mayor Lewis says he doesn't want to see Sam doing it again, Sam agrees and the Mayor leaves. Then Sam turns to you and, with a smile, asks if you saw his rad trick.",
    "answer_text": "enter the town between noon and 4pm",
    "answer_start": 67
  },
  {
    "id": "haley/haley-like_gifts.txt",
    "question": "What is the name of the flower that Haley likes?",
    "context": "haley likes the following gifts: Daffodil (A traditional spring flower that makes a nice gift.).",
    "answer_text": "Daffodil",
    "answer_start": 33
  },
  {
    "id": "emily/emily-schedule_marriage___friday.txt",
    "question": "What time does emily leave pierre's general store?",
    "context": "On Marriage → Friday, At 8:30 AM, emily leaves house to go to docks west of fish shop At 1:00 PM, emily leaves beach to go to pierre's general store At 3:00 PM, emily leaves pierre's to go to work at the stardrop saloon At 10:00 PM, emily leaves the saloon to return home.",
    "answer_text": "3:00 PM",
    "answer_start": 152
  },
  {
    "id": "sam/sam-schedule_fall___fall_11.txt",
    "question": "How many hours does sam spend in the waiting room?",
    "context": "On Fall → Fall 11, At 10:00 AM, sam wakes up for the day inside his bedroom. \"i gotta go visit uncle doctor today... great.\" At 11:30 AM, sam walks to the clinic for his annual checkup, plays his handheld video game in the waiting room At 1:30 PM, sam gets medical checkup at the clinic. \"i'm a healthy boy, doc. can i go now? this is boring.\" At 4:00 PM, sam leaves the clinic to walk into town. \"i just got out of the doctor's office. completely healthy and vigorous, just as i expected.\" At 9:00 PM, sam returns to his bedroom to go to bed.",
    "answer_text": "11:30 AM",
    "answer_start": 128
  },
  {
    "id": "leah/leah-heart_event_two_hearts.txt",
    "question": "What is Leah's occupation?",
    "context": "At Two Hearts, if the condition \"EnterLeah's Cottagewhen she's there.\" is met, the event is as follows: You see her working on a sculpture. She discusses sculpting with you, and says \"Once you get past the outer layers, the true nature starts to show...\" \"It's the same with people.\" (No effect on friendship .) she agrees and says \"Oh! yeah, that's absolutely right!\" \"I actually prefer the look of raw, unadulterated wood.\" (No effect on friendship .) She says that there's nothing wrong with that and that she thinks there's lots of beauty to be found in raw untouched nature. She goes on to say as a human, she is interested in how we shape and interpret the world around us, she explains this as she is interested in 'art'. \"(creepy) May I have a kiss?\" (-100 friendship .) If the farmer is male, she calls you a pig, hits you with a hammer and kicks you out. The scene ends. Otherwise, she acts surprised, saying \"Oh! you're...? (blushing) Me too. That's good to know\". Regardless of her blushing, she will hit you with her hammer and kick you out. The scene ends. WARNING: if you choose this option, you can never see Leah's 8-Heart event. Because you were creepy and missed the chance to make a suggestion for her art career, it will not be possible to trigger either version of her 8-Heart event in the future. She continues, \"Although, I have to admit... It's not easy to pay the bills as an artist.\" \"Why don't you have an art show in town?\" (No effect on friendship .) She muses that it could help make Pelican Town a true art destination, but says she'd be crushed if nobody liked her sculptures. She says she'll think about it, and thanks you for stopping by. If you choose this option, then immediately talk to Leah after the cutscene, she'll say \"An art show for the whole village? That's a bold idea, (Name).\" \"Why don't you sell your art on the internet?\" (No effect on friendship .) She notes that she would need a computer for that, but that they are expensive. She says she'll think about it, and thanks you for stopping by.",
    "answer_text": "artist.",
    "answer_start": 1402
  },
  {
    "id": "penny/penny-schedule_winter___rain__option_1_.txt",
    "question": "How many hours does it take Penny to go to bed?",
    "context": "On Winter → Rain (Option 1), At 9:00 AM, penny in her bedroom in the trailer At 11:00 AM, penny moves to the kitchen At 1:00 PM, penny does some dishes At 3:00 PM, penny sits on the couch, probably watching tv At 6:00 PM, penny returns to her bedroom, reading by the bookshelf At 9:00 PM, penny goes to bed for the evening.",
    "answer_text": "evening.",
    "answer_start": 315
  },
  {
    "id": "elliott/elliott-schedule_summer___friday_and_sunday.txt",
    "question": "When does elliott leave his cabin to stand on the beach?",
    "context": "On Summer → Friday and Sunday, At 8:00 AM, elliott at home At 12:00 PM, elliott leaves his cabin to stand on the beach south of his house At 1:30 PM, elliott leaves the beach and returns to his cabin At 3:00 PM, elliott leaves his cabin to stand on the bridge just north of the beach At 6:00 PM, elliott leaves the bridge to return home for the night.",
    "answer_text": "1:30 PM",
    "answer_start": 141
  },
  {
    "id": "sebastian/sebastian-schedule_spring___rain__option_2_.txt",
    "question": "What time does sebastian get out of bed and moves to his computer?",
    "context": "On Spring → Rain (Option 2), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaving house to go to the saloon At 5:20 PM, sebastian at the saloon, standing by red sofa in arcade At 9:10 PM, sebastian heads home At 11:10 PM, sebastian arrives home.",
    "answer_text": "10:30 AM",
    "answer_start": 65
  },
  {
    "id": "alex/alex-schedule_fall___regular_schedule.txt",
    "question": "How many hours does it take alex to go outside and stand beneath nearby tree?",
    "context": "On Fall → Regular Schedule, At 8:00 AM, alex leaves his room to go outside and stand beneath nearby tree At 1:00 PM, alex goes to his room to lift weights At 4:00 PM, alex leaves his house to go stand by the dog pen At 6:30 PM, alex goes back into his house and stands in the entryway At 8:00 PM, alex goes to his room and stands by his dresser At 10:00 PM, alex goes to bed.",
    "answer_text": "8:00 AM",
    "answer_start": 31
  },
  {
    "id": "emily/emily-dislike_gifts.txt",
    "question": "Which of the following is not a season or event name?",
    "context": "emily dislikes the following gifts: Fried Eel (Greasy but flavorful.), Ice Cream (It's hard to find someone who doesn't like this.), Rice Pudding (It's creamy, sweet, and fun to eat.), Salmonberry (A spring-time berry with the flavor of the forest.), Spicy Eel (It's really spicy! Be careful.).",
    "answer_text": "emily",
    "answer_start": 0
  },
  {
    "id": "abigail/abigail-schedule_fall___friday.txt",
    "question": "How many hours does abigail spend in the stardrop saloon?",
    "context": "On Fall → Friday, At 9:00 AM, abigail leaving her room to go to the kitchen At 11:00 AM, abigail leaves the kitchen to stand in pierre's general store At 3:00 PM, abigail leaving pierre's general store to go to the stardrop saloon At 3:50 PM, abigail in the stardrop saloon, sitting on a sofa in the arcade At 9:00 PM, abigail heads home At 9:40 PM, abigail arrives home.",
    "answer_text": "3:50 PM",
    "answer_start": 234
  },
  {
    "id": "sebastian/sebastian-love_gifts.txt",
    "question": "What is the name of the gift that Sebastian loves?",
    "context": "sebastian loves the following gifts: Frog Egg (Summons a hungry frog companion.), Frozen Tear (A crystal fabled to be the frozen tears of a yeti.), Obsidian (A volcanic glass that forms when lava cools rapidly.), Pumpkin Soup (A seasonal favorite.), Sashimi (Raw fish sliced into thin pieces.), Void Egg (A jet-black egg with red flecks. It's warm to the touch.).",
    "answer_text": "Frog Egg",
    "answer_start": 37
  },
  {
    "id": "sebastian/sebastian-schedule_summer___rain__option_1_.txt",
    "question": "What time does sebastian get out of bed and leaves the house?",
    "context": "On Summer → Rain (Option 1), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and leaves house to go to the beach At 1:30 PM, sebastian standing at the end of long pier to the left of the fish shop At 5:00 PM, sebastian leaves the pier to go home At 7:40 PM, sebastian arrives home and goes to bed.",
    "answer_text": "10:30 AM",
    "answer_start": 65
  },
  {
    "id": "leah/leah-love_gifts.txt",
    "question": "What is the name of the gift leah loves?",
    "context": "leah loves the following gifts: Goat Cheese (Soft cheese made from goat's milk.), Poppyseed Muffin (It has a soothing effect.), Salad (A healthy garden salad.), Stir Fry (Julienned vegetables on a bed of rice.), Truffle (A gourmet type of mushroom with a unique taste.), Vegetable Medley (This is very nutritious.), Wine (Drink in moderation.).",
    "answer_text": "Goat Cheese",
    "answer_start": 32
  },
  {
    "id": "haley/haley-schedule_summer___wednesday__any_player_has_at_least_6_hearts_with_alex_.txt",
    "question": "How many hours does it take to go to the fountain?",
    "context": "On Summer → Wednesday (Any player has at least 6 hearts with Alex), At 9:00 AM, haley in her room At 11:00 AM, haley leaving home to go to the fountain At 12:20 PM, haley by the fountain, west of community center At 4:30 PM, haley heads home At 5:50 PM, haley at home, cooking dinner At 8:20 PM, haley in her room At 10:30 PM, haley goes to bed.",
    "answer_text": "12:20 PM",
    "answer_start": 155
  },
  {
    "id": "sebastian/sebastian-schedule_fall___thursday__railroad_accessible_.txt",
    "question": "How many hours does sebastian spend smoking by the train station?",
    "context": "On Fall → Thursday (Railroad Accessible), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 2:00 PM, sebastian leaving home to go smoke by train station At 3:00 PM, sebastian smoking by the train station At 6:20 PM, sebastian standing east of train station, by tunnel At 8:10 PM, sebastian standing west of train station, by tunnel At 9:30 PM, sebastian heads home At 10:20 PM, sebastian arrives home.",
    "answer_text": "3:00 PM",
    "answer_start": 207
  },
  {
    "id": "sam/sam-dislike_gifts.txt",
    "question": "What is the name of Sam's favorite flower?",
    "context": "sam dislikes the following gifts: Chanterelle (A tasty mushroom with a fruity smell and slightly peppery flavor.), Common Mushroom (Slightly nutty, with good texture.), Daffodil (A traditional spring flower that makes a nice gift.), Dandelion (Not the prettiest flower, but the leaves make a good salad.), Ginger (This sharp, spicy root is said to increase vitality.), Hazelnut (That's one big hazelnut!), Holly (The leaves and bright red berries make a popular winter decoration.), Leek (A tasty relative of the onion.), Magma Cap (A very rare mushroom that lives next to pools of lava.), Morel (Sought after for its unique nutty flavor.), Purple Mushroom (A rare mushroom found deep in caves.), Quartz (A clear crystal commonly found in caves and mines.), Salmonberry (A spring-time berry with the flavor of the forest.), Seaweed (It can be used in cooking.), Snow Yam (This little yam was hiding beneath the snow.), Wild Horseradish (A spicy root found in the spring.), Winter Root (A starchy tuber.).",
    "answer_text": "Daffodil",
    "answer_start": 169
  },
  {
    "id": "sebastian/sebastian-schedule_fall___regular_schedule.txt",
    "question": "What time does sebastian get out of bed?",
    "context": "On Fall → Regular Schedule, At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 12:00 PM, sebastian leaves home and walks to lake next to his house At 2:00 PM, sebastian goes to the part of the lake outside the mines entrance At 3:00 PM, sebastian leaves the mines entrance and heads to the other side of the lake At 3:30 PM, sebastian is smoking at the edge of the lake close to the bridge At 4:00 PM, sebastian returns home to his kitchen At 5:30 PM, sebastian leaves his kitchen At 6:00 PM, sebastian on his computer At 9:30 PM, sebastian leaves his computer and goes to bed.",
    "answer_text": "10:30 AM",
    "answer_start": 64
  },
  {
    "id": "alex/alex-schedule_marriage___monday.txt",
    "question": "How many hours does it take alex to go to bed?",
    "context": "On Marriage → Monday, At 8:30 AM, alex leaves farm to visit his grandparents At 6:00 PM, alex heads back to farm At 10:00 PM, alex goes to bed.",
    "answer_text": "10:00 PM",
    "answer_start": 116
  },
  {
    "id": "elliott/elliott-schedule_fall___regular_schedule.txt",
    "question": "How many hours does elliott spend at home?",
    "context": "On Fall → Regular Schedule, At 8:00 AM, elliott at home At 11:30 AM, elliott leaves home, heads to the library At 5:30 PM, elliott leaves the library to return home for the night At 6:40 PM, elliott returns home and stands by his bonsai tree At 9:00 PM, elliott leaves his bonsai tree and walks over to his writing desk.",
    "answer_text": "8:00 AM",
    "answer_start": 31
  },
  {
    "id": "shane/shane-schedule_marriage___spring_17__bus_service_restored_.txt",
    "question": "When does shane boards the bus back to the valley?",
    "context": "On Marriage → Spring 17 (Bus Service Restored), At 8:00 AM, shane walks to the desert festival and stands by the chef stand At 12:30 AM, shane boards the bus back to the valley.",
    "answer_text": "12:30 AM",
    "answer_start": 127
  },
  {
    "id": "elliott/elliott-schedule_winter___rain.txt",
    "question": "What is the name of Elliott's house?",
    "context": "On Winter → Rain, At All day, elliott inside his house.",
    "answer_text": "elliott",
    "answer_start": 30
  },
  {
    "id": "abigail/abigail-heart_event_ten_hearts.txt",
    "question": "How many friendships does Abigail have?",
    "context": "At Ten Hearts, if the condition \"Enterthe minesor theQuarry Mine(or ascend from a lower floor of the mines) between 5pm and midnight. The event won't trigger if you've already given her theMermaid's Pendant.\" is met, the event is as follows: Abigail is preparing to go down the ladder into the mine when she's startled by a bat flying up into her face. She laughs it off and looks back down the hole. Hundreds more bats fly up and she's terrified, running to cower in the corner of the cave. You rush in to comfort her. \"What happened?\" (+20 friendship .) \"Are you okay?\" (+40 friendship .) She tells you that maybe she isn't as tough as she thought. \"You're safe with me.\" (+20 friendship .) \"I get scared too.\" (+40 friendship .) \"You're crying like a little baby. Stop.\" (-50 friendship .) She confesses that she likes you as more than a friend, and asks you to stay with her there. She hugs you. If your character is a girl, she will also state that she didn't know she liked other girls until she met you.",
    "answer_text": "50 friendship",
    "answer_start": 776
  },
  {
    "id": "sebastian/sebastian-schedule_summer___regular_schedule.txt",
    "question": "What time does sebastian get out of bed and moves to his computer?",
    "context": "On Summer → Regular Schedule, At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaves his computer and goes to the kitchen At 3:30 PM, sebastian leaves the kitchen to go back to his room At 4:10 PM, sebastian on his computer At 6:30 PM, sebastian leaves home and walks to lake next to his house to smoke At 7:30 PM, sebastian smoking by the lake next to his house At 9:30 PM, sebastian goes back to his house.",
    "answer_text": "10:30 AM",
    "answer_start": 66
  },
  {
    "id": "haley/haley-schedule_winter___rain.txt",
    "question": "What time does Haley wake up and stand by her dresser in her bedroom?",
    "context": "On Winter → Rain, At 10:30 AM, haley wakes up and stands by her dresser in her bedroom At 11:30 AM, haley moves to the vanity in her bedroom At 12:00 PM, haley leaves her room to go to the kitchen At 4:00 PM, haley returns to her room At 7:00 PM, haley leaves her room and stands in the living room At 10:00 PM, haley goes to bed.",
    "answer_text": "10:30 AM",
    "answer_start": 21
  },
  {
    "id": "harvey/harvey-heart_event_two_hearts.txt",
    "question": "How many friendships does Harvey have with George's wife?",
    "context": "At Two Hearts, if the condition \"EnterGeorge's housewhileGeorgeis there.\" is met, the event is as follows: Harvey is performing a private check-up on George. He tries to explain that George needs to make some lifestyle changes if he wants to keep healthy, but George seems irritated with his advice and states that he knows what's best for his own body. Harvey explains that he went to school for eight years so that he could help people in an attempt to get George to cooperate, but then his attention is drawn away as he notices your arrival. Harvey says you shouldn't be there because it is a private session, but George stops you from leaving by asking for a second opinion on the matter. \"George should follow Dr. Harvey's advice.\" (+40 friendship .) He again says that he's only trying to help and George finally gives in and agrees to follow doctor's orders. After that Harvey thanks you for the help and say that he appreciates you. \"George knows what's best for his own body.\" (-40 friendship .) He sighs and tells George that if he's going to behave like this, Harvey will have to tell George's wife and she won't be happy. George begrudgingly concedes to the doctor's orders. Harvey tells you that it's better not to give patients mixed messages.",
    "answer_text": "40 friendship",
    "answer_start": 739
  },
  {
    "id": "maru/maru-schedule_winter___monday_and_sunday.txt",
    "question": "How many hours does it take for maru to leave room?",
    "context": "On Winter → Monday and Sunday, At 10:00 AM, maru leaves room At 10:20 AM, maru in lab at home At 1:30 PM, maru leaves lab at home At 3:30 PM, maru sits down on bench north of graveyard At 6:30 PM, maru gets up from bench and walks home At 8:00 PM, maru returns home.",
    "answer_text": "10:20 AM",
    "answer_start": 64
  },
  {
    "id": "abigail/abigail-schedule_marriage___friday.txt",
    "question": "What time does abigail arrive home?",
    "context": "On Marriage → Friday, At 6:00 AM, abigail at home At 8:30 AM, abigail heads to pierre's general store and stands in the kitchen At 11:00 AM, abigail walking to the mountain At 11:40 AM, abigail west side of the mountain lake At 3:00 PM, abigail walking to the stardrop saloon At 5:30 PM, abigail in the stardrop saloon, sitting on a sofa in the arcade At 8:30 PM, abigail walking home At 10:00 PM, abigail arrives home At 10:30 PM, abigail at home in bed.",
    "answer_text": "10:30 PM",
    "answer_start": 422
  },
  {
    "id": "emily/emily-like_gifts.txt",
    "question": "What is the name of the gift that Emily likes?",
    "context": "emily likes the following gifts: Daffodil (A traditional spring flower that makes a nice gift.), Quartz (A clear crystal commonly found in caves and mines.).",
    "answer_text": "Daffodil",
    "answer_start": 33
  },
  {
    "id": "sebastian/sebastian-schedule_winter___friday.txt",
    "question": "How many hours does sebastian spend in the saloon?",
    "context": "On Winter → Friday, At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaves his room to go play pool with sam at the saloon At 5:20 PM, sebastian in the saloon, playing pool with sam At 9:10 PM, sebastian heads home At 11:10 PM, sebastian arrives home.",
    "answer_text": "5:20 PM",
    "answer_start": 198
  },
  {
    "id": "harvey/harvey-schedule_fall___regular_schedule.txt",
    "question": "When does harvey work at the clinic's front desk?",
    "context": "On Fall → Regular Schedule, At 7:00 AM, harvey stands in front of refrigerator in his room At 8:30 AM, harvey works at the clinic's front desk At 12:00 PM, harvey walks into town, stands by tree west of bridge to the beach At 5:00 PM, harvey returns to his room, sits in front of radio At 10:00 PM, harvey goes to bed.",
    "answer_text": "12:00 PM",
    "answer_start": 146
  },
  {
    "id": "shane/shane-schedule_summer___monday_-_friday__community_center_not_restored_.txt",
    "question": "What time does shane leave jojamart?",
    "context": "On Summer → Monday - Friday (Community Center Not Restored), At 7:10 AM, shane leaves marnie's ranch and heads to jojamart At 5:00 PM, shane leaves jojamart and heads for the stardrop saloon At 11:10 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "5:00 PM",
    "answer_start": 126
  },
  {
    "id": "alex/alex-heart_event_two_hearts.txt",
    "question": "What is the condition of visitthe Beachwhen Alex is there.?",
    "context": "At Two Hearts, if the condition \"On a sunnySummerday, visitthe Beachwhen Alex is there.\" is met, the event is as follows: You see Alex with his gridball. He greets you and tries to toss you the gridball. You fail to catch it. He laughs and says it was a nice try. He goes on to tell you he's sure that he's going to become the first professional gridball player from Stardew Valley. He asks you what you think his chances are. \"I believe in you!\" (No effect on friendship .) Alex thanks you for your support and says that he'll remember it. \"Wow, you're really arrogant.\" (No effect on friendship .) Alex says you're just a little jealous and leaves.",
    "answer_text": "sunnySummerday",
    "answer_start": 38
  },
  {
    "id": "shane/shane-schedule_summer___green_rain__year_1_.txt",
    "question": "What is the name of the character that shanes in the kitchen?",
    "context": "On Summer → Green Rain (Year 1), At All day, shane in the kitchen.",
    "answer_text": "shane",
    "answer_start": 45
  },
  {
    "id": "maru/maru-schedule_spring___regular_schedule.txt",
    "question": "What time does maru go to bed?",
    "context": "On Spring → Regular Schedule, At 9:00 AM, maru in her room At 10:20 AM, maru in the lab At 2:00 PM, maru heads to bench east of the community center At 3:00 PM, maru sitting on bench east of the community center At 6:00 PM, maru heads home At 7:00 PM, maru at home, in her room At 10:00 PM, maru goes to bed.",
    "answer_text": "10:00 PM",
    "answer_start": 281
  },
  {
    "id": "shane/shane-schedule_winter___sunday.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Winter → Sunday, At 12:30 PM, shane in kitchen at marnie's ranch At 6:00 PM, shane leaves marnie's ranch and heads to the stardrop saloon At 12:00 AM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "6:00 PM",
    "answer_start": 71
  },
  {
    "id": "alex/alex-neutral_gifts.txt",
    "question": "Who neutralizes the following gifts: Chanterelle, Common Mushroom, Daffodil, Dandelion, Frog Egg, Ginger, Hazelnut, Leek, Magma Cap, Morel, Winter Root?",
    "context": "alex neutrals the following gifts: Chanterelle (A tasty mushroom with a fruity smell and slightly peppery flavor.), Common Mushroom (Slightly nutty, with good texture.), Daffodil (A traditional spring flower that makes a nice gift.), Dandelion (Not the prettiest flower, but the leaves make a good salad.), Frog Egg (Summons a hungry frog companion.), Ginger (This sharp, spicy root is said to increase vitality.), Hazelnut (That's one big hazelnut!), Leek (A tasty relative of the onion.), Magma Cap (A very rare mushroom that lives next to pools of lava.), Morel (Sought after for its unique nutty flavor.), Purple Mushroom (A rare mushroom found deep in caves.), Snow Yam (This little yam was hiding beneath the snow.), Winter Root (A starchy tuber.).",
    "answer_text": "alex",
    "answer_start": 0
  },
  {
    "id": "maru/maru-heart_event_six_hearts.txt",
    "question": "What is the name of Maru's telescope?",
    "context": "At Six Hearts, if the condition \"Enterthe mountainon a sunny day, between 9pm and 11:40pm.\" is met, the event is as follows: You see Maru looking through her telescope. She's surprised to see you out so late, and says she wants to show you something. You look through her telescope and she asks what you see. \"A beautiful planet.\" (+30 friendship .) Maru responds, \"It's amazing, isn't it?\" \"A cold, dark abyss.\" (-30 friendship .) Maru responds, \"I guess you could see it like that... But it's still grand, isn't it?\" Maru says that by the time any of these stars are visited, you'll both be long gone. \"I guess that's the trouble with being human, huh?\" She begins to tell you something, then changes her mind and shows you a binary star system instead. The cutscene ends as your character thinks, \"What a beautiful night! Maru showed me something new...\"",
    "answer_text": "the mountainon",
    "answer_start": 38
  },
  {
    "id": "sam/sam-heart_event_two_hearts.txt",
    "question": "What does Sam ask Sebastian if he's on board with?",
    "context": "At Two Hearts, if the condition \"Enter Sam's house when he's there.\" is met, the event is as follows: Sam and Sebastian are jamming out in Sam's room. Sam tells you he's trying to get a band together, but he's unsure what style of music to play. He asks what music you like. \"Cheerful pop music.\" (No effect on friendship .) \"Experimental noise rock.\" (No effect on friendship .) \"Hi-Energy dance music.\" (No effect on friendship .) \"Honky-tonky country music.\" (No effect on friendship .) No matter which style you pick, Sam says that's the style he's been thinking about for the band. He asks Sebastian if he's on board too. Sebastian agrees and Sam thanks you. Note that if you skip this cutscene, Sam's 8-heart cutscene will play cheerful pop music.",
    "answer_text": "cheerful pop music",
    "answer_start": 734
  },
  {
    "id": "leah/leah-schedule_fall___monday.txt",
    "question": "What time does leah go to shop at pierre's general store?",
    "context": "On Fall → Monday, At 9:00 AM, leah sculpts in her cottage At 11:00 AM, leah goes to shop at pierre's general store At 5:00 PM, leah leaves the store to return home and stand in front of her bookcase At 10:00 PM, leah stands at the table in her house At 12:00 AM, leah goes to bed for the night.",
    "answer_text": "11:00 AM",
    "answer_start": 61
  },
  {
    "id": "sam/sam-schedule_spring___desert_festival__as_vendor_.txt",
    "question": "What time does sam board the bus to calico desert?",
    "context": "On Spring → Desert Festival (As Vendor), At 11:10 AM, sam boards the bus to calico desert At 11:30 AM, sam arrives at his booth At 12:00 AM, sam leaves booth and takes bus back to the valley.",
    "answer_text": "11:10 AM",
    "answer_start": 44
  },
  {
    "id": "sam/sam-schedule_spring___monday_and_wednesday.txt",
    "question": "How many hours does sam work at jojamart?",
    "context": "On Spring → Monday and Wednesday, At 10:00 AM, sam wakes up and stands in the middle of his bedroom At 11:00 AM, sam leaves his bedroom and walks to jojamart (or museum if community center is restored) At 12:50 PM, sam arrives at jojamart (or museum if community center is restored) and starts work At 4:00 PM, sam finshes work at jojamart (or museum if community center is restored) and walks home At 6:00 PM, sam arrives in his bedroom and stands in front of his bookshelf At 9:30 PM, sam goes to bed.",
    "answer_text": "12:50 PM",
    "answer_start": 205
  },
  {
    "id": "maru/maru-schedule_winter___winter_16.txt",
    "question": "How many hours does it take for maru to leave her room?",
    "context": "On Winter → Winter 16, At 9:00 AM, maru leaves her room At 9:20 AM, maru in lab at home At 11:00 AM, maru goes to her room At 3:40 PM, maru leaves home to attend night market At 11:30 PM, maru leaves night market to return home.",
    "answer_text": "3:40 PM",
    "answer_start": 126
  },
  {
    "id": "penny/penny-heart_event_four_hearts.txt",
    "question": "What is the condition of entering the trailer when Penny's home?",
    "context": "At Four Hearts, if the condition \"Enter thetrailerwhen she's home.\" is met, the event is as follows: Penny complains about how messy the place is, and asks if you could help her clean up. As you do so, Pam returns home and yells at Penny for letting someone else clean her home. Pam eventually asks you to leave, and they continue their discussion privately. Pam admits that she's embarrassed to have strangers clean up the house. The next day, you get a letter of apology from Penny.",
    "answer_text": "thetrailer",
    "answer_start": 40
  },
  {
    "id": "leah/leah-schedule_marriage___green_rain__year_1_.txt",
    "question": "How many hours does it take for leah to walk to her cottage?",
    "context": "On Marriage → Green Rain (Year 1), At 6:10 AM, leah leaves home to walk to her cottage and stand outside At 1:00 PM, leah stands in her cottage, next to her bed At 10:00 PM, leah in bed in her cottage.",
    "answer_text": "6:10 AM",
    "answer_start": 38
  },
  {
    "id": "shane/shane-schedule_summer___sunday.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Summer → Sunday, At 12:30 PM, shane in kitchen at marnie's ranch At 6:00 PM, shane leaves marnie's ranch and heads to the stardrop saloon At 12:00 AM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "6:00 PM",
    "answer_start": 71
  },
  {
    "id": "haley/haley-schedule_winter___wednesday__any_player_has_at_least_6_hearts_with_alex_.txt",
    "question": "How many hours does it take to go to the fountain?",
    "context": "On Winter → Wednesday (Any player has at least 6 hearts with Alex), At 9:00 AM, haley in her room At 11:00 AM, haley leaving home to go to the fountain At 12:20 PM, haley by the fountain, west of community center At 4:30 PM, haley heads home At 5:50 PM, haley at home, cooking dinner At 8:20 PM, haley in her room At 10:30 PM, haley goes to bed.",
    "answer_text": "12:20 PM",
    "answer_start": 155
  },
  {
    "id": "leah/leah-schedule_winter___monday.txt",
    "question": "What time does leah go to shop at pierre's general store?",
    "context": "On Winter → Monday, At 9:00 AM, leah sculpts in her cottage At 11:00 AM, leah goes to shop at pierre's general store At 5:00 PM, leah leaves the store to return home and stand in front of her bookcase At 10:00 PM, leah stands at the table in her house At 12:00 AM, leah goes to bed for the night.",
    "answer_text": "11:00 AM",
    "answer_start": 63
  },
  {
    "id": "shane/shane-schedule_summer___sunday__alex_s_14_heart_event_seen_.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Summer → Sunday (Alex's 14 heart event seen), At 7:00 AM, shane leaves his room and stands in kitchen at marnie's ranch At 10:00 AM, shane leaves marnie's ranch and heads to the back room of the stardrop saloon At 3:00 PM, shane moves to his spot next to the fireplace At 12:00 AM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "10:00 AM",
    "answer_start": 126
  },
  {
    "id": "penny/penny-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the player does not have a Rabbit's Foot in inventory?",
    "context": "At Group Ten-Heart Event, if the condition \"If the player is unmarried and has given a bouquet to all available bachelorettes, raisedfriendshipwith each bachelorette to 10 hearts, and seen each bachelorette's 10-heart event, then enteringHaley/Emily's Housewill trigger a cutscene. IfHaleyis the final bachelorette you share a Ten-Heart Event with, the Group Ten-Heart Event will be unavoidable as it is triggered immediately afterwards.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a gossip session about Mayor Lewis and Marnie 's relationship. If the player does not have a Rabbit's Foot in inventory, all bachelorettes will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelorettes will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelorettes will forgive the player, and dialogues return to normal.",
    "answer_text": "all bachelorettes will express anger about the player dating them all at one time",
    "answer_start": 670
  },
  {
    "id": "harvey/harvey-schedule_marriage___monday.txt",
    "question": "What is the name of the community center that harvey walks to?",
    "context": "On Marriage → Monday, At 8:30 AM, harvey leaves the farmhouse and heads to pierre's general store At 12:00 PM, harvey walks to fountain left of community center At 5:00 PM, harvey leaves town and heads home to the farm.",
    "answer_text": "fountain left",
    "answer_start": 127
  },
  {
    "id": "haley/haley-schedule_fall___rain.txt",
    "question": "What time does Haley wake up and stands by her dresser in her bedroom?",
    "context": "On Fall → Rain, At 10:30 AM, haley wakes up and stands by her dresser in her bedroom At 11:30 AM, haley moves to the vanity mirror in her bedroom At 12:00 PM, haley leaves her room to go to the kitchen At 4:00 PM, haley returns to her room At 7:00 PM, haley leaves her room and stands in the living room At 10:00 PM, haley goes to bed.",
    "answer_text": "10:30 AM",
    "answer_start": 19
  },
  {
    "id": "abigail/abigail-schedule_winter___winter_11_and_25.txt",
    "question": "What time does abigail go to bed?",
    "context": "On Winter → Winter 11 and 25, At 9:00 AM, abigail leaves her room to go to the kitchen At 10:30 AM, abigail leaves the kitchen to stand in pierre's store At 1:00 PM, abigail leaves the house to go to stand on bridge near jojamart At 1:30 PM, abigail standing on the bridge near jojamart At 4:30 PM, abigail heads home At 5:20 PM, abigail in her room, playing video games At 7:30 PM, abigail goes to bed.",
    "answer_text": "7:30 PM",
    "answer_start": 374
  },
  {
    "id": "abigail/abigail-schedule_summer___summer_6_and_16.txt",
    "question": "What time does abigail arrive at home?",
    "context": "On Summer → Summer 6 and 16, At 9:00 AM, abigail leaving her room to go to the kitchen At 10:30 AM, abigail leaves the kitchen to stand in pierre's general store At 3:00 PM, abigail goes to the mountain, standing on the southwest corner of the lake, playing the flute At 8:00 PM, abigail heads home to go to bed At 9:40 PM, abigail arrives at home.",
    "answer_text": "9:40 PM",
    "answer_start": 315
  },
  {
    "id": "abigail/abigail-schedule_summer___rain__option_2_.txt",
    "question": "When does abigail go to bed?",
    "context": "On Summer → Rain (Option 2), At 9:00 AM, abigail leaving her room to go to the kitchen At 11:00 AM, abigail leaves the kitchen to stand in pierre's general store At 2:00 PM, abigail leaving the house to go to the stardrop saloon At 2:50 PM, abigail in the stardrop saloon, sitting on a sofa in the arcade At 9:00 PM, abigail heads home At 10:00 PM, abigail goes to bed.",
    "answer_text": "10:00 PM",
    "answer_start": 339
  },
  {
    "id": "sam/sam-schedule_spring___spring_15__bus_service_restored_.txt",
    "question": "What time does Sam boards the bus back to the valley?",
    "context": "On Spring → Spring 15 (Bus Service Restored), At 9:50 AM, sam boards the bus to calico desert to attend the desert festival At 10:40 AM, sam stands west of the pond near the cactus stand At 12:50 AM, sam boards the bus back to the valley.",
    "answer_text": "12:50 AM",
    "answer_start": 190
  },
  {
    "id": "alex/alex-schedule_marriage___green_rain__year_1_.txt",
    "question": "How long does it take Alex to walk to his grandparents' house?",
    "context": "On Marriage → Green Rain (Year 1), At 6:10 AM, alex leaves home to walk to his grandparents' house and stand in the kitchen.",
    "answer_text": "6:10 AM",
    "answer_start": 38
  },
  {
    "id": "shane/shane-schedule_spring___saturday.txt",
    "question": "What time does shane leave marnie's ranch?",
    "context": "On Spring → Saturday, At 9:00 AM, shane leaves his room and stands in kitchen at marnie's ranch At 12:00 PM, shane leaves marnie's ranch and heads to pierre's general store At 5:00 PM, shane leaves pierre's general store and heads to the stardrop saloon At 11:00 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "12:00 PM",
    "answer_start": 99
  },
  {
    "id": "shane/shane-schedule_spring___desert_festival__as_vendor_.txt",
    "question": "When does shane board the bus to calico desert?",
    "context": "On Spring → Desert Festival (As Vendor), At 11:10 AM, shane boards the bus to calico desert At 11:30 AM, shane arrives at his booth At 12:00 AM, shane leaves booth and takes the bus back to the valley.",
    "answer_text": "11:10 AM",
    "answer_start": 44
  },
  {
    "id": "sebastian/sebastian-dislike_gifts.txt",
    "question": "Which of the following is not a gift: Chanterelle, Daffodil, Dandelion, Holly, or Leek?",
    "context": "sebastian dislikes the following gifts: Chanterelle (A tasty mushroom with a fruity smell and slightly peppery flavor.), Common Mushroom (Slightly nutty, with good texture.), Daffodil (A traditional spring flower that makes a nice gift.), Dandelion (Not the prettiest flower, but the leaves make a good salad.), Ginger (This sharp, spicy root is said to increase vitality.), Hazelnut (That's one big hazelnut!), Holly (The leaves and bright red berries make a popular winter decoration.), Leek (A tasty relative of the onion.), Magma Cap (A very rare mushroom that lives next to pools of lava.), Morel (Sought after for its unique nutty flavor.), Purple Mushroom (A rare mushroom found deep in caves.), Salmonberry (A spring-time berry with the flavor of the forest.), Snow Yam (This little yam was hiding beneath the snow.), Wild Horseradish (A spicy root found in the spring.), Winter Root (A starchy tuber.).",
    "answer_text": "the prettiest flower",
    "answer_start": 254
  },
  {
    "id": "leah/leah-schedule_summer___green_rain__year_1_.txt",
    "question": "How many hours does it take for leah to stand outside her cottage?",
    "context": "On Summer → Green Rain (Year 1), At 6:10 AM, leah stands outside her cottage At 1:00 PM, leah stands in her cottage, next to her bed At 10:00 PM, leah in bed.",
    "answer_text": "6:10 AM",
    "answer_start": 36
  },
  {
    "id": "harvey/harvey-schedule_fall___friday.txt",
    "question": "What time does harvey work at the clinic's front desk?",
    "context": "On Fall → Friday, At 7:00 AM, harvey stands in front of refrigerator in his room At 8:30 AM, harvey works at the clinic's front desk At 12:00 PM, harvey goes to pierre's general store At 3:00 PM, harvey returns to his room above the clinic At 10:00 PM, harvey goes to bed.",
    "answer_text": "12:00 PM",
    "answer_start": 136
  },
  {
    "id": "elliott/elliott-schedule_marriage___spring_15__bus_service_restored_.txt",
    "question": "When does elliott leave the desert festival?",
    "context": "On Marriage → Spring 15 (Bus Service Restored), At 8:30 AM, elliott leaves home to attend the desert festival and stand on the cliff overlooking the oasis At 12:30 AM, elliott leaves the desert festival and heads home to the farm.",
    "answer_text": "8:30 AM",
    "answer_start": 51
  },
  {
    "id": "maru/maru-schedule_marriage___monday.txt",
    "question": "How many hours does it take to walk to community center?",
    "context": "On Marriage → Monday, At 6:00 AM, maru at farmhouse At 8:00 AM, maru walking to carpenter's shop At 10:00 AM, maru carpenter's shop At 2:00 PM, maru walking to community center At 3:00 PM, maru sits on bench to right of community center At 6:00 PM, maru walking home At 7:30 PM, maru at home.",
    "answer_text": "3:00 PM",
    "answer_start": 180
  },
  {
    "id": "abigail/abigail-schedule_spring___friday.txt",
    "question": "What time does abigail arrive home?",
    "context": "On Spring → Friday, At 9:00 AM, abigail leaving her room to go to the kitchen At 11:00 AM, abigail leaves the kitchen to stand in pierre's general store At 3:00 PM, abigail leaving home to go to the stardrop saloon At 3:50 PM, abigail in the stardrop saloon, sitting on a sofa in the arcade At 9:00 PM, abigail heads home At 9:40 PM, abigail arrives home.",
    "answer_text": "9:00 PM",
    "answer_start": 294
  },
  {
    "id": "abigail/abigail-schedule_winter___winter_15.txt",
    "question": "What time does abigail walk to the carpenter's shop?",
    "context": "On Winter → Winter 15, At 9:00 AM, abigail leaving her room to go to the kitchen At 10:30 AM, abigail walking to the carpenter's shop. stands next to the counter At 2:30 PM, abigail walks to beach to attend night market At 12:00 AM, abigail back at home.",
    "answer_text": "10:30 AM",
    "answer_start": 84
  },
  {
    "id": "maru/maru-schedule_summer___regular_schedule.txt",
    "question": "How many hours does it take for maru to go home?",
    "context": "On Summer → Regular Schedule, At 9:00 AM, maru in her room At 10:20 AM, maru in the lab At 2:00 PM, maru leaving house to go to stand by lake, east of house At 2:40 PM, maru standing by lake, east of house At 7:00 PM, maru heads home At 7:40 PM, maru outside house, looking through telescope At 12:00 AM, maru heads inside and goes to bed.",
    "answer_text": "7:40 PM",
    "answer_start": 237
  },
  {
    "id": "leah/leah-schedule_spring___desert_festival__as_vendor_.txt",
    "question": "What time does leah board the bus to calico desert?",
    "context": "On Spring → Desert Festival (As Vendor), At 11:10 AM, leah boards the bus to calico desert At 11:30 AM, leah arrives at her booth At 12:00 AM, leah leaves booth and boards bus back to the valley.",
    "answer_text": "11:10 AM",
    "answer_start": 44
  },
  {
    "id": "penny/penny-schedule_summer___saturday.txt",
    "question": "How many hours does it take for penny to arrive at the trailer?",
    "context": "On Summer → Saturday, At 10:00 AM, penny leaves her trailer and goes outside near the town graveyard At 11:00 AM, penny with the kids near the town graveyard At 12:00 PM, penny walk kids to the playground, west of the community center At 1:00 PM, penny at the playground, play with kids At 5:00 PM, penny walks jas and vincent to emily's house At 6:00 PM, penny beside emily's house, talking with jas and vincent At 8:00 PM, penny goes to the trailer At 9:00 PM, penny arrives at the trailer for the evening.",
    "answer_text": "evening.",
    "answer_start": 500
  },
  {
    "id": "sam/sam-schedule_spring___spring_9_and_23.txt",
    "question": "How many hours does Sam wake up for the day?",
    "context": "On Spring → Spring 9 and 23, At 10:00 AM, sam wakes up for the day, moves around his room At 10:40 AM, sam plays guitar inside his bedroom At 1:40 PM, sam leaves his bedroom, walks into town, and stands near lewis' house by the river At 6:30 PM, sam returns home from town At 9:00 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "9 and 23",
    "answer_start": 19
  },
  {
    "id": "shane/shane-heart_event_eight_hearts.txt",
    "question": "What event triggers a heart event?",
    "context": "At Eight Hearts, if the condition \"EnterMarnie's Ranchwhile Shane is home.Note: Will not trigger until the player has seen the follow-up visit from Shane after his 6-heart event.\" is met, the event is as follows: When you enter the ranch, Jas leads you through the door in the kitchen that is normally locked. Inside, Shane is painting a sign that says \"Fresh Eggs.\" He's surrounded by his flock of special blue chickens and his favorite white chicken, Charlie. Once he finishes painting the sign, he picks up Charlie and briefly talks to her about his ambitions and his struggles. When you and Jas enter the room, Shane talks to you a bit about how he is trying to pass on the chicken knowledge to Jas so she can continue the tradition if he ever moves out. After seeing this event, each chicken that the player purchases from Marnie and each egg that hatches in the incubator now has a 25% chance of being blue. Aside from appearance, the blue chickens are identical to white chickens.",
    "answer_text": "6-heart event",
    "answer_start": 164
  },
  {
    "id": "abigail/abigail-schedule_summer___summer_11_and_25__no_player_has_6_hearts_with_sebastian_or_abigail_.txt",
    "question": "How many hours does it take for abigail to leave pierre's store?",
    "context": "On Summer → Summer 11 and 25 (No player has 6 hearts with Sebastian or Abigail), At 9:00 AM, abigail in bed At 10:30 AM, abigail leaves pierre's store At 12:00 PM, abigail arrives in sebastian’s room At 5:00 PM, abigail leaves sebastian’s room At 6:30 PM, abigail returns home At 6:50 PM, abigail back in room.",
    "answer_text": "12:00 PM",
    "answer_start": 154
  },
  {
    "id": "elliott/elliott-schedule_fall___friday_and_sunday.txt",
    "question": "When does elliott leave his cabin to stand on the beach?",
    "context": "On Fall → Friday and Sunday, At 8:00 AM, elliott at home At 12:00 PM, elliott leaves his cabin to stand on the beach south of his house At 1:30 PM, elliott leaves the beach and returns to his cabin At 3:00 PM, elliott leaves his cabin to stand on the bridge just north of the beach At 6:00 PM, elliott leaves the bridge to return home for the night.",
    "answer_text": "1:30 PM",
    "answer_start": 139
  },
  {
    "id": "elliott/elliott-schedule_winter___friday_and_sunday__no_player_has_6_hearts_with_leah_.txt",
    "question": "How many hours does elliott spend at home?",
    "context": "On Winter → Friday and Sunday (No player has 6 hearts with Leah), At 8:00 AM, elliott at home At 11:00 AM, elliott leaves his cabin to stand on the docks next to willy's house At 5:00 PM, elliott leaves the docks to visit the stardrop saloon At 11:40 PM, elliott leaves the saloon to return home for the night.",
    "answer_text": "8:00 AM",
    "answer_start": 69
  },
  {
    "id": "alex/alex-love_gifts.txt",
    "question": "What is the name of Alex's favorite gift?",
    "context": "alex loves the following gifts: Complete Breakfast (You'll feel ready to take on the world!), Jack Be Nimble, Jack Be Thick (Gain +1 Defense.), Salmon Dinner (The lemon spritz makes it special.).",
    "answer_text": "Complete Breakfast",
    "answer_start": 32
  },
  {
    "id": "penny/penny-like_gifts.txt",
    "question": "What is the name of the flower that penny likes?",
    "context": "penny likes the following gifts: Dandelion (Not the prettiest flower, but the leaves make a good salad.), Leek (A tasty relative of the onion.).",
    "answer_text": "Dandelion",
    "answer_start": 33
  },
  {
    "id": "abigail/abigail-schedule_fall___fall_11_and_25.txt",
    "question": "When does abigail go to bed?",
    "context": "On Fall → Fall 11 and 25, At 9:00 AM, abigail leaves her room to go to the kitchen At 10:30 AM, abigail leaves the kitchen to stand in pierre's store At 1:00 PM, abigail leaves the house to go to stand on bridge near jojamart At 1:30 PM, abigail standing on the bridge near jojamart At 4:30 PM, abigail heads home At 5:20 PM, abigail in her room, playing video games At 7:30 PM, abigail goes to bed.",
    "answer_text": "7:30 PM",
    "answer_start": 370
  },
  {
    "id": "abigail/abigail-schedule_fall___sunday.txt",
    "question": "How many hours does it take for abigail to arrive at home?",
    "context": "On Fall → Sunday, At 9:00 AM, abigail in her room At 10:30 AM, abigail leaves her room to go into caroline and pierre's room At 1:00 PM, abigail leaving home to go to the wizard's tower At 4:00 PM, abigail near the wizard's tower in cindersap forest At 8:00 PM, abigail heads home At 10:30 PM, abigail arrives at home.",
    "answer_text": "10:30 PM",
    "answer_start": 284
  },
  {
    "id": "maru/maru-heart_event_eight_hearts.txt",
    "question": "How many friendships does Maru have at Eight Hearts?",
    "context": "At Eight Hearts, if the condition \"Enter theCarpenter's Shopwhen Maru is there.\" is met, the event is as follows: Maru says she's been working on a new project, something big. She shows you a machine and says it's just one component. She asks you to put your hand on it for a demonstration, flips a switch, and you get shocked. Maru is aghast and asks if you're alright. She applies burn cream and apologizes. \"It's okay, it doesn't even hurt.\" (+30 friendship .) \"You'd better be. This hurts like crazy!\" (-50 friendship .) With either choice, Maru says that kind of ruined the moment, and sighs.",
    "answer_text": "50 friendship",
    "answer_start": 508
  },
  {
    "id": "harvey/harvey-hate_gifts.txt",
    "question": "Who hates the following gifts: Nautilus Shell, Rainbow Shell, and Spice Berry?",
    "context": "harvey hates the following gifts: Coral (A colony of tiny creatures that clump together to form beautiful structures.), Nautilus Shell (An ancient shell.), Rainbow Shell (It's a very beautiful shell.), Salmonberry (A spring-time berry with the flavor of the forest.), Spice Berry (It fills the air with a pungent aroma.).",
    "answer_text": "harvey",
    "answer_start": 0
  },
  {
    "id": "alex/alex-schedule_summer___wednesday__no_player_has_6_hearts_with_haley_or_alex_.txt",
    "question": "How many hours does it take Alex to go outside and stand beneath a tree?",
    "context": "On Summer → Wednesday (No player has 6 hearts with Haley or Alex), At 8:00 AM, alex leaves his room to go outside and stand beneath nearby tree At 12:00 PM, alex goes to haley and emily's house At 4:30 PM, alex leaves haley and emily's house to go stand by the dog pen At 6:40 PM, alex goes back into his house and stands in the entryway At 8:00 PM, alex goes to his room and stands by his dresser At 10:00 PM, alex goes to bed.",
    "answer_text": "8:00 AM",
    "answer_start": 70
  },
  {
    "id": "leah/leah-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the player does not have a Rabbit's Foot in inventory?",
    "context": "At Group Ten-Heart Event, if the condition \"If the player is unmarried and has given a bouquet to all available bachelorettes, raisedfriendshipwith each bachelorette to 10 hearts, and seen each bachelorette's 10-heart event, then enteringHaley/Emily's Housewill trigger a cutscene. IfHaleyis the final bachelorette you share a Ten-Heart Event with, the Group Ten-Heart Event will be unavoidable as it is triggered immediately afterwards.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a gossip session about Mayor Lewis and Marnie 's relationship. If the player does not have a Rabbit's Foot in inventory, all bachelorettes will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelorettes will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelorettes will forgive the player, and dialogues return to normal.",
    "answer_text": "all bachelorettes will express anger about the player dating them all at one time",
    "answer_start": 670
  },
  {
    "id": "alex/alex-hate_gifts.txt",
    "question": "What is the name of the gift alex hates?",
    "context": "alex hates the following gifts: Holly (The leaves and bright red berries make a popular winter decoration.), Quartz (A clear crystal commonly found in caves and mines.).",
    "answer_text": "Holly (The leaves and bright red berries make a popular winter decoration",
    "answer_start": 32
  },
  {
    "id": "shane/shane-dislike_gifts.txt",
    "question": "What does shane dislike the most?",
    "context": "shane dislikes the following gifts: Chanterelle (A tasty mushroom with a fruity smell and slightly peppery flavor.), Common Mushroom (Slightly nutty, with good texture.), Daffodil (A traditional spring flower that makes a nice gift.), Dandelion (Not the prettiest flower, but the leaves make a good salad.), Ginger (This sharp, spicy root is said to increase vitality.), Hazelnut (That's one big hazelnut!), Holly (The leaves and bright red berries make a popular winter decoration.), Leek (A tasty relative of the onion.), Magma Cap (A very rare mushroom that lives next to pools of lava.), Morel (Sought after for its unique nutty flavor.), Purple Mushroom (A rare mushroom found deep in caves.), Seaweed (It can be used in cooking.), Snow Yam (This little yam was hiding beneath the snow.), Wild Horseradish (A spicy root found in the spring.), Winter Root (A starchy tuber.).",
    "answer_text": "Chanterelle",
    "answer_start": 36
  },
  {
    "id": "shane/shane-neutral_gifts.txt",
    "question": "What does shane neutralize?",
    "context": "shane neutrals the following gifts: Strange Bun (What's inside?).",
    "answer_text": "the following gifts",
    "answer_start": 15
  },
  {
    "id": "harvey/harvey-schedule_fall___tuesday_and_thursday.txt",
    "question": "How many hours does Harvey work at the clinic's front desk?",
    "context": "On Fall → Tuesday and Thursday, At 7:30 AM, harvey in exam room of clinic At 12:50 PM, harvey moves to waiting room At 1:30 PM, harvey returns to exam room At 4:30 PM, harvey works at the clinic's front desk At 6:00 PM, harvey goes upstairs to his room, reads in front of bookshelf At 11:00 PM, harvey goes to bed.",
    "answer_text": "6:00 PM",
    "answer_start": 211
  },
  {
    "id": "abigail/abigail-schedule_fall___wednesday.txt",
    "question": "What time does abigail arrive at home?",
    "context": "On Fall → Wednesday, At 10:30 AM, abigail leaves home to go to library At 12:00 PM, abigail inside library, looking at books At 6:00 PM, abigail walks to the graveyard At 7:00 PM, abigail standing in front of mona's grave At 10:00 PM, abigail heads home At 10:40 PM, abigail arrives at home.",
    "answer_text": "10:40 PM",
    "answer_start": 257
  },
  {
    "id": "elliott/elliott-schedule_winter___regular_schedule.txt",
    "question": "How many hours does elliott spend at home?",
    "context": "On Winter → Regular Schedule, At 8:00 AM, elliott at home At 11:30 AM, elliott leaves home, heads to the library At 5:30 PM, elliott leaves the library to return home for the night.",
    "answer_text": "8:00 AM",
    "answer_start": 33
  },
  {
    "id": "penny/penny-heart_event_six_hearts.txt",
    "question": "How many friendships does Penny have?",
    "context": "At Six Hearts, if the condition \"Enter thetrailerwhen she's home.\" is met, the event is as follows: Penny asks you to try a recipe she invented. \"(Lie) Mmm! That was delicious!\" (+50 friendship .) She responds: \"You really mean it? Thank you! ... it's such a relief to hear that. I've been working so hard on this recipe, and I'm really proud of it. Hey, since you're the first person to try it, I'm going to name this one 'Chili de <your name>'.\" \"Uh... can I get the rest to go?\" (-50 friendship .) Penny is crestfallen and says her recipe was a failure. \"Well it's definitely unique... how did you get it so rubbery?\" (No effect on friendship .) Penny is crestfallen and says her recipe was a failure. Regardless of your choice, she invites you to watch a movie together and your energy is increased by 165.",
    "answer_text": "50 friendship",
    "answer_start": 180
  },
  {
    "id": "elliott/elliott-neutral_gifts.txt",
    "question": "What does Elliott neutralize?",
    "context": "elliott neutrals the following gifts: Rainbow Shell (It's a very beautiful shell.), Sea Urchin (A slow-moving, spiny creature that some consider a delicacy.).",
    "answer_text": "Rainbow Shell",
    "answer_start": 38
  },
  {
    "id": "penny/penny-schedule_summer___rain__option_2_.txt",
    "question": "How many hours does it take Penny to go to bed?",
    "context": "On Summer → Rain (Option 2), At 8:10 AM, penny leaves the trailer and walks to the museum to sit outside At 12:00 PM, penny goes inside the museum to look at the bookshelves At 4:00 PM, penny leaves the museum and returns to the trailer to watch some television At 7:00 PM, penny moves over to the sink in the trailer to do some dishes At 9:00 PM, penny goes to bed for the evening.",
    "answer_text": "evening.",
    "answer_start": 374
  },
  {
    "id": "sam/sam-schedule_winter___monday_and_wednesday.txt",
    "question": "How many hours does sam work at jojamart?",
    "context": "On Winter → Monday and Wednesday, At 10:00 AM, sam wakes up and stands in the middle of his bedroom At 11:00 AM, sam leaves his bedroom and walks to jojamart (or museum if community center is restored) At 12:50 PM, sam arrives at jojamart (or museum if community center is restored) and starts work At 4:00 PM, sam finshes work at jojamart (or museum if community center is restored) and walks home At 6:00 PM, sam arrives in his bedroom and stands in front of his bookshelf At 9:30 PM, sam goes to bed.",
    "answer_text": "4:00 PM",
    "answer_start": 302
  },
  {
    "id": "penny/penny-schedule_summer___sunday.txt",
    "question": "How many hours does it take to go to the carpenter's shop?",
    "context": "On Summer → Sunday, At 8:00 AM, penny leaves her trailer and walks to the river above jojamart At 9:20 AM, penny stands above jojamart, to the right of the river At 12:00 PM, penny goes to the carpenter's shop At 1:40 PM, penny arrives at maru's room in the carpenter's shop and sits with maru At 6:00 PM, penny leaves carpenter's shop and returns to the trailer to do dishes At 9:00 PM, penny goes to bed for the evening.",
    "answer_text": "1:40 PM",
    "answer_start": 213
  },
  {
    "id": "abigail/abigail-schedule_fall___fall_6_and_16.txt",
    "question": "When does abigail arrive at home?",
    "context": "On Fall → Fall 6 and 16, At 9:00 AM, abigail leaving her room to go to the kitchen At 10:30 AM, abigail leaves the kitchen to stand in pierre's general store At 3:00 PM, abigail goes to the mountain, standing on the southwest corner of the lake, playing the flute At 8:00 PM, abigail heads home to go to bed At 9:40 PM, abigail arrives at home.",
    "answer_text": "9:40 PM",
    "answer_start": 311
  },
  {
    "id": "sam/sam-schedule_marriage___spring_15__bus_service_restored_.txt",
    "question": "How long does it take Sam to walk to the desert festival?",
    "context": "On Marriage → Spring 15 (Bus Service Restored), At 10:20 AM, sam walks to the desert festival and stands west of the pond near the cactus stand At 1:00 AM, sam returns home.",
    "answer_text": "10:20 AM",
    "answer_start": 51
  },
  {
    "id": "abigail/abigail-schedule_spring___spring_4.txt",
    "question": "When does abigail go to bed?",
    "context": "On Spring → Spring 4, At 9:00 AM, abigail in her room At 12:30 PM, abigail leaves her room to go to the clinic for her annual check-up At 1:30 PM, abigail leaves the waiting room and enters the exam room of the clinic At 4:00 PM, abigail leaves the clinic and goes home back to her room At 8:00 PM, abigail goes to bed.",
    "answer_text": "8:00 PM",
    "answer_start": 290
  },
  {
    "id": "abigail/abigail-schedule_spring___spring_11_and_25__no_player_has_6_hearts_with_sebastian_or_abigail_.txt",
    "question": "How many hours does Abigail spend in bed?",
    "context": "On Spring → Spring 11 and 25 (No player has 6 hearts with Sebastian or Abigail), At 9:00 AM, abigail in bed At 10:30 AM, abigail leaves pierre's store At 12:00 PM, abigail arrives in sebastian’s room At 5:00 PM, abigail leaves sebastian’s room At 6:30 PM, abigail returns home At 6:50 PM, abigail back in room.",
    "answer_text": "10:30 AM",
    "answer_start": 111
  },
  {
    "id": "harvey/harvey-schedule_summer___saturday.txt",
    "question": "How many hours does it take Harvey to go to the museum?",
    "context": "On Summer → Saturday, At 8:30 AM, harvey leaves home to go to the museum At 3:00 PM, harvey leaves the museum to return to his room above the clinic.",
    "answer_text": "Saturday,",
    "answer_start": 12
  },
  {
    "id": "sebastian/sebastian-schedule_summer___green_rain__year_1_.txt",
    "question": "What is the name of the character who is in his room?",
    "context": "On Summer → Green Rain (Year 1), At All day, sebastian in his room.",
    "answer_text": "sebastian",
    "answer_start": 45
  },
  {
    "id": "elliott/elliott-schedule_fall___thursday.txt",
    "question": "What time does elliott leave pierre's general store?",
    "context": "On Fall → Thursday, At 8:00 AM, elliott at home At 11:30 AM, elliott leaves home and heads to pierre's general store At 5:30 PM, elliott leaves pierre's and heads home for the night.",
    "answer_text": "5:30 PM",
    "answer_start": 120
  },
  {
    "id": "sebastian/sebastian-like_gifts.txt",
    "question": "What is the name of the gift that sebastian likes?",
    "context": "sebastian likes the following gifts: Combat Quarterly (Read this to gain some combat experience.), Flounder (It lives on the bottom, so both eyes are on top of its head.), Monster Compendium (Monsters have a small chance to drop double loot.), Quartz (A clear crystal commonly found in caves and mines.).",
    "answer_text": "Combat Quarterly",
    "answer_start": 37
  },
  {
    "id": "sebastian/sebastian-schedule_spring___saturday.txt",
    "question": "How many hours does it take for sebastian to arrive home?",
    "context": "On Spring → Saturday, At 9:00 AM, sebastian leaves house to go to sam's house At 11:30 AM, sebastian in front of haley and emily's house with sam At 12:30 PM, sebastian follows sam to his room At 1:00 PM, sebastian in sam's room At 6:00 PM, sebastian leaves sam's house with sam and goes to the river At 6:20 PM, sebastian smoking by the river outside sam's house with him At 7:30 PM, sebastian going home from in front of sam's house At 9:40 PM, sebastian arrives home.",
    "answer_text": "9:40 PM",
    "answer_start": 438
  },
  {
    "id": "penny/penny-schedule_spring___rain__option_2_.txt",
    "question": "How many hours does it take Penny to go to bed?",
    "context": "On Spring → Rain (Option 2), At 8:10 AM, penny leaves the trailer and walks to the museum to sit outside At 12:00 PM, penny goes inside the museum to look at the bookshelves At 4:00 PM, penny leaves the museum and returns to the trailer to watch some television At 7:00 PM, penny moves over to the sink in the trailer to do some dishes At 9:00 PM, penny goes to bed for the evening.",
    "answer_text": "evening.",
    "answer_start": 374
  },
  {
    "id": "sam/sam-schedule_summer___rain__option_2_.txt",
    "question": "What time does Sam wake up for the day?",
    "context": "On Summer → Rain (Option 2), At 10:00 AM, sam wakes up for the day, moves around his room At 11:00 AM, sam moves around inside his home At 2:00 PM, sam leaves his bedroom and walks to the stardrop saloon. \"nothing like an ice cold joja cola on a sopping wet day, huh? just kidding. hehehe.\" At 7:40 PM, sam leaves the stardrop saloon and returns to his bedroom to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 32
  },
  {
    "id": "alex/alex-schedule_marriage___spring_15.txt",
    "question": "How long does it take alex to go back to farm?",
    "context": "On Marriage → Spring 15, At 8:00 AM, alex leaves farm to attend the desert festival and stand by the chef stand At 12:40 AM, alex heads back to farm.",
    "answer_text": "12:40 AM",
    "answer_start": 115
  },
  {
    "id": "sam/sam-schedule_summer___friday.txt",
    "question": "How many hours does sam spend skateboarding outside of his house?",
    "context": "On Summer → Friday, At 10:00 AM, sam wakes up and plays guitar inside his bedroom At 11:00 AM, sam leaves his bedroom and skateboards outside of his house At 3:00 PM, sam walks to the stardrop saloon At 4:00 PM, sam arrives at the stardrop saloon and plays pool near the arcade At 9:20 PM, sam leaves the stardrop saloon and walks home At 10:20 PM, sam arrives at home.",
    "answer_text": "3:00 PM",
    "answer_start": 158
  },
  {
    "id": "elliott/elliott-schedule_spring___thursday.txt",
    "question": "What time does elliott leave pierre's general store?",
    "context": "On Spring → Thursday, At 8:00 AM, elliott at home At 11:30 AM, elliott leaves home and heads to pierre's general store At 5:30 PM, elliott leaves pierre's and heads home for the night.",
    "answer_text": "5:30 PM",
    "answer_start": 122
  },
  {
    "id": "haley/haley-schedule_marriage___spring_15__bus_service_restored_.txt",
    "question": "What time does Haley leave home to attend the desert festival?",
    "context": "On Marriage → Spring 15 (Bus Service Restored), At 9:00 AM, haley leaves home to attend the desert festival At 10:00 AM, haley walks around the area west of emily's outfit services At 12:00 AM, haley heads home.",
    "answer_text": "9:00 AM",
    "answer_start": 51
  },
  {
    "id": "abigail/abigail-heart_event_six_hearts.txt",
    "question": "How many friends does Abigail have?",
    "context": "At Six Hearts, if the condition \"Between 9pm and midnight on a day when it is not raining, enterPelican Townfrom any direction. (This includes exiting homes or shops in Town.)\" is met, the event is as follows: Abigail is in the graveyard. She tells you that she's been practicing with her sword because she wants to go on adventures. She asks if you've ever used a sword. \"Yes, and it's exciting!\" (+10 friendship .) \"Yes, but only in self-defense.\" (+10 friendship .) \"Yes, but it's dangerous. You should stay safe.\" (-100 friendship .) \"No.\" (No effect on friendship .) Pierre arrives and interrupts to say that Caroline wants her to come help cook dinner. Abigail gets angry, saying they only expect her to help cook because she's a girl. She flees, calling for you to follow. You both hide in some bushes and talk. After talking she will ask you to help her untangle her hair from a bush, and the cutscene ends.",
    "answer_text": "100 friendship .",
    "answer_start": 520
  },
  {
    "id": "sam/sam-schedule_marriage___friday.txt",
    "question": "What time does sam arrive at the farmhouse?",
    "context": "On Marriage → Friday, At 6:00 AM, sam at home At 8:00 AM, sam leaves home and heads for pelican town At 9:30 AM, sam arrives at 1 willow lane and stands in the kitchen At 11:00 AM, sam leaves house At 11:50 AM, sam skateboarding south of the stardrop saloon, by the benches At 3:00 PM, sam heads into the stardrop saloon At 3:30 PM, sam playing pool in the stardrop saloon At 9:00 PM, sam leaves the saloon to return home At 11:00 PM, sam arrives at the farmhouse.",
    "answer_text": "11:00 PM",
    "answer_start": 425
  },
  {
    "id": "leah/leah-schedule_fall___rain.txt",
    "question": "What time does Leah leave her cottage?",
    "context": "On Fall → Rain, At 9:00 AM, leah sculpts in her cottage At 12:00 PM, leah moves to her easel to paint At 2:00 PM, leah stands in front of the bookcase in her cottage At 4:00 PM, leah leaves her cottage and walks to the stardrop saloon At 11:40 PM, leah leaves the saloon to return home and sleep.",
    "answer_text": "4:00 PM",
    "answer_start": 169
  },
  {
    "id": "haley/haley-schedule_fall___wednesday__no_player_has_6_hearts_with_haley_or_alex_.txt",
    "question": "How many hours does it take for Haley to go to bed?",
    "context": "On Fall → Wednesday (No player has 6 hearts with Haley or Alex), At 9:00 AM, haley in her room At 12:10 PM, haley in the living room At 4:30 PM, haley moves to the kitchen At 8:00 PM, haley returns to her room At 10:30 PM, haley goes to bed.",
    "answer_text": "10:30 PM",
    "answer_start": 213
  },
  {
    "id": "sebastian/sebastian-schedule_marriage___green_rain__year_1_.txt",
    "question": "What is the name of the character who leaves home to walk to his old room?",
    "context": "On Marriage → Green Rain (Year 1), At 6:10 AM, sebastian leaves home to walk to his old room.",
    "answer_text": "sebastian",
    "answer_start": 47
  },
  {
    "id": "abigail/abigail-schedule_spring___rain__option_2_.txt",
    "question": "When does abigail go to bed?",
    "context": "On Spring → Rain (Option 2), At 9:00 AM, abigail leaving her room to go to the kitchen At 11:00 AM, abigail leaves the kitchen to stand in pierre's general store At 2:00 PM, abigail leaving the house to go to the stardrop saloon At 2:50 PM, abigail in the stardrop saloon, sitting on a sofa in the arcade At 9:00 PM, abigail heads home At 10:00 PM, abigail goes to bed.",
    "answer_text": "10:00 PM",
    "answer_start": 339
  },
  {
    "id": "penny/penny-schedule_fall___monday__thursday_and_sunday.txt",
    "question": "How many hours does it take to leave the trailer for the evening?",
    "context": "On Fall → Monday, Thursday and Sunday, At 8:00 AM, penny leaves her trailer and goes outside to read near the graveyard At 12:30 PM, penny returns to the trailer to wash dishes At 4:00 PM, penny leaves the trailer again to go outside the saloon where she sits on a bench with maru At 6:40 PM, penny returns to her trailer for the evening.",
    "answer_text": "6:40 PM",
    "answer_start": 284
  },
  {
    "id": "sebastian/sebastian-schedule_winter___rain__option_1_.txt",
    "question": "What time does sebastian get out of bed and leaves the house?",
    "context": "On Winter → Rain (Option 1), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and leaves house to go to the beach At 1:30 PM, sebastian standing at the end of long pier to the left of the fish shop At 5:00 PM, sebastian leaves the pier to go home At 7:40 PM, sebastian arrives home and goes to bed.",
    "answer_text": "10:30 AM",
    "answer_start": 65
  },
  {
    "id": "abigail/abigail-heart_event_two_hearts.txt",
    "question": "What is the condition of Enter Pierre's General Storewhen Abigail is there?",
    "context": "At Two Hearts, if the condition \"EnterPierre's General Storewhen Abigail is there, any day except Saturday.\" is met, the event is as follows: You enter Abigail's room and watch her get angry about a videogame. She asks for your help, and you play the console version of Journey of the Prairie King together. (This is just like the arcade version in the Stardrop Saloon , except that Abigail plays a second character and actively helps you). When you finish the level, she thanks you and the cutscene ends. If you fail, however, she will still thank you for trying. You can't gain or lose friendship points during this heart event.",
    "answer_text": "any day except Saturday.",
    "answer_start": 83
  },
  {
    "id": "maru/maru-schedule_summer___monday.txt",
    "question": "How many hours does it take for maru to arrive home?",
    "context": "On Summer → Monday, At 9:00 AM, maru in her room At 10:20 AM, maru in the lab At 1:30 PM, maru leaving house to go sit on a bench in front of saloon At 3:20 PM, maru sitting on a bench in front of stardrop saloon At 6:30 PM, maru heads home At 8:10 PM, maru arrives home.",
    "answer_text": "8:10 PM",
    "answer_start": 244
  },
  {
    "id": "shane/shane-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the player does not have a Rabbit's Foot in inventory?",
    "context": "At Group Ten-Heart Event, if the condition \"If the player is unmarried and has given a bouquet to all available bachelors, raisedfriendshipwith each bachelor to 10 hearts, and seen each bachelor's 10-heart event, then enteringThe Stardrop Saloonwill trigger a cutscene. IfAlexis the final bachelor you share a Ten-Heart Event with, the Group Ten-Heart Event will be unavoidable as it is triggered immediately afterwards.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a friendly game of pool. If the player does not have a Rabbit's Foot in inventory, all bachelors will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelors will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelors will forgive the player, and dialogues return to normal.",
    "answer_text": "all bachelors will express anger about the player dating them all at one time",
    "answer_start": 615
  },
  {
    "id": "maru/maru-dislike_gifts.txt",
    "question": "Which of the following is not a gift that maru dislikes?",
    "context": "maru dislikes the following gifts: Blackberry (An early-fall treat.), Common Mushroom (Slightly nutty, with good texture.), Crystal Fruit (A delicate fruit that pops up from the snow.), Maple Syrup (A sweet syrup with a unique flavor.), Salmonberry (A spring-time berry with the flavor of the forest.).",
    "answer_text": "Common Mushroom",
    "answer_start": 70
  },
  {
    "id": "abigail/abigail-schedule_winter___rain__option_2_.txt",
    "question": "When does abigail go to bed?",
    "context": "On Winter → Rain (Option 2), At 9:00 AM, abigail leaving her room to go to the kitchen At 11:00 AM, abigail leaves the kitchen to stand in pierre's general store At 2:00 PM, abigail leaving the house to go to the stardrop saloon At 2:50 PM, abigail in the stardrop saloon, sitting on a sofa in the arcade At 9:00 PM, abigail heads home At 10:00 PM, abigail goes to bed.",
    "answer_text": "10:00 PM",
    "answer_start": 339
  },
  {
    "id": "maru/maru-heart_event_fourteen_hearts.txt",
    "question": "How many days does it take to enter the Farmhouse?",
    "context": "At Fourteen Hearts, if the condition \"Part 1:Enter the Farmhouse between 6:10am and 5pm on a non-Sunday non-winter day.Part 2:Enter the Mountains between 10:00pm and 1:00am on a sunny day.\" is met, the event is as follows: Part 1: Maru greets you and informs you a rare astronomical event is happening tomorrow night. She invites you to observe it with her, and asks you to meet her in the mountains tomorrow night (or the next night if it is raining). Part 2: You and Maru stand near a telescope as Maru reminisces about the last time you stargazed together. The astronomical event begins; a scene of a comet being viewed through a telescope plays. Maru remarks that it's customary to make a wish after seeing a comet, and asks what the player will wish for. You may respond: \"A new baby\" (No effect on friendship .) \"For us to grow old together\" (No effect on friendship .) \"More money\" (No effect on friendship .) Note: When this cutscene ends, the day ends immediately with the player being taken to the end-of-day profits screen. The player will wake up in bed the next morning as usual.",
    "answer_text": "6:10am and 5pm",
    "answer_start": 73
  },
  {
    "id": "penny/penny-heart_event_fourteen_hearts.txt",
    "question": "What is the name of Penny's hand-made decor?",
    "context": "At Fourteen Hearts, if the condition \"Enter the farm house between 3pm and 7pm when she's home.\" is met, the event is as follows: Penny says \"Welcome home, honey... How was your day?\" It was fine (No effect on friendship .) Penny responds \"Just business as usual, huh? Well, I've got a zesty new recipe in the oven, so maybe things will get a little more exciting! Not good... (No effect on friendship .) Penny responds \"Oh, I'm sorry! Well, you're back now... I'll do my best to make you feel better.\" It was fantastic! (No effect on friendship .) Penny responds \"That's great! I'm glad you enjoy your work so much.\" Penny then says she would like to redecorate the bedroom with her hand-made decor.  She asks what style you prefer. Forest And Moon: Peaceful Blue (No effect on friendship .) Strawberry Home (No effect on friendship .) Pirate Theme (No effect on friendship .) Penny says she won't touch any of your chests , but asks you to move them out of the room. I don't want any changes! (No effect on friendship .) Penny says she won't worry about it, then. Part 2 : If you choose to let Penny redecorate, 3 days later when waking up in the morning, the bedroom will be redecorated with the chosen style. Note that the type, number, and placement of items may vary slightly with Farmhouse upgrades. Forest and Moon Strawberry Home Pirate Theme Each choice will give unique decorations that are not available by any other means: Forest and Moon: Starry Double Bed Strawberry Home: Fruit Salad Rug and Strawberry Double Bed Pirate Theme: Pirate Rug and Pirate Double Bed Each choice also gives decorations that can otherwise be found only at Penny's shop during the Desert Festival : Forest and Moon: Night Sky Decal 1 , Night Sky Decal 2 , Night Sky Decal 3 Strawberry Home: Strawberry Decal Pirate Theme: Pirate Flag",
    "answer_text": "Strawberry Home",
    "answer_start": 793
  },
  {
    "id": "harvey/harvey-schedule_spring___regular_schedule.txt",
    "question": "When does harvey go to bed?",
    "context": "On Spring → Regular Schedule, At 7:00 AM, harvey stands in front of refrigerator in his room At 8:30 AM, harvey works at the clinic's front desk At 12:00 PM, harvey walks around the park west of the town square At 5:30 PM, harvey returns to clinic, stands at right side of front desk At 6:40 PM, harvey goes upstairs to his room, reads in front of bookshelf At 10:00 PM, harvey goes to bed.",
    "answer_text": "10:00 PM",
    "answer_start": 361
  },
  {
    "id": "maru/maru-schedule_fall___regular_schedule.txt",
    "question": "What time does maru go to bed?",
    "context": "On Fall → Regular Schedule, At 9:00 AM, maru in her room At 10:20 AM, maru in the lab At 2:00 PM, maru leaving house to go sit on bench, east of community center At 3:00 PM, maru sitting on bench, east of the community center At 6:00 PM, maru heads home At 7:10 PM, maru at home, in her room At 10:00 PM, maru goes to bed.",
    "answer_text": "10:00 PM",
    "answer_start": 295
  },
  {
    "id": "penny/penny-schedule_winter___saturday.txt",
    "question": "How many hours does it take for Penny to return to her trailer?",
    "context": "On Winter → Saturday, At 9:00 AM, penny in her room At 10:00 AM, penny leaves her trailer to meet up with jas and vincent near the town graveyard At 12:00 PM, penny walks jas and vincent to the playground north of town square and watches them play At 5:00 PM, penny walks jas and vincent back to town and drops them off in front of emily and haley's house At 8:50 PM, penny returns to her trailer for the evening.",
    "answer_text": "evening.",
    "answer_start": 405
  },
  {
    "id": "alex/alex-schedule_fall___sunday__alex_s_14-heart_event_seen_.txt",
    "question": "What is the name of Alex's 14-heart event?",
    "context": "On Fall → Sunday (Alex's 14-heart event seen), At 8:00 AM, alex leaves his room to go outside and stand beneath nearby tree At 11:00 AM, alex goes to the back room of the stardrop saloon At 3:00 PM, alex leaves to stand by the dog kennel At 6:30 PM, alex goes inside of his house and stands in the entryway At 8:00 PM, alex goes to stand inside of his room At 10:00 PM, alex goes to bed.",
    "answer_text": "stardrop saloon",
    "answer_start": 171
  },
  {
    "id": "sebastian/sebastian-schedule_winter___saturday.txt",
    "question": "What is the name of the person who goes home from in front of Sam's house?",
    "context": "On Winter → Saturday, At 9:00 AM, sebastian leaves house to go to sam's house At 11:30 AM, sebastian in front of haley and emily's house with sam At 12:30 PM, sebastian follows sam to his room At 1:00 PM, sebastian in sam's room At 6:00 PM, sebastian leaves sam's house with sam and goes to the river At 6:20 PM, sebastian smoking by the river outside sam's house with him At 7:30 PM, sebastian going home from in front of sam's house At 9:40 PM, sebastian arrives home.",
    "answer_text": "sebastian",
    "answer_start": 34
  },
  {
    "id": "sebastian/sebastian-schedule_marriage___monday.txt",
    "question": "How many hours does it take to go to the mountain?",
    "context": "On Marriage → Monday, At 6:00 AM, sebastian at home At 9:00 AM, sebastian leaves to go to the mountain At 9:30 AM, sebastian walks through the town square At 10:30 AM, sebastian arrives at his old spot by the mountain lake At 1:00 PM, sebastian leaves to go visit robin At 5:20 PM, sebastian leaves the mountain and heads home At 7:20 PM, sebastian arrives home At 10:00 PM, sebastian goes to bed.",
    "answer_text": "Monday,",
    "answer_start": 14
  },
  {
    "id": "abigail/abigail-schedule_winter___sunday.txt",
    "question": "How many hours does it take for abigail to arrive home?",
    "context": "On Winter → Sunday, At 9:00 AM, abigail in her room At 10:30 AM, abigail leaves her room to go into caroline and pierre's room At 1:00 PM, abigail leaving home to go to the wizard's tower At 4:00 PM, abigail near the wizard's tower in cindersap forest At 8:00 PM, abigail heads home At 10:30 PM, abigail arrives home.",
    "answer_text": "10:30 PM",
    "answer_start": 286
  },
  {
    "id": "sam/sam-schedule_fall___rain__option_1_.txt",
    "question": "What time does Sam wake up for the day?",
    "context": "On Fall → Rain (Option 1), At 10:00 AM, sam wakes up for the day, stands in front of the dresser in his room At 11:00 AM, sam plays guitar inside his room At 3:00 PM, sam plays his handheld video game in the kitchen inside his house At 5:00 PM, sam returns to his bedroom. and stands in front of his dresser At 6:30 PM, sam at his desk inside his bedroom At 8:00 PM, sam goes to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 30
  },
  {
    "id": "sebastian/sebastian-heart_event_two_hearts.txt",
    "question": "What does Sebastian ask Robin to do after he leaves?",
    "context": "At Two Hearts, if the condition \"Enter Sebastian's room when he's there.\" is met, the event is as follows: You find Sebastian working on his computer. He asks you to wait, he needs to finish something. You are given two options, \"He is busy, maybe I should leave\" or \"Stay put\". In both options, he quickly finishes his work and then apologizes for making you wait. \"Ask him what he was working on\" (No effect on friendship .) He says \"I do freelance work as a programmer.\" \"Compliment him on his room decor\" (No effect on friendship .) He says \"Decorations?... Oh, yeah… thanks. I’ve been sticking posters on the walls for years, I guess it’s kinda cluttered.\" Sebastian receives a notification from Sam asking to hang out, but Sebastian says would rather not go out. Robin enters his room moments later, telling him that Abigail was looking for him and will stop by later. Sebastian asks whether Robin told her that he was working, and Robin says yes, but Abigail decided that she would probably stop by anyway. Robin leaves the room, and Sebastian expresses his irritation that nobody takes his job seriously. \"Ask him about his career goals\" (No effect on friendship .) He says he’s saving up to move to the city. He says he prefers working as a freelance programmer because he isn’t part of the corporate rat race and because he feels more comfortable working behind a computer instead of face to face. \"Ask him why he doesn't want to see his friends\" (No effect on friendship .) He says \"I like having friends, I just need a lot of time alone to balance out the social stuff. Sam’s the opposite… he goes crazy if he’s alone for too long. Maybe that’s why I like computers so much… They’re engaging, straightforward, and unselfish. Quite the opposite of a lot of people I know.\" He then goes back to work, saying \"I need to get this module finished by tomorrow.\"",
    "answer_text": "wait, he needs to finish something",
    "answer_start": 166
  },
  {
    "id": "sam/sam-schedule_winter___saturday.txt",
    "question": "How many hours does sam spend hanging out in his room?",
    "context": "On Winter → Saturday, At 8:00 AM, sam wakes up for the day inside his bedroom and walks just outside to stand by the river in front of haley and emily's house At 11:00 AM, sam walks to a nearby bush and plays his handheld video game in town At 12:30 PM, sam leaves town, goes to his bedroom with sebastian to practice guitar At 3:00 PM, sam hangs out in his room with sebastian At 6:00 PM, sam leaves his home to walk to the river in front of his house with sebastian At 7:40 PM, sam returns to his bedroom to go to bed.",
    "answer_text": "3:00 PM",
    "answer_start": 328
  },
  {
    "id": "haley/haley-heart_event_eight_hearts.txt",
    "question": "What does Haley ask you to take photos with?",
    "context": "At Eight Hearts, if the condition \"On a sunny day during any season except Winter, enterCindersap Forestbetween 10 AM and 4 PM.\" is met, the event is as follows: You meet Haley at Marnie's ranch as she's taking photos. She asks you to take some pictures with her, and asks how to approach a cow. She climbs on one, falls off and gets covered in dirt. Haley giggles and leaves to take a shower. The next morning, Haley will write you a letter that says: “ “[Player], I thought it would be fun to write you a note. I had so much fun with the cows yesterday... I'm starting to understand why you chose the farmer's life! Hope to see you soon. -Haley”",
    "answer_text": "how to approach a cow",
    "answer_start": 273
  },
  {
    "id": "haley/haley-schedule_spring___wednesday__no_player_has_6_hearts_with_haley_or_alex_.txt",
    "question": "How many hours does it take for Haley to go to bed?",
    "context": "On Spring → Wednesday (No player has 6 hearts with Haley or Alex), At 9:00 AM, haley in her room At 12:10 PM, haley in the living room At 4:30 PM, haley moves to the kitchen At 8:00 PM, haley returns to her room At 10:30 PM, haley goes to bed.",
    "answer_text": "10:30 PM",
    "answer_start": 215
  },
  {
    "id": "harvey/harvey-love_gifts.txt",
    "question": "What is the name of the gift Harvey loves?",
    "context": "harvey loves the following gifts: Coffee (It smells delicious. This is sure to give you a boost.), Pickles (A jar of your home-made pickles.), Super Meal (It's a really energizing meal.), Truffle Oil (A gourmet cooking ingredient.), Wine (Drink in moderation.).",
    "answer_text": "Coffee (It smells delicious.",
    "answer_start": 34
  },
  {
    "id": "haley/haley-schedule_summer___green_rain__year_1_.txt",
    "question": "What is the name of the saloon that Haley is in?",
    "context": "On Summer → Green Rain (Year 1), At All day, haley in the stardrop saloon.",
    "answer_text": "stardrop",
    "answer_start": 58
  },
  {
    "id": "sebastian/sebastian-schedule_spring___rain__option_1_.txt",
    "question": "What time does sebastian get out of bed and leaves the house?",
    "context": "On Spring → Rain (Option 1), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and leaves house to go to the beach At 1:30 PM, sebastian standing at the end of long pier furthest west of the fish shop At 5:00 PM, sebastian leaves the pier to go home At 7:40 PM, sebastian arrives home and goes to bed.",
    "answer_text": "10:30 AM",
    "answer_start": 65
  },
  {
    "id": "elliott/elliott-dislike_gifts.txt",
    "question": "What does elliott dislike?",
    "context": "elliott dislikes the following gifts: Chanterelle (A tasty mushroom with a fruity smell and slightly peppery flavor.), Common Mushroom (Slightly nutty, with good texture.), Daffodil (A traditional spring flower that makes a nice gift.), Dandelion (Not the prettiest flower, but the leaves make a good salad.), Ginger (This sharp, spicy root is said to increase vitality.), Hazelnut (That's one big hazelnut!), Holly (The leaves and bright red berries make a popular winter decoration.), Leek (A tasty relative of the onion.), Magma Cap (A very rare mushroom that lives next to pools of lava.), Morel (Sought after for its unique nutty flavor.), Pizza (It's popular for all the right reasons.), Purple Mushroom (A rare mushroom found deep in caves.), Snow Yam (This little yam was hiding beneath the snow.), Wild Horseradish (A spicy root found in the spring.), Winter Root (A starchy tuber.).",
    "answer_text": "Chanterelle",
    "answer_start": 38
  },
  {
    "id": "abigail/abigail-schedule_spring___spring_15__bus_service_restored_.txt",
    "question": "When does abigail start walking back to the bus?",
    "context": "On Spring → Spring 15 (Bus Service Restored), At 10:10 AM, abigail boards the bus to calico desert to attend the desert festival At 11:00 AM, abigail stands at the cliffside west of the cactus stand At 1:30 AM, abigail starts walking back to the bus.",
    "answer_text": "At 1:30 AM",
    "answer_start": 199
  },
  {
    "id": "abigail/abigail-schedule_winter___rain__option_1_.txt",
    "question": "What time does abigail go to the kitchen?",
    "context": "On Winter → Rain (Option 1), At 9:00 AM, abigail in her room At 11:00 AM, abigail leaves her room to stand in pierre's general store At 1:00 PM, abigail goes to the kitchen At 3:00 PM, abigail returns to her room At 10:00 PM, abigail goes to bed.",
    "answer_text": "3:00 PM",
    "answer_start": 176
  },
  {
    "id": "abigail/abigail-heart_event_four_hearts.txt",
    "question": "How many friendships does Abigail have at Four Hearts?",
    "context": "At Four Hearts, if the condition \"Visitthe mountainbetween noon and 7pm on a rainy day, any season except Winter.\" is met, the event is as follows: You see Abigail playing her flute. She asks what you're doing out in the rain. \"Just doing some work.\" (No effect on friendship .) \"Enjoying the weather.\" (+50 friendship .) \"I could ask you the same question.\" (+10 friendship .) Regardless of your response, she invites you to stand under the tree with her. You pull out a lyre (Abigail calls it \"a mini harp!\") and you play a duet as the camera pans out over the lake. Note that if the player has cut down the tree near the mountain lake it will not be present during the 4 heart event, but Abigail will still reference the tree during the dialogue.",
    "answer_text": "+10 friendship",
    "answer_start": 360
  },
  {
    "id": "maru/maru-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the player does not have a Rabbit's Foot in inventory?",
    "context": "At Group Ten-Heart Event, if the condition \"If the player is unmarried and has given a bouquet to all available bachelorettes, raisedfriendshipwith each bachelorette to 10 hearts, and seen each bachelorette's 10-heart event, then enteringHaley/Emily's Housewill trigger a cutscene. IfHaleyis the final bachelorette you share a Ten-Heart Event with, the Group Ten-Heart Event will be unavoidable as it is triggered immediately afterwards.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a gossip session about Mayor Lewis and Marnie 's relationship. If the player does not have a Rabbit's Foot in inventory, all bachelorettes will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelorettes will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelorettes will forgive the player, and dialogues return to normal.",
    "answer_text": "all bachelorettes will express anger",
    "answer_start": 670
  },
  {
    "id": "sam/sam-hate_gifts.txt",
    "question": "Who hates the following gifts: Bone Fragment (A small piece of bone.), Cinder Shard (You can feel a warm glow from within this stone.), Coal (A combustible rock that is useful for crafting and smelting.), Copper Bar (A bar of pure copper.), Duck Mayonnaise (It's",
    "context": "sam hates the following gifts: Bone Fragment (A small piece of bone.), Cinder Shard (You can feel a warm glow from within this stone.), Coal (A combustible rock that is useful for crafting and smelting.), Copper Bar (A bar of pure copper.), Duck Mayonnaise (It's a rich, yellow mayonnaise.), Gold Bar (A bar of pure gold.), Gold Ore (A precious ore that can be smelted into bars.), Iridium Bar (A bar of pure iridium.), Iridium Ore (An exotic ore with many curious properties. Can be smelted into bars.), Iron Bar (A bar of pure iron.), Mayonnaise (It looks spreadable.), Pickles (A jar of your home-made pickles.), Refined Quartz (A more pure form of quartz.).",
    "answer_text": "sam",
    "answer_start": 0
  },
  {
    "id": "maru/maru-schedule_fall___monday_and_sunday.txt",
    "question": "How many hours does it take for maru to arrive at home?",
    "context": "On Fall → Monday and Sunday, At 9:00 AM, maru in her bedroom At 10:20 AM, maru in the lab At 1:30 PM, maru leaving house to go sit on a bench in front of the saloon At 3:20 PM, maru sitting on a bench in front of the stardrop saloon At 6:30 PM, maru heads home At 8:10 PM, maru arrives at home.",
    "answer_text": "8:10 PM",
    "answer_start": 264
  },
  {
    "id": "sam/sam-heart_event_fourteen_hearts.txt",
    "question": "Who plays a video of Sam's song?",
    "context": "At Fourteen Hearts, if the condition \"Part 1:Enter an upgraded farmhouse (needs to be upgraded at least twice) between 6:10am and 5:00pm, when Sam is inside.Part 2:Three days later, enter the farmhouse between 6:10am and 5pm, when Sam is inside.Part 3:Three days later, enter the farmhouse between 6:10am and 5pm, when Sam is inside.Part 4:Four days later, enter the farmhouse between 6:10am and 5pm, when Sam is inside.\" is met, the event is as follows: Part 1: Sam says he feels like he's gotten lazy since moving into the farmhouse and he wants to find some work -- something to do with music. Part 2: Sam receives a job offer in the mail, making music for a kids' TV show called \"The Happy Junimo Show\".  He says it's not exactly what he had in mind. Just think of this as a stepping stone in your career... (No effect on friendship .) Sam responds \"Hmm... Yeah, I guess that's one way to look at it.\" Just think of how happy you'll make the children! (No effect on friendship .) Sam responds \"I mean... you're right, someone's gotta make children's music. But it's not exactly a 'dream job'...\" I'm sorry... (No effect on friendship .) Sam responds \"Ah well... that's okay. I'll make the best of it, like I always do.\" Sam continues by saying \"I guess I'd better start 'thinking like a kid'...\" That should be easy for you... (No effect on friendship .) Sam exclaims \"Hey!\" while the player giggles. You could ask your little brother for help! (No effect on friendship .) Sam says that's not a bad idea and thanks the player for the advice. Part 3: Sam is making progress on the song, and plays what he has written so far on an acoustic guitar.  He feels positive about the job, and hopes the studio is happy with his song when it's finished. Part 4: The player, Vincent , and Jas gather around a TV set in Sam's room in the farmhouse.  Sam plays a video of his song.  Afterward, he expresses surprise at how much Vincent and Jas love it.  He thanks the player for the support and gives a Sam's Boombox so the player can listen to the song anytime.",
    "answer_text": "Vincent , and Jas",
    "answer_start": 1768
  },
  {
    "id": "sebastian/sebastian-schedule_winter___rain__option_2_.txt",
    "question": "How many hours does sebastian spend at the saloon?",
    "context": "On Winter → Rain (Option 2), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaving house to go to the saloon At 5:20 PM, sebastian at the saloon, standing by red sofa in arcade At 9:10 PM, sebastian heads home At 11:10 PM, sebastian arrives home.",
    "answer_text": "5:20 PM",
    "answer_start": 186
  },
  {
    "id": "leah/leah-schedule_spring___regular_schedule.txt",
    "question": "What time does leah go to bed for the night?",
    "context": "On Spring → Regular Schedule, At 9:00 AM, leah sculpts in her cottage At 12:00 PM, leah walks to the edge of the river near the island southwest of her cottage At 3:00 PM, leah walks to the end of the pier over the forest pond and draws At 6:30 PM, leah walks to the west side of the forest pond At 7:30 PM, leah walks back to her cottage and stands in front of her bookcase At 10:00 PM, leah stands at the table in her house At 12:00 AM, leah goes to bed for the night.",
    "answer_text": "12:00 AM",
    "answer_start": 429
  },
  {
    "id": "alex/alex-schedule_winter___wednesday__no_player_has_6_hearts_with_haley_or_alex_.txt",
    "question": "How many hours does it take Alex to go outside and stand beneath nearby tree?",
    "context": "On Winter → Wednesday (No player has 6 hearts with Haley or Alex), At 8:00 AM, alex leaves his room to go outside and stand beneath nearby tree At 12:00 PM, alex goes to haley and emily's house At 4:30 PM, alex leaves haley and emily's house to go stand by the dog pen At 6:40 PM, alex goes back into his house and stands in the entryway At 8:00 PM, alex goes to his room and stands by his dresser At 10:00 PM, alex goes to bed.",
    "answer_text": "8:00 AM",
    "answer_start": 70
  },
  {
    "id": "sebastian/sebastian-schedule_fall___fall_11_and_25__any_player_has_at_least_6_hearts_with_sebastian_.txt",
    "question": "How many hours does sebastian spend in his bed?",
    "context": "On Fall → Fall 11 and 25 (Any player has at least 6 hearts with Sebastian), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaves his computer and goes to the kitchen At 3:30 PM, sebastian leaves the kitchen to go back to his room At 4:10 PM, sebastian on his computer At 6:30 PM, sebastian leaves home and walks to lake next to his house to smoke At 7:30 PM, sebastian smoking by the lake next to his house At 9:30 PM, sebastian goes back to his house.",
    "answer_text": "9:00 AM",
    "answer_start": 79
  },
  {
    "id": "harvey/harvey-heart_event_ten_hearts.txt",
    "question": "How long does it take Harvey to board the hot air balloon?",
    "context": "At Ten Hearts, if the condition \"Harvey sends you a letter asking to meet at therailroad tracks. Go there between 9am and 5pm.\" is met, the event is as follows: When you meet him there, he says he's glad you came and that something should be happening very soon. A man in a hot air balloon, Marcello, lands nearby, says the balloon is yours for the next two hours, and heads into town for the Stardrop Saloon . Harvey tells you that he saw the hot air balloon rental advertised in the newspaper and thought it was a perfect thing to do together. Before hopping in, you can either immediately get to it or ask him why he did this since you know about his incredible fear of heights. If you opt to ask him, he bashfully explains that while his fear is still a major factor, he admires you and your courage and says that it should be more than enough for the both of you. Boarding the hot air balloon, Harvey switches on the burner below to make it ascend but freaks out once he realizes how fast it's rising. High in the sky, his mood oscillates between fear and elation, eventually coming to his senses and remembering that you're there with him. He marvels at how much he can see below and is glad that he's doing this with you. Soon before the two-hour rental is up, you draw close into a kiss. You return the balloon to the rental man at least a half hour late.",
    "answer_text": "two hours",
    "answer_start": 354
  },
  {
    "id": "penny/penny-schedule_spring___tuesday__wednesday_and_friday.txt",
    "question": "How many hours does it take to walk to marnie's ranch?",
    "context": "On Spring → Tuesday, Wednesday and Friday, At 9:00 AM, penny leaves her trailer and goes to the museum/library to tutor jas and vincent At 2:00 PM, penny leaves the library and stands near the ice cream stand watching over jas and vincent At 4:20 PM, penny walks vincent to 1 willow lane and says goodbye At 5:50 PM, penny walks jas to marnie's ranch and says goodbye At 6:30 PM, penny returns to her trailer for the evening.",
    "answer_text": "5:50 PM",
    "answer_start": 308
  },
  {
    "id": "haley/haley-schedule_marriage___monday.txt",
    "question": "What time does Haley arrive at 2 willow lane?",
    "context": "On Marriage → Monday, At 6:00 AM, haley at home At 9:30 AM, haley starts leaving home At 10:40 AM, haley arrives at 2 willow lane At 3:40 PM, haley starts leaving 2 willow lane At 5:00 PM, haley goes back home At 10:00 PM, haley goes to bed.",
    "answer_text": "3:40 PM",
    "answer_start": 133
  },
  {
    "id": "penny/penny-schedule_winter___rain__option_2_.txt",
    "question": "How many hours does it take to go to the museum?",
    "context": "On Winter → Rain (Option 2), At 8:10 AM, penny leaves the trailer and walks to the museum to sit outside At 12:00 PM, penny goes inside the museum to look at the bookshelves At 4:00 PM, penny leaves the museum and returns to the trailer to watch some television At 7:00 PM, penny moves over to the sink in the trailer to do some dishes At 9:00 PM, penny goes to bed for the evening.",
    "answer_text": "4:00 PM",
    "answer_start": 177
  },
  {
    "id": "penny/penny-schedule_winter___winter_15.txt",
    "question": "What time does Penny go to bed for the evening?",
    "context": "On Winter → Winter 15, At 9:00 AM, penny trailer is unlocked. penny is in her bedroom At 11:00 AM, penny moves to the kitchen At 1:00 PM, penny does some dishes At 3:00 PM, penny sits on the couch, probably watching tv At 4:00 PM, penny attends the night market At 11:50 PM, penny goes to bed for the evening.",
    "answer_text": "11:50 PM",
    "answer_start": 265
  },
  {
    "id": "sam/sam-schedule_summer___green_rain__year_1_.txt",
    "question": "What is the name of the character who is in the living room?",
    "context": "On Summer → Green Rain (Year 1), At All day, sam in the living room.",
    "answer_text": "sam",
    "answer_start": 45
  },
  {
    "id": "penny/penny-schedule_summer___summer_9_and_23.txt",
    "question": "How many hours does it take to get to the saloon?",
    "context": "On Summer → Summer 9 and 23, At 6:00 AM, penny sleeps in her bed in the trailer At 8:00 AM, penny leaves her trailer and goes outside to read near the town graveyard At 12:30 PM, penny returns to the trailer to wash dishes At 4:00 PM, penny leaves the trailer again to go outside the saloon where she sits on a bench with maru At 6:40 PM, penny returns to her trailer for the evening.",
    "answer_text": "6:40 PM",
    "answer_start": 330
  },
  {
    "id": "alex/alex-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the player does not have a Rabbit's Foot in inventory?",
    "context": "At Group Ten-Heart Event, if the condition \"If the player is unmarried and has given a bouquet to all available bachelors, raisedfriendshipwith each bachelor to 10 hearts, and seen each bachelor's 10-heart event, then enteringThe Stardrop Saloonwill trigger a cutscene. IfAlexis the final bachelor you share a Ten-Heart Event with, the Group Ten-Heart Event will be unavoidable as it is triggered immediately afterwards.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a friendly game of pool. If the player does not have a Rabbit's Foot in inventory, all bachelors will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelors will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelors will forgive the player, and dialogues return to normal.",
    "answer_text": "all bachelors will express anger about the player dating them all at one time",
    "answer_start": 615
  },
  {
    "id": "alex/alex-schedule_spring___wednesday__no_player_has_6_hearts_with_haley_or_alex_.txt",
    "question": "How many hours does it take Alex to go outside and stand beneath a tree?",
    "context": "On Spring → Wednesday (No player has 6 hearts with Haley or Alex), At 8:00 AM, alex leaves his room to go outside and stand beneath nearby tree At 12:00 PM, alex goes to haley and emily's house At 4:30 PM, alex leaves haley and emily's house to go stand by the dog pen At 6:40 PM, alex goes back into his house and stands in the entryway At 8:00 PM, alex goes to his room and stands by his dresser At 10:00 PM, alex goes to bed.",
    "answer_text": "8:00 AM",
    "answer_start": 70
  },
  {
    "id": "shane/shane-schedule_marriage___friday.txt",
    "question": "How many hours does shane spend standing by the river?",
    "context": "On Marriage → Friday, At 6:00 AM, shane at home At 8:30 AM, shane leaves home and heads for the river in pelican town At 10:00 AM, shane standing by river At 1:00 PM, shane leaves the river and heads to pierre's general store At 5:00 PM, shane leaves pierre's general store and heads to the stardrop saloon At 10:00 PM, shane leaves the stardrop saloon and heads back home.",
    "answer_text": "1:00 PM",
    "answer_start": 158
  },
  {
    "id": "sebastian/sebastian-schedule_winter___regular_schedule.txt",
    "question": "What time does sebastian go back to his house?",
    "context": "On Winter → Regular Schedule, At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaves his computer and goes to the kitchen At 3:30 PM, sebastian leaves the kitchen to go back to his room At 4:10 PM, sebastian on his computer At 6:30 PM, sebastian leaves home and walks to lake next to his house to smoke At 7:30 PM, sebastian smoking by the lake next to his house At 9:30 PM, sebastian goes back to his house.",
    "answer_text": "9:30 PM",
    "answer_start": 438
  },
  {
    "id": "leah/leah-schedule_winter___regular_schedule.txt",
    "question": "How many hours does Leah spend painting in her cottage?",
    "context": "On Winter → Regular Schedule, At 9:00 AM, leah sculpts in her cottage At 12:00 PM, leah moves to her easel to paint At 2:00 PM, leah stands in front of the bookcase in her cottage At 4:00 PM, leah leaves her cottage and walks to the stardrop saloon At 11:40 PM, leah leaves the saloon to return home and sleep.",
    "answer_text": "12:00 PM",
    "answer_start": 73
  },
  {
    "id": "maru/maru-schedule_summer___green_rain__year_1_.txt",
    "question": "What is the name of the character who is in Sebastian's room?",
    "context": "On Summer → Green Rain (Year 1), At All day, maru in sebastian's room.",
    "answer_text": "maru",
    "answer_start": 45
  },
  {
    "id": "sam/sam-schedule_summer___saturday.txt",
    "question": "How many hours does sam spend hanging out in his room?",
    "context": "On Summer → Saturday, At 8:00 AM, sam wakes up for the day inside his bedroom and walks just outside to stand by the river in front of haley and emily's house At 11:00 AM, sam walks to a nearby bush and plays his handheld video game in town At 12:30 PM, sam leaves town, goes to his bedroom with sebastian to practice guitar At 3:00 PM, sam hangs out in his room with sebastian At 6:00 PM, sam leaves his home to walk to the river in front of his house with sebastian At 7:40 PM, sam returns to his bedroom to go to bed.",
    "answer_text": "3:00 PM",
    "answer_start": 328
  },
  {
    "id": "haley/haley-heart_event_ten_hearts.txt",
    "question": "How many friendships does Haley have at Ten Hearts?",
    "context": "At Ten Hearts, if the condition \"EnterHaley's housewhen she's there.\" is met, the event is as follows: Haley shows you her dark room for developing photos. \"It looks great!\" (+10 friendship .) \"What does it do?\" (No effect on friendship .) \"I've seen better.\" (-50 friendship .) Haley asks what you want to do now. Offer to help decorate the dark room. (No effect on friendship .) Ends the scene and disappoints Haley. If you talk to her immediately after the cutscene, she says \"Well the dark room looks great now, thanks <your name>\" with her annoyed portrait. Make an excuse and leave. (No effect on friendship .) The player leaves the room, leaving Haley alone. Haley states that she didn't think the player was that dense. Ending the scene. If you talk to Haley immediately after the cutscene, she says \"I thought you had more important things to do...\" with her annoyed portrait. Try to kiss her. (No effect on friendship .) Haley responds, \"Oh, <your name>... I've been waiting so long for you to do that. One moment...\" She flips a switch, the room goes mostly black except where you and Haley are standing, and you both lean in close for a kiss as the cutscene ends. If you talk to her immediately after the cutscene, she says \"That was nice\" with her red/blushing portrait.",
    "answer_text": "50 friendship",
    "answer_start": 262
  },
  {
    "id": "haley/haley-schedule_marriage___spring_16__bus_service_restored_.txt",
    "question": "What is the name of the festival that Haley attends?",
    "context": "On Marriage → Spring 16 (Bus Service Restored), At 9:00 AM, haley leaves home to attend the desert festival and sunbathe on the cliff south of the oasis At 9:00 PM, haley heads home.",
    "answer_text": "desert festival",
    "answer_start": 92
  },
  {
    "id": "alex/alex-schedule_marriage___sunday__alex_s_14-heart_event_seen_.txt",
    "question": "What time does Alex leave for the farmhouse?",
    "context": "On Marriage → Sunday (Alex's 14-heart event seen), At 8:30 AM, alex leaves farm to go stand beneath a tree by his grandparent's house At 11:00 AM, alex goes to the back room of the stardrop saloon At 3:00 PM, alex leaves to stand by the dog kennel At 6:30 PM, alex goes inside of his grandparent's house and stands in the entryway At 8:00 PM, alex goes to stand inside of his room At 10:00 PM, alex leaves for the farmhouse.",
    "answer_text": "10:00 PM",
    "answer_start": 384
  },
  {
    "id": "elliott/elliott-heart_event_fourteen_hearts.txt",
    "question": "What will happen if there are no Festivals occurring for the next 8 days?",
    "context": "At Fourteen Hearts, if the condition \"Exit the farm house between 6am and 3pm on a day when there are noFestivalsoccurring for the next 8 days.\" is met, the event is as follows: Elliott will be on the front porch when the player leaves the farmhouse. Elliott will send the player letters in the mail daily for a full week while he is touring for his book signing. On the second day of the week of his absence, one Crab Cakes will appear in the player's fridge or Mini-Fridge if there is available space. On the 8th day, he will arrive back at the farmhouse, and the last part of the event will trigger as soon as the player wakes up.",
    "answer_text": "Fourteen Hearts",
    "answer_start": 3
  },
  {
    "id": "abigail/abigail-schedule_summer___sunday.txt",
    "question": "How many hours does it take for abigail to arrive home?",
    "context": "On Summer → Sunday, At 10:30 AM, abigail leaves her room to go into caroline and pierre's room At 1:00 PM, abigail leaves home, walks to the wizard's tower At 4:00 PM, abigail standing in front of the wizard's tower in cindersap forest At 8:00 PM, abigail heads home At 10:30 PM, abigail arrives home.",
    "answer_text": "10:30 PM",
    "answer_start": 270
  },
  {
    "id": "haley/haley-schedule_summer___rain.txt",
    "question": "What time does Haley wake up and stands by her dresser in her bedroom?",
    "context": "On Summer → Rain, At 10:30 AM, haley wakes up and stands by her dresser in her bedroom At 11:30 AM, haley moves to the vanity mirror in her bedroom At 12:00 PM, haley leaves her room to go to the kitchen At 4:00 PM, haley returns to her room At 7:00 PM, haley leaves her room and stands in the living room At 10:00 PM, haley goes to bed.",
    "answer_text": "10:30 AM",
    "answer_start": 21
  },
  {
    "id": "emily/emily-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the player does not have a Rabbit's Foot in inventory?",
    "context": "At Group Ten-Heart Event, if the condition \"If the player is unmarried and has given a bouquet to all available bachelorettes, raisedfriendshipwith each bachelorette to 10 hearts, and seen each bachelorette's 10-heart event, then enteringHaley/Emily's Housewill trigger a cutscene. IfHaleyis the final bachelorette you share a Ten-Heart Event with, the Group Ten-Heart Event will be unavoidable as it is triggered immediately afterwards.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a gossip session about Mayor Lewis and Marnie 's relationship. If the player does not have a Rabbit's Foot in inventory, all bachelorettes will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelorettes will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelorettes will forgive the player, and dialogues return to normal.",
    "answer_text": "all bachelorettes will express anger about the player dating them all at one time",
    "answer_start": 670
  },
  {
    "id": "sam/sam-schedule_fall___regular_schedule.txt",
    "question": "How many hours does Sam wake up for the day?",
    "context": "On Fall → Regular Schedule, At 10:00 AM, sam wakes up for the day, moves around his room At 10:40 AM, sam plays guitar inside his bedroom At 1:20 PM, sam leaves his bedroom walks to the forest southwest of leah's cottage At 7:00 PM, sam returns home from the forest At 9:00 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 31
  },
  {
    "id": "harvey/harvey-schedule_spring___tuesday_and_thursday.txt",
    "question": "How many hours does Harvey work at the clinic's front desk?",
    "context": "On Spring → Tuesday and Thursday, At 7:30 AM, harvey in exam room of clinic At 12:50 PM, harvey moves to waiting room At 1:30 PM, harvey returns to exam room At 4:30 PM, harvey works at the clinic's front desk At 6:00 PM, harvey goes up to his room, stands in front of bookshelf At 11:00 PM, harvey goes to bed.",
    "answer_text": "6:00 PM",
    "answer_start": 213
  },
  {
    "id": "abigail/abigail-schedule_summer___rain__option_1_.txt",
    "question": "What time does abigail go to the kitchen?",
    "context": "On Summer → Rain (Option 1), At 9:00 AM, abigail in her room At 11:00 AM, abigail leaves her room to stand in pierre's general store At 1:00 PM, abigail goes to the kitchen At 3:00 PM, abigail returns to her room At 10:00 PM, abigail goes to bed.",
    "answer_text": "3:00 PM",
    "answer_start": 176
  },
  {
    "id": "haley/haley-heart_event_six_hearts.txt",
    "question": "What is the name of Haley's great grandmother?",
    "context": "At Six Hearts, if the condition \"Go tothe beachbetween 10 AM and 4 PM during any season except Winter.\" is met, the event is as follows: You find Haley grieving after losing her bracelet. \"Relax, I'll just buy you a new one!\" (-30 friendship .) Haley responds: \"No, you won't! This bracelet was passed down to me by my great-grandmother!\" \"I'm really sorry...\" (+50 friendship .) Haley responds: \"*sigh* ...Maybe it'll wash up on another shore. I can't bear to think of it at the bottom of the ocean.\" After choosing an answer, Haley reveals that the bracelet belonged to her great grandmother. The bracelet is located to the right of Elliott's cabin behind a shrub. After returning the bracelet, Haley hugs you and says she won't forget what you've done.",
    "answer_text": "Elliott's cabin",
    "answer_start": 635
  },
  {
    "id": "abigail/abigail-schedule_summer___friday.txt",
    "question": "What time does abigail leave home to go to the stardrop saloon?",
    "context": "On Summer → Friday, At 9:00 AM, abigail leaving her room to go to the kitchen At 11:00 AM, abigail leaves the kitchen to stand in pierre's general store At 3:00 PM, abigail leaving home to go to the the stardrop saloon At 3:50 PM, abigail in the stardrop saloon, sitting on a sofa in the arcade At 9:00 PM, abigail heads home At 9:40 PM, abigail arrives home.",
    "answer_text": "3:50 PM",
    "answer_start": 222
  },
  {
    "id": "sebastian/sebastian-heart_event_four_hearts.txt",
    "question": "What is the condition for Sebastian to go to The Mountain?",
    "context": "At Four Hearts, if the condition \"Go toThe Mountainbetween 11am and 5pm.\" is met, the event is as follows: You see Sebastian working on a motorcycle in the garage at his house. He explains that it belongs to him and sometimes he goes for long rides alone far away from Stardew Valley. He suggests the possibility of you one day taking a ride with him, to which you agree or disagree. That sounds fun. (No effect on friendship .) Sebastian responds \"Great.\" No thanks. That sounds stupid. (No effect on friendship .) Sebastian responds \"Okay... Nevermind then.\" I'm scared of motorcycles. (No effect on friendship .) Sebastian responds with one of two dialogues, depending on the Player 's gender: \"Don't worry, I'll make sure to show you the ropes before I let you do anything dangerous.\" \"There's no need to worry... I'll make sure you're safe.\"",
    "answer_text": "between 11am and 5pm.",
    "answer_start": 51
  },
  {
    "id": "harvey/harvey-schedule_summer___tuesday_and_thursday.txt",
    "question": "What time does harvey go to bed?",
    "context": "On Summer → Tuesday and Thursday, At 7:30 AM, harvey in exam room of clinic At 12:50 PM, harvey moves to waiting room At 1:30 PM, harvey returns to exam room At 4:30 PM, harvey works at the clinic's front desk At 6:00 PM, harvey goes upstairs to his room, reads in front of bookshelf At 11:00 PM, harvey goes to bed.",
    "answer_text": "11:00 PM",
    "answer_start": 287
  },
  {
    "id": "maru/maru-schedule_spring___tuesday_and_thursday.txt",
    "question": "How many hours does maru work at Harvey's clinic?",
    "context": "On Spring → Tuesday and Thursday, At 8:00 AM, maru leaves home and heads to harvey's At 9:20 AM, maru working at harvey's clinic as a nurse At 4:45 PM, maru leaves harvey's and heads home At 6:30 PM, maru at home, in the kitchen At 10:20 PM, maru in her room At 12:00 AM, maru goes to bed.",
    "answer_text": "4:45 PM",
    "answer_start": 143
  },
  {
    "id": "leah/leah-heart_event_fourteen_hearts.txt",
    "question": "How many days does it take to paint a portrait of Marnie?",
    "context": "At Fourteen Hearts, if the condition \"Exit the farmhouse between 6am and 8:20am on a sunny day that isn't Sunday and isn't in winter.\" is met, the event is as follows: Leah meets the player outside the farmhouse in the morning. Part 2: The next sunny day (or any sunny day after that), enter the Forest between 11:30 am and 2:00pm. Leah has asked you to paint a portrait of Marnie with her. Leah asks you what style of portrait she should paint. \"Hey, <your name>... what style do you think I should do? I'm up for anything...\" Classic country portrait (No effect on friendship .) Colorful, retro pop-art (No effect on friendship .) Minimalist modern (No effect on friendship .) She then asks how yours is coming along. It's a masterpiece of fine art! (No effect on friendship .) I'm trying my best... (No effect on friendship .) It looks like chicken scratch (No effect on friendship .) Leah shows you her painting, which is different depending on which option you picked. (Left to right: \"Classic country portrait\", \"Colorful, retro pop-art\", \"Minimalist modern\") You display your painting as well, which is less than flattering. Leah tells Marnie that she can keep both paintings, but Marnie says that you should keep your first painting - and only takes Leah's. The sequence ends, and you now have My First Painting in your inventory. Leah's painting will also appear in Marnie's bedroom.",
    "answer_text": "only takes Leah's",
    "answer_start": 1247
  },
  {
    "id": "abigail/abigail-schedule_winter___winter_11_and_25__no_player_has_6_hearts_with_sebastian_or_abigail_.txt",
    "question": "How many hours does it take for abigail to leave pierre's store?",
    "context": "On Winter → Winter 11 and 25 (No player has 6 hearts with Sebastian or Abigail), At 9:00 AM, abigail in bed At 10:30 AM, abigail leaves pierre's store At 12:00 PM, abigail arrives in sebastian’s room At 5:00 PM, abigail leaves sebastian’s room At 6:30 PM, abigail returns home At 6:50 PM, abigail back in room.",
    "answer_text": "12:00 PM",
    "answer_start": 154
  },
  {
    "id": "maru/maru-hate_gifts.txt",
    "question": "What is the name of the gift that maru hates?",
    "context": "maru hates the following gifts: Holly (The leaves and bright red berries make a popular winter decoration.), Honey (It's a sweet syrup produced by bees.), Pickles (A jar of your home-made pickles.), Snow Yam (This little yam was hiding beneath the snow.), Truffle (A gourmet type of mushroom with a unique taste.).",
    "answer_text": "Holly (The leaves and bright red berries make a popular winter decoration",
    "answer_start": 32
  },
  {
    "id": "sam/sam-love_gifts.txt",
    "question": "Which of the following is not a gift: Cactus Fruit or Maple Bar?",
    "context": "sam loves the following gifts: Cactus Fruit (The sweet fruit of the prickly pear cactus.), Maple Bar (It's a sweet doughnut topped with a rich maple glaze.), Pizza (It's popular for all the right reasons.), Tigerseye (A stripe of shimmering gold gives this gem a warm luster.).",
    "answer_text": "sam",
    "answer_start": 0
  },
  {
    "id": "penny/penny-schedule_winter___community_center_restored.txt",
    "question": "How many hours does it take to wake up and move around the community center?",
    "context": "On Winter → Community Center Restored, At 9:00 AM, penny wakes up and moves around her trailer At 10:30 AM, penny leaves her trailer and walks to the community center to read At 3:00 PM, penny continues moving around the community center At 6:00 PM, penny leaves the community center and returns to the trailer to do dishes At 9:00 PM, penny goes to bed in her room in the trailer for the evening.",
    "answer_text": "9:00 AM",
    "answer_start": 42
  },
  {
    "id": "elliott/elliott-schedule_marriage___monday.txt",
    "question": "When does elliott leave the farmhouse?",
    "context": "On Marriage → Monday, At 8:30 AM, elliott leaves the farmhouse and heads to the beach At 5:00 PM, elliott leaves the beach and heads home to the farm.",
    "answer_text": "8:30 AM",
    "answer_start": 25
  },
  {
    "id": "sam/sam-schedule_spring___spring_9_and_23__no_player_has_6_hearts_with_penny_or_sam_.txt",
    "question": "How many hours does sam sleep in his bed?",
    "context": "On Spring → Spring 9 and 23 (No player has 6 hearts with Penny or Sam), At 6:00 AM, sam sleeps in his bed at his home At 9:00 AM, sam wakes up and stands in his bedroom At 11:00 AM, sam walks into town, stands on the bridge near the ice cream stand At 4:00 PM, sam walk to the pink tree in front of 2 willow lane, plays his handheld video game At 7:00 PM, sam returns home from town At 9:30 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "6:00 AM",
    "answer_start": 75
  },
  {
    "id": "elliott/elliott-schedule_summer___rain.txt",
    "question": "What is the name of the character who is inside his house?",
    "context": "On Summer → Rain, At All day, elliott inside his house.",
    "answer_text": "elliott",
    "answer_start": 30
  },
  {
    "id": "abigail/abigail-like_gifts.txt",
    "question": "What kind of gift does abigail like?",
    "context": "abigail likes the following gifts: Ancient Sword (It's the remains of an ancient sword. Most of the blade has turned to rust, but the hilt is very finely crafted.), Basilisk Paw (You are immune to debuffs.), Bone Flute (It's a prehistoric wind instrument carved from an animal's bone. It produces an eerie tone.), Combat Quarterly (Read this to gain some combat experience.), Quartz (A clear crystal commonly found in caves and mines.).",
    "answer_text": "Ancient Sword",
    "answer_start": 35
  },
  {
    "id": "sebastian/sebastian-heart_event_group_ten-heart_event.txt",
    "question": "What will happen if the player does not have a Rabbit's Foot in inventory?",
    "context": "At Group Ten-Heart Event, if the condition \"If the player is unmarried and has given a bouquet to all available bachelors, raisedfriendshipwith each bachelor to 10 hearts, and seen each bachelor's 10-heart event, then enteringThe Stardrop Saloonwill trigger a cutscene. IfAlexis the final bachelor you share a Ten-Heart Event with, the Group Ten-Heart Event will be unavoidable as it is triggered immediately afterwards.\" is met, the event is as follows: If the player has a Rabbit's Foot in inventory, the cutscene will consist of a friendly game of pool. If the player does not have a Rabbit's Foot in inventory, all bachelors will express anger about the player dating them all at one time.  Regardless of the player's dialogue choice(s), all bachelors will decide to give the player the \"cold shoulder\" for about a week after the event.  They will give angry dialogue when interacted with, and refuse gifts.  After about a week, all bachelors will forgive the player, and dialogues return to normal.",
    "answer_text": "all bachelors will express anger about the player dating them all at one time",
    "answer_start": 615
  },
  {
    "id": "sebastian/sebastian-schedule_summer___saturday.txt",
    "question": "What is the name of the person who goes home from in front of Sam's house?",
    "context": "On Summer → Saturday, At 9:00 AM, sebastian leaves house to go to sam's house At 11:30 AM, sebastian in front of haley and emily's house with sam At 12:30 PM, sebastian follows sam to his room At 1:00 PM, sebastian in sam's room At 6:00 PM, sebastian leaves sam's house with sam and goes to the river At 6:20 PM, sebastian smoking by the river outside sam's house with him At 7:30 PM, sebastian going home from in front of sam's house At 9:40 PM, sebastian arrives home.",
    "answer_text": "sebastian",
    "answer_start": 34
  },
  {
    "id": "penny/penny-schedule_summer___rain__option_1_.txt",
    "question": "How many hours does it take Penny to go to bed?",
    "context": "On Summer → Rain (Option 1), At 9:00 AM, penny in her bedroom in the trailer At 11:00 AM, penny moves to the kitchen At 1:00 PM, penny does some dishes At 3:00 PM, penny sits on the couch, probably watching tv At 6:00 PM, penny returns to her bedroom, reading by the bookshelf At 9:00 PM, penny goes to bed for the evening.",
    "answer_text": "evening.",
    "answer_start": 315
  },
  {
    "id": "leah/leah-schedule_summer___rain.txt",
    "question": "What time does Leah leave her cottage?",
    "context": "On Summer → Rain, At 9:00 AM, leah sculpts in her cottage At 12:00 PM, leah moves to her easel to paint At 2:00 PM, leah stands in front of the bookcase in her cottage At 4:00 PM, leah leaves her cottage and walks to the stardrop saloon At 11:40 PM, leah leaves the saloon to return home and sleep.",
    "answer_text": "4:00 PM",
    "answer_start": 171
  },
  {
    "id": "penny/penny-schedule_winter___winter_9_and_23.txt",
    "question": "How many hours does it take to sleep in the trailer?",
    "context": "On Winter → Winter 9 and 23, At 6:00 AM, penny sleeps in her bed in the trailer At 8:00 AM, penny leaves her trailer and goes outside to read near the town graveyard At 12:30 PM, penny returns to the trailer to wash dishes At 4:00 PM, penny leaves the trailer again to go outside the saloon where she sits on a bench with maru At 6:40 PM, penny returns to her trailer for the evening.",
    "answer_text": "6:00 AM",
    "answer_start": 32
  },
  {
    "id": "shane/shane-schedule_fall___monday_-_friday.txt",
    "question": "How many hours does shane spend in the kitchen at marnie's ranch?",
    "context": "On Fall → Monday - Friday, At 9:00 AM, shane leaves his room and stands in kitchen at marnie's ranch At 11:00 AM, shane leaves the kitchen and returns to his room At 12:00 PM, shane leaves his room and stands by the fireplace at marnie's ranch At 2:00 PM, shane leaves marnie's ranch and heads to the stardrop saloon At 11:00 PM, shane leaves the stardrop saloon and heads back to marnie's ranch.",
    "answer_text": "Monday - Friday",
    "answer_start": 10
  },
  {
    "id": "sam/sam-schedule_winter___friday.txt",
    "question": "How many hours does sam spend skateboarding outside of his house?",
    "context": "On Winter → Friday, At 10:00 AM, sam wakes up and plays guitar inside his bedroom At 11:00 AM, sam leaves his bedroom and skateboards outside of his house At 3:00 PM, sam walks to the stardrop saloon At 4:00 PM, sam arrives at the stardrop saloon and plays pool near the arcade At 9:20 PM, sam leaves the stardrop saloon and walks home At 10:20 PM, sam arrives at home.",
    "answer_text": "3:00 PM",
    "answer_start": 158
  },
  {
    "id": "sam/sam-schedule_spring___regular_schedule.txt",
    "question": "How many hours does Sam wake up for the day?",
    "context": "On Spring → Regular Schedule, At 10:00 AM, sam wakes up for the day, moves around his room At 10:40 AM, sam plays guitar inside his bedroom At 1:40 PM, sam leaves his bedroom, walks into town, and stands near lewis' house by the river At 6:30 PM, sam returns home from town At 9:00 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "10:00 AM",
    "answer_start": 33
  },
  {
    "id": "alex/alex-dislike_gifts.txt",
    "question": "Which of the following is not a season or event name?",
    "context": "alex dislikes the following gifts: Salmonberry (A spring-time berry with the flavor of the forest.), Wild Horseradish (A spicy root found in the spring.).",
    "answer_text": "alex",
    "answer_start": 0
  },
  {
    "id": "leah/leah-schedule_marriage___spring_15__bus_service_restored_.txt",
    "question": "What is the name of the festival that leah returns home to?",
    "context": "On Marriage → Spring 15 (Bus Service Restored), At 9:00 AM, leah leaves home to head to the desert festival and stand by the fishing pond At 1:20 AM, leah returns home.",
    "answer_text": "desert festival",
    "answer_start": 92
  },
  {
    "id": "penny/penny-schedule_spring___rain__option_1_.txt",
    "question": "How many hours does it take for penny to go to bed?",
    "context": "On Spring → Rain (Option 1), At 9:00 AM, penny in her bedroom in the trailer At 11:00 AM, penny moves to the kitchen At 1:00 PM, penny does some dishes At 3:00 PM, penny sits on the couch, probably watching tv At 6:00 PM, penny returns to her bedroom, reading by the bookshelf At 9:00 PM, penny goes to bed for the evening.",
    "answer_text": "evening.",
    "answer_start": 315
  },
  {
    "id": "penny/penny-schedule_summer___monday_and_thursday.txt",
    "question": "How many hours does it take to arrive at the trailer for the evening?",
    "context": "On Summer → Monday and Thursday, At 8:00 AM, penny wakes up and walks through town to stand by the river behind jojamart At 9:30 AM, penny watching the river behind jojamart At 1:00 PM, penny walks back through town and to the community center At 2:30 PM, penny sitting on a bench to the right of the community center At 6:00 PM, penny leaves town and returns to the trailer At 7:00 PM, penny arrives at the trailer for the evening.",
    "answer_text": "7:00 PM",
    "answer_start": 378
  },
  {
    "id": "abigail/abigail-schedule_winter___regular_schedule.txt",
    "question": "What time does abigail go to bed?",
    "context": "On Winter → Regular Schedule, At 9:00 AM, abigail leaving her room to go to the kitchen At 10:30 AM, abigail walking to the carpenter's shop. stands next to the counter At 2:30 PM, abigail heads back home and plays video games At 7:30 PM, abigail goes to bed.",
    "answer_text": "7:30 PM",
    "answer_start": 230
  },
  {
    "id": "abigail/abigail-dislike_gifts.txt",
    "question": "Which of the following is not a gift Abigail dislikes?",
    "context": "abigail dislikes the following gifts: Sugar (Adds sweetness to pastries and candies. Too much can be unhealthy.), Wild Horseradish (A spicy root found in the spring.).",
    "answer_text": "Wild Horseradish",
    "answer_start": 114
  },
  {
    "id": "sebastian/sebastian-schedule_marriage___friday.txt",
    "question": "How many hours does it take for sebastian to arrive home?",
    "context": "On Marriage → Friday, At 6:00 AM, sebastian at home At 9:00 AM, sebastian leaves to go the beach At 11:00 AM, sebastian standing at the end of the long pier to the left of the fish shop At 3:00 PM, sebastian leaves to go to the stardrop saloon At 4:30 PM, sebastian arrives at the saloon, playing at the pool table with sam At 9:30 PM, sebastian leaves to go home At 10:50 PM, sebastian arrives home.",
    "answer_text": "10:50 PM",
    "answer_start": 367
  },
  {
    "id": "alex/alex-heart_event_fourteen_hearts.txt",
    "question": "How many hearts can be triggered at Fourteen Hearts?",
    "context": "At Fourteen Hearts, if the condition \"Exit theFarmhousein year 2+ between 6am and 8:20am on any day other than Sunday.  You must havedata-sort-value=\"5000\">5,000gavailable.\" is met, the event is as follows: Alex will stop you and ask for data-sort-value=\"5000\"> 5,000g for a 'secret project'. If you accept, he will remark that it will be ready to be seen on Sunday. Part 2 can be triggered by entering the Saloon the following Sunday. Alex, Kent , Shane , George , and Gus can be seen watching a gridball game in the backroom, half of which has been decorated with gridball memorabilia and a TV. The other half still has barrels, and storage. The player walks in, and Alex tells the player that although his dream of going pro may not have been realised (though he assures the farmer that he's happy with his life now), this is a small way of realising it. Kent adds that it takes his mind off things, and Shane agrees. Gus tells the player that watching the game is good for business, too. The cutscene ends with the player saying that the guys have a new tradition now and that the data-sort-value=\"5000\"> 5,000g was well spent.",
    "answer_text": "2+",
    "answer_start": 63
  },
  {
    "id": "emily/emily-schedule_marriage___spring_15__16_and_17__bus_service_restored_.txt",
    "question": "How many days does it take Emily to attend the desert festival?",
    "context": "On Marriage → Spring 15, 16 and 17 (Bus Service Restored), At 8:00 AM, emily leaves home to attend the desert festival and stand at her outfit services At 12:30 AM, emily heads home.",
    "answer_text": "16 and 17",
    "answer_start": 25
  },
  {
    "id": "harvey/harvey-schedule_spring___rain.txt",
    "question": "How many hours does harvey work at the clinic's front desk?",
    "context": "On Spring → Rain, At 8:00 AM, harvey in his room At 8:40 AM, harvey works at the clinic's front desk At 12:00 PM, harvey goes upstairs to his room, sits in front of radio At 4:00 PM, harvey moves to bookshelf to read At 5:30 PM, harvey heads to the stardrop saloon At 10:00 PM, harvey returns home and goes to bed.",
    "answer_text": "8:40 AM",
    "answer_start": 52
  },
  {
    "id": "sam/sam-schedule_winter___winter_9_and_23.txt",
    "question": "How many hours does Sam wake up for the day?",
    "context": "On Winter → Winter 9 and 23, At 10:00 AM, sam wakes up for the day, moves around his room At 10:40 AM, sam plays guitar inside his bedroom At 1:40 PM, sam leaves his bedroom, walks into town, and stands near lewis' house by the river At 6:30 PM, sam returns home from town At 9:00 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "9 and 23",
    "answer_start": 19
  },
  {
    "id": "sam/sam-schedule_fall___fall_9_and_23__no_player_has_6_hearts_with_penny_or_sam_.txt",
    "question": "What time does sam wake up and stands in his bedroom?",
    "context": "On Fall → Fall 9 and 23 (No player has 6 hearts with Penny or Sam), At 6:00 AM, sam sleeps in his bed at his home At 9:00 AM, sam wakes up and stands in his bedroom At 11:00 AM, sam walks into town, stands on the bridge near the ice cream stand At 4:00 PM, sam walk to the pink tree in front of 2 willow lane, plays his handheld video game At 7:00 PM, sam returns home from town At 9:30 PM, sam goes into his bedroom to go to bed.",
    "answer_text": "11:00 AM",
    "answer_start": 168
  },
  {
    "id": "sam/sam-schedule_spring___saturday.txt",
    "question": "How many hours does sam spend hanging out in his room?",
    "context": "On Spring → Saturday, At 8:00 AM, sam wakes up for the day inside his bedroom and walks just outside to stand by the river in front of haley and emily's house At 11:00 AM, sam walks to a nearby bush and plays his handheld video game in town At 12:30 PM, sam leaves town, goes to his bedroom with sebastian to practice guitar At 3:00 PM, sam hangs out in his room with sebastian At 6:00 PM, sam leaves his home to walk to the river in front of his house with sebastian At 7:40 PM, sam returns to his bedroom to go to bed.",
    "answer_text": "3:00 PM",
    "answer_start": 328
  },
  {
    "id": "emily/emily-heart_event_ten_hearts.txt",
    "question": "What is the condition that the letter will invite the player to meet Emily in the Secret Woods?",
    "context": "At Ten Hearts, if the condition \"A letter will invite the player to meet Emily in theSecret Woodsafter 10pm that night.\" is met, the event is as follows: You go camping with Emily in the Secret Woods . There is strange grunting coming from the forest. She says it's cold and snuggles up close to you by the fire. A bear comes out of the woods and approaches your campsite. It grunts loudly and you both jump and dive into the tent. The bear sniffs around and leaves. Emily says that one of the sleeping bags is still out there, and she's not willing to go out and get it... so you have to share a bag. You hear movement in the tent, the screen fades and the day ends. The next day, the player receives a letter from Emily, saying “ “Thanks for joining me last night... I had a great time. I'm actually glad that bear showed up! See you soon Love, Emily”",
    "answer_text": "after 10pm",
    "answer_start": 97
  },
  {
    "id": "leah/leah-heart_event_ten_hearts.txt",
    "question": "What is the condition of entering Cindersap Forest between 11 AM and 4 PM on a sunny day?",
    "context": "At Ten Hearts, if the condition \"EnterCindersap Forestbetween 11 AM and 4 PM on a sunny day, in any season except winter.\" is met, the event is as follows: Leah says she knew you'd be passing through the forest, and surprises you with a picnic. She thanks you for helping her get one step closer to being a real artist, and you share a kiss. Kel Leah's ex-partner Kel comes out of the bushes. (Kel will be male or female depending on your player character's gender.) Leah is annoyed and asks \"What the heck are you doing here?\" If you suggested the art website, Kel says \"I found your online art store... weren't you wondering about the 'Mr. K' who kept buying all your sculptures?\" Leah is disappointed, because she thought it was \"just a rich guy\" who truly loved her art. Kel says she was \"half right\", implying that Kel doesn't care about her art. Kel says \"I want you back. I miss you.\" Leah refuses, saying Kel was never interested in her art until she became successful. If you suggested the art show, Kel says \"I came all the way from Zuzu City to see your sculptures. ...And to get you to come back with me.\" Kel claims to want their relationship to be the way it was before. Leah refuses, saying Kel was never interested in her art until she became successful. Either way, an argument ensues. You can choose to \"Punch Kel in the face\" or \"Try reasoning with Kel\". If you don't punch Kel, Leah does instead. If you do punch Kel, Leah says that Kel is fine but \"That was pretty violent, (Name).\" Leah takes you to find a more secluded spot and admits the picnic didn't quite pan out like she'd wanted it to.",
    "answer_text": "in any season except winter",
    "answer_start": 93
  },
  {
    "id": "alex/alex-heart_event_six_hearts.txt",
    "question": "Who does Alex apologize to for acting rude and arrogant?",
    "context": "At Six Hearts, if the condition \"Enter Alex's house when he's there.\" is met, the event is as follows: Alex expresses doubt about being able to go pro as a gridball player. He apologizes to you for acting rude and arrogant and appreciates how you stuck with him despite all that. You provide some encouragement (no choices necessary), and Alex will return to his strength workout with renewed vigor.",
    "answer_text": "Alex's house",
    "answer_start": 39
  },
  {
    "id": "sebastian/sebastian-schedule_summer___rain__option_2_.txt",
    "question": "How many hours does sebastian spend at the saloon?",
    "context": "On Summer → Rain (Option 2), At 9:00 AM, sebastian in his bed At 10:30 AM, sebastian gets out of bed and moves to his computer At 3:00 PM, sebastian leaving house to go to the saloon At 5:20 PM, sebastian at the saloon, standing by red sofa in arcade At 9:10 PM, sebastian heads home At 11:10 PM, sebastian arrives home.",
    "answer_text": "5:20 PM",
    "answer_start": 186
  }
]